[{"title":"Furniture+ (3D Block Models!) (Updated!)","briefDescription":"Did you ever think that Minecraft does not have enough, or any furniture, but didn\u0027t want to download other add-ons because the furniture is too ...","Description":"","crawledImageUrls":[{"text":"Did you ever think that Minecraft does not have enough, or any furniture, but didn?t want to download other add-ons because the furniture is too complex or they are using mobs? Well, this is the addon for you! This addon adds simple furniture into Minecraft using custom 3D blocks!\nThis addon adds new blocks using the new feature to make Custom 3D blocks in the latest beta.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_2.png"},{"text":"These are the new blocks this addon adds.\nThe furniture crafting table is a custom crafting table that lets you create the furniture in Furniture+. You need to use this to craft all the furniture in the addon. If you use a normal crafting table, it won?t work.\nHere is what the furniture crafting table looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/246347238ef09ee32cb43e24ca655b35.png"},{"text":"Here is how to craft it.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_3.png"},{"text":"The oven block is a block with no function yet except that if you click it, a crafting menu opens. It mostly serves as a decoration block for now.\nThe oven looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_2.png"},{"text":"The Oven crafting recipe is.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_4.png"},{"text":"The crafting menu looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_9.png"},{"text":"You can see that its a block and not an entity because it?s highlighting it.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_3.png"},{"text":"The fridge block is a block with no function yet. It serves as a decoration block. The fridge does rotate. You can rotate it by facing the way you want when placing the block.\nIt looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_4.png"},{"text":"Here is how you craft the Fridge block.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_5.png"},{"text":"The table block is a block with no function yet. It serves as a decoration block. You can place another block on top of it, and it can be crafted.\nIt looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_5.png"},{"text":"Here is how you craft the Table.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_6.png"},{"text":"The diving board block is a block with no function yet. It serves as a decoration block. The Diving Board does rotate. You can rotate it by facing the way you want when placing the block.\nIt looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_6.png"},{"text":"The couch block is a block with no function yet. It serves as a decoration block. The Couch does rotate. You can rotate it by facing the way you want when placing the block.\nIt looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_7.png"},{"text":"Here is the recipe to craft the couch.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_7.png"},{"text":"The chair block is a block with no function yet but it does rotate. You can rotate it by facing the way you want when placing the block. It serves as a decoration block for now.\nIt looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_8.png"},{"text":"Here is how you craft the chair using the Furniture Crafting Table.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_8.png"},{"text":"The old tv block is a block with no function yet. It serves as a decoration block. The old tv block does rotate. You can rotate it by facing the way you want when placing the block.\nThe Old TV looks like this.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_10.png"},{"text":"Here is how you craft the old TV.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_9.png"},{"text":"The TV Stand block is a block with no function yet. It serves as a decoration block. The TV Stand does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what it looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_11.png"},{"text":"The picture below is how to craft the TV stand.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_10.png"},{"text":"The Flat Screen TV block is a block with function. It serves as a decoration block and if you click on it, it gives off light. The Flat Screen TV does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what it looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_12.png"},{"text":"This is the crafting recipe to craft the Flat Screen TV.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_11.png"},{"text":"The lamp block is a block that does have a function. The lamp can be turned on or off by right-clicking on it. When the lamp block is on, it gives off light, and when it?s off, it does not give off light.\nHere is what the lamp looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_13.png"},{"text":"And here is how to craft the lamp.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_12.png"},{"text":"The Laptop block is a block with no function yet. It serves as a decoration block. The Laptop does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what the lamp looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_14.png"},{"text":"The Cabinet block is a block with no function yet. It serves as a decoration block. The Cabinet does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what the cabinet looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models_15.png"},{"text":"This is how to craft the Cabinet in the furniture crafting table.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/furniture-3d-block-models-updated_13.png"},{"text":"The Toaster block is a block with no function yet. It serves as a decoration block. The Toaster does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what the toaster looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/fc098b3d0583e3e145f7329fec2a2836.png"},{"text":"The Rocking Chair block is a block with no function yet. It serves as a decoration block. The Rocking Chair does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what the Rocking Chair looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/12eb0a3bf90db8317b927905235f3c2c.png"},{"text":"The Wall Shelf block is a block with no function yet. It serves as a decoration block. The Wall Shelf does rotate. You can rotate it by facing the way you want when placing the block.\nHere is what the Wall Shelf looks like.\n","url":"https://my.mcpedl.com/storage/addons/5221/images/34dec943931f549e8748e442ef677ddb.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/furniture-3d-block-models-updated_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5221/FurnitureAddonV0.4.zip"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fvonasort.com%2F2GNZ\u0026post_id\u003d158366"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fraboninco.com%2F2DxNv\u0026post_id\u003d158366"}],"uploadedBy":"Minicookie1811","uploadedAt":"18 Sep, 2020 (Updated)","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/furniture-3d-addon/"},{"title":"Human Addon","briefDescription":"Have you ever wanted a new civilization then the villagers will now you do this. This addon adds two new humans to the game: Female ...","Description":"","crawledImageUrls":[{"text":"Have you ever wanted a new civilization then the villagers will now you do this. This addon adds two new humans to the game: Female Human and Male Human and soon a Baby Human.\n","url":"https://my.mcpedl.com/storage/addons/5187/images/human-addon_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5187/images/human-addon_4.png"},{"text":"this is the female\nHuman she spawns in the overworld very frequently she can carry axes Pickaxes swords and shovels and this picture doesn?t look like the one in game but this only picture I can find that is similar to it.\n","url":"https://my.mcpedl.com/storage/addons/5187/images/human-addon_5.png"},{"text":"this is the male Human he spawns in the overworld they cannot be breed yet but soon and they carry axes pickaxes shovels and swords also they kill monsters if there stuck in the dark same thing for the female Human and soon I will add a archer to this Addon of both versions for the female and the Male.\nAnd here are some in Game pictures that took a picture of.\n","url":"https://my.mcpedl.com/storage/addons/5187/images/human-addon_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/human-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5187/Human-Addon-_1599366262746_1600885427.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5187/Human-Addon-_1599366262746_1600099850.mcaddon"},{"href":"http://Human Addon Mcaddon"},{"href":"http://Human Addon aphla 1 Mcaddon"}],"uploadedBy":"Mr Galaxy","uploadedAt":"14 Sep, 2020 (Updated)","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/human-sw-addon/"},{"title":"Friends Addon","briefDescription":"Do you feel very lonely? You do not have friends? Do you want to have \"human\" company? Are you forever alone, introverted, or simply antisocial?...","Description":"","crawledImageUrls":[{"text":"Do you feel very lonely? You do not have friends? Do you want to have ?human? company? Are you forever alone, introverted, or simply antisocial?\nWell then this addon is for you, my dear and alone friend\nWell, to start, you should know that there are 2 new entities, which are:\n? Steve\n? Alex\nThese two entities are able to appear in any biome belonging to the overworld, with an 87.5% probability of spawning in a chunk near you.\nWithout further ado, we delve into Steve, the first entity.\nSteve\nSteve is the male entity that this addon adds, with the texture of a steve default without any news regarding that.\nSteve will always appear equipped with an iron sword and will attack all hostile mobs except the ghasts and the Ender dragon for obvious reasons.\nSteve can be tamed with any food the player can consume.\nOnce tamed, it will follow the player and attack all monsters near the player\nSo now let?s move on to the basic stats.\nID:Friends:Steve\nExp drop: 7\nHealth: 20\nMovement speed: 0.25\nInventory slots: 9\nTime for drowning: 20 seconds\nAttack damage: 4 (+6 for iron sword\u003d10)\nAttack speed: 1.5\nAttack range: 30 blocks.\nImage:\n","url":"https://my.mcpedl.com/storage/addons/5363/images/friends-addon_2.png"},{"text":"Alex\nAlex is the female npc that adds this addon, with the default texture of alex that Minecraft adds.\nAlex will always be equipped with a bow, so she will only attack from a distance.\nAlex will attack absolutely every mob in the monster category except the enderman because he can teleport.\nAlex can be tamed with any food that the player can consume.\nOnce tamed, it will follow the player and defend him from any monster.\nSo now let?s move on to the basic stats.\nID:Friends:Alex\nExp drop: 6.5\nHealth: 20\nMovement speed: 0.22\nInventory slots: 9\nTime for drowning: 20 seconds\nAttack of bow: 3\nAttack speed: 2\nBurst attacks: 2\nBurst attacks reload: 0.25\nAttack range: 30 blocks\nImage:\n","url":"https://my.mcpedl.com/storage/addons/5363/images/friends-addon_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/friends-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5363/Friends-addon.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5363/Friends-addon.zip"}],"uploadedBy":"GygaZaid","uploadedAt":"26 Sep, 2020 (Updated)","supporteds":["1.14","1.15 (beta)","1.16","1.16.100"],"originUrl":"https://mcpedl.com/friends-addon/"},{"title":"Minecraft Earth Features Addon ? Big Update!","briefDescription":"If you?ve ever played Minecraft Earth, then you will know there are a plethora of unique items and mobs available on it. But did ...","Description":"","crawledImageUrls":[{"text":"If you?ve ever played Minecraft Earth, then you will know there are a plethora of unique items and mobs available on it. But did you ever want to see some of these features come to normal Minecraft? No? Well, me neither but here they are anyway!\nThis addon is currently a work in progress, but it will be adding several blocks, mobs and items from Minecraft Earth. Some of the content isn?t finished yet, but you can check it out right now as it is! Let?s take a look at the mobs first, shall we?\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_2.png"},{"text":"This addon adds about 36 new mobs into the game, all of which come from Minecraft Earth! I?m not going to be diving deep into each of them, as most of them are just variants of already existing mobs. We will have a better look at some of the more interesting ones, though! The mobs currently added include:\n*Muddy Foot Rabbit\n*Pale Pig\n*Bone Spider\n*Pink Moobloom\n*Moobloom\n*Skeleton Wolf\n*Cluckshroom\n*Glow Squid\n*Cookie Cow\n*Flecked Sheep\n*Jumbo Rabbit\n*Gold Crested Chicken\n*Tropical Slime\n*Ashen Cow\n*Harlequin Rabbit\n*Jolly Llama\n*Vested Rabbit\n*Albino Cow\n*Wooly Cow\n*Muddy Pig\n*Skrewbald Chicken\n*Spotted Pig\n*Pink Footed Pig\n*Rainbow Sheep\n*Furnace Golem\n*Bronzed Chicken\n*Brule Cow\n*Midnight Chicken\n*Sooty Pig\n*Piebald Pig\n*Stormy Chicken\n*Sunset Cow\n*Molted Pig\n*Dyed Cat\n*Dairy Cow\n*Pinto Cow\nNow lets have a deeper look into some of the interesting mobs!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_3.png"},{"text":"Bone Spiders are undead mobs that will spawn in Taiga biomes. They have much better health and speed then the other two spiders, but instead of doing melee attacks they will fire projectiles at you! They will also burn in sunlight similarly to skeletons and zombies. May drop some bones if killed.\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_4.png"},{"text":"Tropical Slimes will spawn on beaches. They are mostly peaceful, and only attack if you get too close. Will drop a tropical fish if killed\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_5.png"},{"text":"The Wooly Cow is a very useful mob that merges the uses of cows and sheep, they can drop leather, wool and beef if killed! They will spawn on extreme hills biomes.\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_6.png"},{"text":"The Bronzed Chicken is a type of chicken that spawns in most biomes that normal chickens will. They behave the exact same way as a chicken, but with one key difference: they can drop a Fancy Feather if killed! The feather has no uses, but it DOES look fancy!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_8.png"},{"text":"Mooblooms are strange creatures that appear in plains and forests. Their model is still a work in progress, but killing one may give you a buttercup! The Moobloom also has a pink variant found in flower forest biomes!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_9.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon--big-update_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_10.png"},{"text":"Glow Squids are very odd squids that sometimes appear in oceans. It is currently bugged in more ways then one, though. They don?t move properly and they don?t glow! Sorry about that. It will be fixed eventually!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_11.png"},{"text":"Muddy Pigs are playful pigs that enjoy rolling around in mud and getting all muddy. You can find them in swamps!\nOn the topic of mud, you can make a bucket of mud with dirt and a water bucket. With that mud bucket, you can then make a slippery mud block!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_12.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_13.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_14.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_15.png"},{"text":"Cluckshrooms are fungus-covered chickens that reside on mushroom islands. They may drop some chicken or a mushroom if killed.\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_20.png"},{"text":"Think the iron golems are the biggest and toughest golems in all of Minecraft? Well, the Furnace Golem will prove you wrong! Just when you thought they couldn?t be tougher, the Furnace Golem is even bigger and stronger then the normal iron golem. It?s fire immune and will attack all enemies and weaken them! However, it does have its disadvantages. They are slower then iron golems and will take damage from rain and water. Drops a blast furnace if killed\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon--big-update_3.png"},{"text":"Skeleton Wolves are very spooky wolf types that appear in desert biomes. They are usually neutral, but sometimes they will randomly decide to attack you so be careful around them! Their attacks will inflict weakness onto you! They also burn in the sun just like Bone Spiders do. Skeleton Wolves may drop some bones if killed.\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon--big-update_4.png"},{"text":"The Jolly Llama is a very festive llama type that enjoys colder weather! As such, they will reside in snowy biomes. You can tame them by either riding on one until heart particles appear, or you can crouch and then feed one some cookies or sweet berries! Jolly Llamas are more obedient then normal Llamas, they will follow you around and even fight for you when tamed! They will not hesitate to attack if you hit them though, treat these nice guys with respect.\nThere are also a few more nice features available in this addon!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_16.png"},{"text":"Rainbow Wool is an awesome looking block that will work like a charm in builds with a lot of colour! Rainbow Wool can also be made into a rainbow bed, but it doesn?t do anything for now. Rainbow Wool can sometimes be dropped from Rainbow Sheep. Rainbow Sheep will spawn in flower forest biomes!\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_17.png"},{"text":"Rubies are a really nice, shiny material which looks very glamorous and beautiful! You can also make a nice ruby block out of them! To obtain rubies, you must travel fairly deep underground, around the same level diamonds are found, and look for ruby ore! Ruby Ore drops a ruby or sometimes itself when broken, if it drops itself just place the ore back down and break it again.\n","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_18.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_19.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon--big-update_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5170/images/minecraft-earth-features-addon_21.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/minecraft-earth-features-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5170/Minecraft-Earth-Addon---Big-Update.mcaddon"}],"uploadedBy":"Wither Lord","uploadedAt":"14 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/minecraft-earth-features-addon/"},{"title":"Clay Soldier Addon (1.16+)","briefDescription":"The Clay Soldier mod in BEWhy don\u0027t you fight, conquer other countries, and join these clay soldiers? Build your army and start a war with ...","Description":"","crawledImageUrls":[{"text":"The Clay Soldier mod in BE\nWhy don?t you fight, conquer other countries, and join these clay soldiers?\nBuild your army and start a war with your friends! ! !\n","url":"https://my.mcpedl.com/storage/addons/5296/images/clay-soldier-addon--116-_2.png"},{"text":"Nice to meet you! I was thinking about what to do with my friends and I implemented clay soldier mode in BE, which I had fun with on my PC. This mode is a little different from the PC.\nNew item / Item code\nWhite Soldier Controller : kr:soldier1\nRed Soldier Controller : kr:soldier2\nBlack Soldier Controller : kr:soldier3\nGreen Soldier Controller : kr:soldier4\nOrange Soldier Controller : kr:soldier5\nYellow Soldier Controller : kr:soldier6\nTo Get this Item\n: /function item\nIf you sneak to hold your clay soldier controller , your clay soldiers will move to you.\nAnd if you click the ground, the nearest entity will be set as the target based on you and your clay soldiers will attack it.\n","url":"https://my.mcpedl.com/storage/addons/5296/images/clay-soldier-addon--116-_3.png"},{"text":"Clay Soldier [ All Types ]\nHP : 20\nATK : 3\nFeature : To break log , dirt , planks , cobblestone.\nThere are 6 kinds of Clay Soldiers.\n","url":"https://my.mcpedl.com/storage/addons/5296/images/clay-soldier-addon--116-_5.png"},{"text":"Since it is still a beta version, there are not many different armies yet. But I will update it later, so please look forward to it!\nThis item can also be obtained by command language, so please refer to it.\n","url":"https://my.mcpedl.com/storage/addons/5296/images/clay-soldier-addon--116-_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/clay-soldier-addon-116-_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5296/Clay-Soldier-Addon.mcaddon"}],"uploadedBy":"SteepGoingDo","uploadedAt":"26 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/clay-soldier-addon/"},{"title":"Life Addon","briefDescription":"Have you ever thought that minecraft doesn\u0027t have alot of animals for you to fall in love with well now you do this Addon adds ...","Description":"","crawledImageUrls":[{"text":"Have you ever thought that minecraft doesn?t have alot of animals for you to fall in love with well now you do this Addon adds new mobs like brown bear boar brown wolf black bear rooster and white cow.\nThis is the full showcase so click here to see it.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_14.png"},{"text":"This is white cow texture I already covered this if you scroll down.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_15.png"},{"text":"This is the boar I already covered this as well if you scroll down you will see a boar like this.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_16.png"},{"text":"I also covered the black bear if you scroll down as well.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_17.png"},{"text":"This is the brown bear I already covered this too if you scroll down.\nSo these are some of the in game images and the two other mobs will be featured at the very bottom it is the brown Wolf and the rooster.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_8.png"},{"text":"This the brown Wolf egg.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_9.png"},{"text":"This is the white cow egg.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_10.png"},{"text":"This is the Boar egg.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_11.png"},{"text":"This is the black bear egg.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_12.png"},{"text":"This is the brown bear egg.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_13.png"},{"text":"This is a rooster egg.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_2.png"},{"text":"This is the white cow they spawn anywhere in the overworld they can?t be milk yet but I will add that soon you can breed them with an apple for right now and they are scared of any monster and they are scared of brown bear brown wolf and black bear.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_3.png"},{"text":"This is the boar this animal spawn anywhere in the overworld and you can breed them with a carrot and they can attack you with there horns if you get to close same thing for villagers there are not scared of black bear brown bear and brown Wolf.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_4.png"},{"text":"This the black bear they spawn in taiga biomes they attack villagers if they get to close the attack passive mobs like the white cow boar and the rooster you can breed them with beef and when killed they drop beef bones and leather same thing with the brown bear.\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_5.png"},{"text":"The brown bear spawns in forests and it could be breed with beef it will attack passive mobs like you and other things but that?s all about them also they attack villagers if there to close.\nThese are the mobs that I don?t have clear pictures of and In game images\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_6.png"},{"text":"This is the rooster it spawns anywhere in the overworld they don?t like being near the brown bear black bear and the brown wolf you can breed them with wheat seeds but that?s all about them\n","url":"https://my.mcpedl.com/storage/addons/5196/images/life-addon_7.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/life-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5196/life-Addon-_1600205634063_1600206867.mcaddon"}],"uploadedBy":"Mr Galaxy","uploadedAt":"26 Sep, 2020 (Updated)","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/life-spiritwolf20-addon/"},{"title":"Break a Leg!","briefDescription":"Are you tired of falling to your death. Do you take loads of fall damage for NO REASON? Well this is the add-on for you! ...","Description":"","crawledImageUrls":[{"text":"Are you tired of falling to your death. Do you take loads of fall damage for NO REASON? Well this is the add-on for you! This add-on will make it so that if you?re sneaking, you?ll take less fall damage.\nDon?t believe me? I?ll prove it!\n","url":"https://my.mcpedl.com/storage/addons/5333/images/break-a-leg_2.png"},{"text":"So as you can see in the picture above, I fell from a great distance (53 blocks) and died a sad death.\nBut as you can see from the image below:\n","url":"https://my.mcpedl.com/storage/addons/5333/images/break-a-leg_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/break-a-leg_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5333/Fall-Damage_1600967428.mcpack"}],"uploadedBy":"Lavava","uploadedAt":"25 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/break-a-leg-addon/"},{"title":"Ocelots Pets Plus (ADD-ON)","briefDescription":"This is an addon add news 4 Ocelots mobs . You can tame all Ocelots with salmon fish and they follow you in your minecraft world. All ...","Description":"","crawledImageUrls":[{"text":"This is an addon add news 4 Ocelots mobs .\nYou can tame all Ocelots with salmon fish and they follow you in your minecraft world.\nAll Ocelots Spawn natural in your minecraft world.\nYou can give nickname with Name tag and this show always.\nThe 4 New Ocelots : OcelotNether , OcelotCat , WaterOcelot , EnderOcelot\nIf you loves Ocelots / cats and you want more , this its your addon !!\nVideo\n??????????????????????\nCreator : Pandikax\nVersion ? 1.0\nit works in your Minecraft version 1.16 : Pe ? Windows 10\n??????????????????????\nSome of the features are:\n","url":"https://my.mcpedl.com/storage/addons/5300/images/ocelots-pets-plus--addon-_2.png"},{"text":"Ocelotcat ? This ocelot like same a cat\n","url":"https://my.mcpedl.com/storage/addons/5300/images/ocelots-pets-plus--addon-_3.png"},{"text":"OcelotNether ? attacks you if you are near with fireballs , Spawn in Nether\n","url":"https://my.mcpedl.com/storage/addons/5300/images/ocelots-pets-plus--addon-_4.png"},{"text":"WaterOcelot ? This ocelot attacks you if you are near with Trow Trident, Spawn in Beachs\n","url":"https://my.mcpedl.com/storage/addons/5300/images/ocelots-pets-plus--addon-_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/ocelots-pets-plus-addon-_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5300/Ocelots-Pets-Plus.mcaddon"}],"uploadedBy":"Pandikax","uploadedAt":"25 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/ocelots-pets-plus-add-on/"},{"title":"Cuttable Wood in the Stonecutter Addon","briefDescription":"Cuttable woodHello! This is my frist addon(Sorry for my bad English)In this addon you can cut the wood into slabs and stairs, you ...","Description":"","crawledImageUrls":[{"text":"Cuttable wood\nHello! This is my frist addon\n(Sorry for my bad English)\nIn this addon you can cut the wood into slabs and stairs, you can do it with all the other woods from the overworld.\nIf you need slabs or stairs in an exact number because you always have enough or you don?t have enough wood to make a slab or stair, this addon is your salvation!\nDescription\nIf you want slabs press the slab button and cut the wood, like the stairs, when creating the slabs it gives you 2 slabs and if you create a stair it only gives you 1 stair.\nYou don?t need any command to activate the addon, just have the stonecutter and the wood already and cut it into the stonecutter.\nyou can cut all the woods you find in the overworld, but you can?t cut the nether woods until the next update (warped wood and scarlet wood)\njust like vanilla\nRemember to activate the EXPERIMENTAL mode of the world. The addon for some reason has a texture package, it is a bug, I still recommend that you put it to avoid errors.\nIf you like this addon, I can add the nether woods and create fences.\nScreenshots:\nOak wood:\n","url":"https://my.mcpedl.com/storage/addons/5302/images/cuttable-wood-in-the-stonecutter-addon_8.png"},{"text":"spruce wood:\n","url":"https://my.mcpedl.com/storage/addons/5302/images/cuttable-wood-in-the-stonecutter-addon_9.png"},{"text":"Other woods\n","url":"https://my.mcpedl.com/storage/addons/5302/images/cuttable-wood-in-the-stonecutter-addon_10.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5302/images/cuttable-wood-in-the-stonecutter-addon_11.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5302/images/cuttable-wood-in-the-stonecutter-addon_12.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5302/images/cuttable-wood-in-the-stonecutter-addon_13.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/cuttable-wood-in-the-stonecutter-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5302/stonecutter-wood-update_1600817805471.mcaddon"},{"href":"http://www.mediafire.com/file/7f9al8xm2nlakts/stonecutter+wood+update_1600817805471.mcaddon/file"}],"uploadedBy":"DooTCraft","uploadedAt":"24 Sep, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/cuttable-wood-stonecutter-addon/"},{"title":"More Armor Stand Add-on (1.16.100.56) Only","briefDescription":"In Minecraft there is only one armor stand, but this addition will increase the In Minecraft there is only one armor holder, but this addition ...","Description":"","crawledImageUrls":[{"text":"In Minecraft there is only one armor stand, but this addition will increase the In Minecraft there is only one armor holder, but this addition will increase the number of armor stand (of all types of wood) wood) Types: Oak, Spruce, Birch, Jungle, Acacia, Dark Oak, Crimson, Warped.\n","url":"https://my.mcpedl.com/storage/addons/4399/images/more-armor-stand-addon_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/more-armor-stand-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/4399/More-Stands-Shelfs-Crafting_1600845435.zip"},{"href":"https://dl.mcpedl.com/addons/4399/More-Stands-Shelfs-Crafting_1600845435.mcaddon"}],"uploadedBy":"Khale1d23","uploadedAt":"30 Jul, 2020 (Updated)","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/more-armor-stand-add-on/"},{"title":"More Wood Addon","briefDescription":"I always think Minecraft has not enough types of wood. I will try to fix it. I will update this addon often if you suggest ...","Description":"","crawledImageUrls":[{"text":"I always think Minecraft has not enough types of wood. I will try to fix it. I will update this addon often if you suggest what you always wanted, and most of the suggestions will be considered.\n","url":"https://my.mcpedl.com/storage/addons/4288/images/more-wood-addon_2.png"},{"text":"The blocks can be obtained only with commands for now. Use /function more_wood to obtain almost all blocks.\n1st version adds green and pink wood, the first called Chloroeen (chlorophyll+green; this will not be changed becouse I started to like It, sugges) and the second called Sakura. They have the log, the wood, the stripped log and wood and the planks versions. There will not be slabs or stairs. I will soon add colored wood tools! I don?t really like the chloroeen planks, i will change their texture.\n","url":"https://my.mcpedl.com/storage/addons/4288/images/more-wood-early-release_4.png"},{"text":"In the 3rd version we can find 2 new types of wood: yellowish and purple heart (suggested on discord by Dragon0087, textures made by him)\nAdded libraries for every vanilla wood.\n","url":"https://my.mcpedl.com/storage/addons/4288/images/more-wood-early-release_5.png"},{"text":"The texture and the code were made by me, so leave credits. The Chloroeen and the Yellowish are retextures of the Crimson wood and the Sakura is a retexture of the oak wood\nIn the 5th version, the yin and yang update, you will find yin(black) and yang(white) trees. I hope you will like It.\nAdded working armor stands (only summonable) for the new wood types.\nInspired by the More Armor Stand Addon check It out!\n","url":"https://my.mcpedl.com/storage/addons/4288/images/more-wood-addon_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/4288/images/more-wood-early-release_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/more-wood-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/4288/More_Wood_v61_1600766047.zip"},{"href":"https://dl.mcpedl.com/addons/4288/More_Wood_v6_1600766047.mcaddon"}],"uploadedBy":"Ftere","uploadedAt":"25 Jul, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/more-wood-addon/"},{"title":"Soul Mobs","briefDescription":"The soul fire is out of controlMobs around the overworld , nether and the end are being transformed into their soul variants This texture pack will ...","Description":"","crawledImageUrls":[{"text":"The soul fire is out of control\nMobs around the overworld , nether and the end are being transformed into their soul variants\nThis texture pack will change the looks of the mobs , how cool is that !\nFrom soul ghast to even soul drowned\nThese soul Mobs are taking over the over world , nether and the end!\nMake sure you are geared up to fight these mobs , because they can give a good punch\nF\nrom creepers to fast Blaze !\nAre you ready for the challenge!\n","url":"https://my.mcpedl.com/storage/addons/5005/images/soul-mobs_3.png"},{"text":"This is the soul skeleton\n","url":"https://my.mcpedl.com/storage/addons/5005/images/soul-mobs_4.png"},{"text":"Soul enderman\n","url":"https://my.mcpedl.com/storage/addons/5005/images/soul-mobs_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5005/images/soul-mobs_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/soul-mobs_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5005/Soul-Mobs_1599659415.mcaddon"}],"uploadedBy":"Knight_Slasher","uploadedAt":"4 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/soul-mobs-addon/"},{"title":"Concrete Slabs","briefDescription":"Have you ever dreamed of concrete slabs being added to Minecraft? I know a few people who have, one of those being me so I ...","Description":"","crawledImageUrls":[{"text":"Have you ever dreamed of concrete slabs being added to Minecraft? I know a few people who have, one of those being me so I decided to create it in the new Beta update!\n","url":"https://my.mcpedl.com/storage/addons/5250/images/concrete-slabs_3.png"},{"text":"This addon adds in all 16 different colours of concrete with recipes for all of them! Let your creativity roam free with the new possibilities unlocked by concrete slabs.\n","url":"https://my.mcpedl.com/storage/addons/5250/images/concrete-slabs_2.png"},{"text":"The recipe is the same as any other type of slab, 3 blocks of concrete horizontally across. Make sure to use the same type of concrete, there are not mixed concrete coloured slabs.\n","url":"https://my.mcpedl.com/storage/addons/5250/images/concrete-slabs_7.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/concrete-slabs_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5250/Concrete-Slabs.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5250/Concrete-Slabs.mcpack"},{"href":"https://dl.mcpedl.com/addons/5250/Concrete-Slabs.zip"}],"uploadedBy":"MajestikButter","uploadedAt":"21 Sep, 2020 (Updated)","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/concrete-slabs-addon/"},{"title":"Warped Warts Addon","briefDescription":"Did you ever look at the Nether Update, and wonder as to why we received a warped wart block but not a warped wart? This ...","Description":"","crawledImageUrls":[{"text":"Did you ever look at the Nether Update, and wonder as to why we received a warped wart block but not a warped wart? This addon will be seeking to fix that problem. With these warped warts you could create new blocks and even a new consumable! Hope you enjoy this!\nLet?s answer the first question, how do you get these new warped warts? Currently you can just make them with a warped wart block which results in nine warped warts. The crafting recipe is shapeless and you can make it in the 2?2 grid!\n","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_2.png"},{"text":"The next question to answer is what do these warts do? Well currently they have four uses! The first one is to create a new Blue Nether Brick block. This feature was highly requested for the nether update but never made it in so I decided to add it here!\n","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_4.png"},{"text":"The second new function for this warped wart is to create another new block which is the Blue Magma Block! It does not have any of the behaviours of the normal one but emits a lot of light and is a bit slippery!\n","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_6.png"},{"text":"The next use is that you can make a new Warped Brew drink! If you drink this you will be given some positive and negative status effects, see below. Note that this has to be made in the crafting table and you have to use a water bottle the awkward potion will not work! It might change in the future though!\n","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_8.png"},{"text":"The final use for the warped wart is fairly simple, you can turn 9 of them back into a warped wart block.\n","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_9.png"},{"text":"Additionally, we also made a small change to make sure that both nether wart block types link together. That small change is that you can now turn a nether wart block into 9 nether warts!\n","url":"https://my.mcpedl.com/storage/addons/5261/images/warped-warts-addon_10.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/warped-warts-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5261/Warped-Warts-addon.mcaddon"}],"uploadedBy":"AwesomeGamer7602","uploadedAt":"21 Sep, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/warped-warts-addon/"},{"title":"Minecraft, But It?s Underwater v1.0.0","briefDescription":"Hello everybody in MCPEDL! I have made an addon that, when applied, turns your newly generated minecraft world into an ocean. This becomes a challenge ...","Description":"","crawledImageUrls":[{"text":"Hello everybody in MCPEDL! I have made an addon that, when applied, turns your newly generated minecraft world into an ocean. This becomes a challenge where endermen cannot survive and will die, and you can?t go to the nether without getting lost yourself if you somehow light a portal underwater, but the addon adds some workarounds to ensure you beat minecraft.\nThis addon can be applied to any world, and any worlds that are applied with the addon, will suddenly flood the world around you. Some vanilla features had to be tweaked, every mob can breathe underwater, and spawn underwater. But due to an error/bug, all mobs that spawn at night will spawn regardless if it is night or not, but I think that will make a great feature. Here is a list of the changes and other important things I need to address\nWhat is new in this addon?\n-Worlds will be flooded and mobs are able to breathe underwater\n-Monsters that spawn at night will spawn at day\n-Endermen will always die, so there?s a different way that has been implemented to get to The End. Here?s what I implemented as a workaround.\n-You can craft an new item, Pearls, crafting recipe can be found below.\n","url":"https://my.mcpedl.com/storage/addons/5277/images/minecraft-but-its-underwater-v100_2.png"},{"text":"?You can put cobblestone in a Blast Furnace to give the cobblestone extreme heat and pressure to transform the cobblestone to End Stone.\n","url":"https://my.mcpedl.com/storage/addons/5277/images/minecraft-but-its-underwater-v100_3.gif"},{"text":"-Ender Pearls are now craft-able by the new Pearl item and End Stone. Recipe is shown below\n","url":"https://my.mcpedl.com/storage/addons/5277/images/minecraft-but-its-underwater-v100_4.png"},{"text":"-Ender Pearls can be put into furnaces and be transformed into ender eyes for getting in The End\n","url":"https://my.mcpedl.com/storage/addons/5277/images/minecraft-but-its-underwater-v100_5.gif"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/minecraft-but-its-underwater-v100_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5277/Minecraft-but-underwater_1600686484.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5277/Minecraft-but-underwater_1600686485.zip"},{"href":"http://www.mediafire.com/file/clw4qzdi07wjg0b/Minecraft,+but+underwater.mcaddon/file"},{"href":"http://www.mediafire.com/file/37tmmk9eyysg38m/Minecraft,+but+underwater.zip/file"}],"uploadedBy":"Popularsonic","uploadedAt":"21 Sep, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/minecraft-but-its-underwater-addon/"},{"title":"Player Sizes Editer Add-on","briefDescription":"You can change player size!Get Reduce and Expand and click anywhere or use them.(in scoreboard mode)This will adjust the player allocation score ...","Description":"","crawledImageUrls":[{"text":"You can change player size!\nGet Reduce and Expand and click anywhere or use them.(in scoreboard mode)\nThis will adjust the player allocation score of the ?scale? on the scoreboard.\nThe tags that adjust the score and scale of the scale scoreboard correspond.\nCurrently, I am trying to create a function that allows me to change my gaze when I resize it. There are many problems with this function, so I can?t use it yet, but I will try my best to develop it\nIf you don?t want to resize through the scoreboard, you can use Tag mode\nThen you can adjust the scale with tags.\nThere?s an introductory video that?s easy to watch on my YouTube\nmy CHANNEL\nhttps://www.youtube.com/channel/UCPmjqMHu3p5YrYBQuFn8WCQ\nmy video\nhttps://youtu.be/IaUFZmrSlAw\n","url":"https://my.mcpedl.com/storage/addons/5242/images/player-sizes-editer-addon_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5242/images/player-sizes-editer-addon_3.png"},{"text":"scaleP:reduce(scoreboard mode)\n","url":"https://my.mcpedl.com/storage/addons/5242/images/player-sizes-editer-addon_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5242/images/player-sizes-editer-addon_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/player-sizes-editer-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5242/Player-sizes-editor-add-on_1600873284.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5242/Player-sizes-editor-add-on_1600873284.zip"},{"href":"https://dl.mcpedl.com/addons/5242/player-sizes-editer-addon_1600539900.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5242/player-sizes-editer-addon_1600539901.zip"},{"href":"https://youtu.be/IaUFZmrSlAw"},{"href":"https://youtu.be/IaUFZmrSlAw"}],"uploadedBy":"S.Lim","uploadedAt":"21 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/player-sizes-editer-add-on/"},{"title":"Space Craft Addon (Updated!)","briefDescription":"This addon adds new structures, decoration blocks, entities, crafting blocks, and more. The goal of this addon is to make Minecraft have more stuff about ...","Description":"Asteroid Rock Block\n1 Meteors with diamonds\n\n2 Meteors With Gold\n\n3 Normal Meteors\n\n\nThe other blocks are just decoration. Here is a list of all the blocks.\nYou cannot get these blocks in survival yet. The only way of getting them is by typing /give @p spacecraft:[name of the block you want] or by typing /function Space_Craft. the function gives you almost every block in the addon.\n\n\nMars Dust and Mars Rock Block.\nThe Mars dust is like grass but for the planet Mars.\n\n\nThe Moon Dust and Moon Rock Block.\n","crawledImageUrls":[{"text":"This addon adds new structures, decoration blocks, entities, crafting blocks, and more. The goal of this addon is to make Minecraft have more stuff about space, such as rockets, steel, more crafting tables, and more! Enjoy the addon!\nThis addon adds a lot of blocks.\nThey are blocks for decoration blocks, ores blocks, crafting table blocks, and some used in crafting.\nThe asteroid rock block is mostly used for decoration and building asteroids.\nOne of the ways to get the asteroid rock is to find it in the crashed meteors.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon_2.png"},{"text":"Also, there are different kinds of crashed meteors. There are three versions.\nThe Mars Rock is like stone but also for the planet Mars.\nThe dust is the block on top and the rock is the block below it.\nThe Moondust block is like the mars dust but used on the moon.\nThe Moon Rock is like stone but used on the moon.\nThe top block is the moon dust and the bottom block is the moon rock.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon_7.png"},{"text":"The rocket right now is for decoration purposes and does not work. I?m working on custom dimensions or at least close enough, so when I figure that out, The rocket will be one of the most important items in the addon. For now, you can sit in the rocket, and it will only be placed on the launchpad blocks. To get out of the rocket, shift.\nHe is what the rocket looks like!\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_2.png"},{"text":"As you can see in the picture above, the rocket is on something. That something is the launchpad! The launchpad is used for the rocket to be placed on and launched from. You don?t have to build the launch pad, there is an item in the spawn egg section that automatically spawns the launchpad.\nHere is what it looks like!\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_3.png"},{"text":"Yes, you heard it right, custom crafting tables! This addon adds two new crafting tables. These crafting tables can only craft special stuff, not normal stuff like a diamond sword. The two new crafting tables are the Advanced anvil and the NASA crafting table.\nThe NASA crafting table is used to craft rocket parts or rockets. The NASA crafting table can only be crafted in the Advanced Anvil.\nHere is what the NASA crafting table looks like!\n","url":"https://my.mcpedl.com/storage/addons/4553/images/3ec5dfd8513b4ea79c6a1363f22b8f3e.png"},{"text":"Here is how you craft the NASA crafting table. Remember that it can only be crafted in the Advanced Anvil.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/6d385f7e20f49b1f1c8e7a163094b953.png"},{"text":"The Advanced Anvil is used to craft steel, steel plates, and more. The Advanced Anvil can be crafted in the crafting table.\nHere is what the Advanced Anvil looks like.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_4.png"},{"text":"Here is how to craft the Advanced Anvil.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_5.png"},{"text":"The Hammer is used for crafting purposes. Right now the only thing you can craft with the hammer is the Advanced Anvil which is very important in this addon.\nHere is what the Hammer and hammer crafting looks like.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_6.png"},{"text":"The molten iron is the start of the addon. Molten iron is used for crafting purposes. It can be crafted by putting an iron ingot into a furnace.\nHere is what the crafting looks like.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_7.png"},{"text":"Molten Steel is what the Molten Iron is used for. Molten steel is also used only for crafting purposes. It can make the steel ingot.\nHere is how you make Molten Steel.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_8.png"},{"text":"Steel is the most important item in the addon for now. It is the item that can craft most things such as the NASA crafting table, or the rocket.\nThe steel ingot is used to make the steel plate. The Steel ingot can only be crafted on the Advanced crafting table. You use the molten steel to make the steel ingot in the Advanced Anvil.\nHere is how to make the steel!\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_9.png"},{"text":"The Steel Plate is used to make most of the stuff in the addon, including the NASA crafting table, rocket parts, and more. The Steel plate can be made in the Advanced anvil using a steel ingot.\nHere is how to make it.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_10.png"},{"text":"There are a total of three rocket parts for the basic rocket. The engine, rocket top, and fuel tank. All of them have to be crafted in the NASA crafting table. The list of rocket parts and how to craft the are below.\nThe rocket engine is one of the items used to create the basic rocket. The rocket engine is crafted by using steel plates, blaze powder, and Redstone\nHere is how you craft it.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_11.png"},{"text":"The rocket top, as the name says, is the top of the rocket. It can be crafted by only steel plates. The rocket top is used only for crafting purposes\nHere is how you make it.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_12.png"},{"text":"The rocket fuel tank is the final piece used to craft the basic rocket. It can be crafted by steel plates. The rocket fuel tank is a block that you can place.\nHere is how to craft it.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_13.png"},{"text":"You can craft the basic rocket using the rocket 3 rocket pieces. The rocket can only be crafted in the NASA crafting table.\nHere is how to craft the rocket.\n","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_14.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/4553/images/space-craft-addon-updated_15.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/space-craft-addon-updated_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/4553/SpaceCraftV0.3.zip"},{"href":"https://dl.mcpedl.com/addons/4553/SpaceCraftV0.2OLD-VERSION.zip"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fraboninco.com%2F2C0Ey\u0026post_id\u003d153860"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fraboninco.com%2F2C0BU\u0026post_id\u003d153860"}],"uploadedBy":"Minicookie1811","uploadedAt":"7 Aug, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/space-craft-addon/"},{"title":"Minecraft Dungeons Artifacts Addon 1.0.3","briefDescription":"If you?ve played Minecraft Dungeons, then you know that there are a lot of artifacts you can find that will help you in various ...","Description":"","crawledImageUrls":[{"text":"If you?ve played Minecraft Dungeons, then you know that there are a lot of artifacts you can find that will help you in various different ways, all possessing different abilities. But did you ever think some of these artifacts would make good additions for regular Minecraft? This addon will try to do that!\nCurrently, this addon adds 16 artifacts from Minecraft Dungeons, most of them are functional. None of the artifacts are craftable or obtainable yet, and are only obtainable with commands. To get all of them, type /function artifacts into chat. Now, let?s take a closer look at these artifacts! Remember, this is still a work in progress and more artifacts will be coming soon! Remember to enable experimental gameplay!\nThe first one this addon introduces is the Ice Wand! This is an artifact that will be added in the upcoming Creeping Winter DLC. It will rapid fire powerful ice blocks at enemies, dealing 7 damage, may inflict slowness and doesn?t use any ammo!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon_2.png"},{"text":"Next artifact is the Lightning Rod. Said to be forged by Geomancers and enchanted with the power of a storming sky, it will rapid fire quick lightning bolts at enemies. Deals 5 damage and sets anything it hits on fire.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon_3.png"},{"text":"Now, let?s take a look at the Corrupted Beacon. It?s a super effective weapon, that, while not dealing too much damage, is enough to stun enemies and push them back! This weapon rapid fires beams, these beams only do one damage, but unlike the Lightning Rod and Ice Wand they inflict a lot of knockback! So, if you need crowd control, the Corrupted Beacon?s got you covered!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-102_2.png"},{"text":"The third artifact to look at is the Deathcap Mushroom. A favourite of the Minecraft Dungeons players, eating this item will give you temporary speed boosts. Eat it to receive haste, speed and jump boost for 15 seconds!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon_4.png"},{"text":"Up next is none other then the Light Feather! It?s not known what creature this feather comes from, but what we do know is that it makes you much softer and swifter then using it! As a result, ?eat? this item to receive levitation for 10 seconds, and then slow falling and weakness for 30 seconds!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-102_3.png"},{"text":"Coming up is the Shock Powder. This is a handy item that will make for a great escape out of tight situations! ?Eating? this item is faster then eating other items, similar to Dried Kelp, and will provide weakness, speed and mining fatigue effects for 10 seconds. Again, this item is better for getting away from threats rather then fighting them.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon_5.png"},{"text":"The next artifact you may find handy is the Soul Healer! It?s an item that instantly restores some health when used, but it requires souls. I didn?t see how to implement that in Minecraft, so instead ?eating? the Soul Healer will replenish some of your health.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-102_4.png"},{"text":"And now, for the two new totems! The Totem of Regeneration and the Totem of Shielding will grant buffs while being held! Totem of Regeneration provides regeneration while held, while the shielding one provides resistance while held.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon_6.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon_7.png"},{"text":"Our next one is the Iron Hide Amulet! It?s an item that makes you much tougher when using it, and it?s effects last for quite a long time! ?Eating? it will give you strength, mining fatigue and hunger for a whole minute.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-101_2.png"},{"text":"This artifact is the Tasty Bone. In Minecraft Dungeons, this item will summon a wolf that fights for you. However, since there?s already a tameable wolf that will fight for you in basegame minecraft, I instead just made it so that you can eat it to get a lot of saturation and hunger back. I mean, it?s not called tasty for nothing!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-101_3.png"},{"text":"Up next is the Wind Horn! This artifact is very useful as it can slow down enemies and send them flying! It deals no damage, but does quite a lot of knockback and has a good chance to slow down it?s target, so it still has some good functionality!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-103_2.png"},{"text":"This item is known as the Wonderful Wheat! It?s an item that can be placed down to summon a friendly llama. This llama will attack nearby enemies with projectiles, you can also ride it but you can?t tame or control it. This item can be found in the creative inventory, next to all the other spawn eggs.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-102_5.png"},{"text":"Another summoning artifact is known as the Corrupted Seeds! They work similar to the Wonderful Wheat, place it down to summon a small grapple vine. The grapple vine will attack nearby enemies with a melee attack and has a small chance to poison them. Again, find this item in the creative inventory among spawn eggs!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-102_6.png"},{"text":"Now here is the Golem Kit! It?s another summoning artifact, and is the most powerful one! Place it down to summon a friendly iron golem that attacks nearby enemies and deals a lot of damage and has a fair bit of health. Just like the other two summon items, you can find this in the creative inventory.\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-103_3.png"},{"text":"There is also one more item avaliable in this addon: the Totem of Soul Protection. Currently it isn?t functional, and won?t do anything for now. Expect to see uses for it in the near future!\n","url":"https://my.mcpedl.com/storage/addons/4802/images/minecraft-dungeons-artifacts-addon-102_7.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/minecraft-dungeons-artifacts-addon-103_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/4802/Minecraft-Dungeons-Artifacts-1.0.3.mcaddon"}],"uploadedBy":"Wither Lord","uploadedAt":"22 Aug, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/minecraft-dungeons-artifacts-addon/"},{"title":"Piglin Unique Helmets","briefDescription":"This addon makes piglins have a unique model and texture of helmet to fit their heads. This feature was in Java edition but removed due ...","Description":"","crawledImageUrls":[{"text":"This addon makes piglins have a unique model and texture of helmet to fit their heads. This feature was in Java edition but removed due to the glitch of the turtle shell.\nIt is weird that piglins use the same helmet model as players that makes their head like a box so this addon adds a feature that changes the model and texture of the helmet when worn by piglin to fit their wide heads.\nThis feature was only added in Java Edition so this addon adds this feature in Bedrock Edition.\n","url":"https://my.mcpedl.com/storage/addons/5236/images/piglin-unique-helmets_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/piggo-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5236/Piglin-Unique-Helmets.mcpack"},{"href":"https://dl.mcpedl.com/addons/5236/Piglin-Unique-Helmets.zip"}],"uploadedBy":"Rex350","uploadedAt":"19 Sep, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/piglin-unique-helmets/"},{"title":"WITHER DRAGON","briefDescription":"WITHER DRAGON it\u0027s a ender dragon but it turns into wither then we called it wither dragon another Strong boss his not like normal wither ...","Description":"","crawledImageUrls":[{"text":"WITHER DRAGON it?s a ender dragon but it turns into wither then we called it wither dragon another Strong boss his not like normal wither boss his stronger than wither you can beat him if you are strong enough!\n","url":"https://my.mcpedl.com/storage/addons/5238/images/wither-dragon_2.png"},{"text":"Wither dragon it has 800 health and his wither skulls damage is 10 it?s just like wither but his stronger than wither\n","url":"https://my.mcpedl.com/storage/addons/5238/images/wither-dragon_3.png"},{"text":"And it has a special attack dragon heads wave like evoker and it?s hard to hit him because it have a knock back because of Thunders\n","url":"https://my.mcpedl.com/storage/addons/5238/images/wither-dragon_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/wither-dragon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5238/WITHERDRAGON.mcaddon"}],"uploadedBy":"???","uploadedAt":"19 Sep, 2020","supporteds":["1.14","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/wither-dragon-addon/"}]