[{"title":"Potions Plus","briefDescription":"Bored of the same old potions in vanilla Minecraft? This pack adds 5 brand new potions with unique brewing recipes and effects! All the recipes are ...","Description":"","crawledImageUrls":[{"text":"Bored of the same old potions in vanilla Minecraft? This pack adds 5 brand new potions with unique brewing recipes and effects! All the recipes are obtainable in survival, and this pack can be easily integrated into your playthrough!\nThis pack adds 5 new potions into the game: Levitation, Resistance, Absorption, Haste and Discounting. Each potion is brew able by combining one ingredient with awkward potions. The recopies are listed below\nHaste: Lapis Lazuli\n","url":"https://my.mcpedl.com/storage/addons/6710/images/potions-plus_2.png"},{"text":"Discounting: Emerald Block\n","url":"https://my.mcpedl.com/storage/addons/6710/images/potions-plus_3.png"},{"text":"Resistance: Diamond\n","url":"https://my.mcpedl.com/storage/addons/6710/images/potions-plus_4.png"},{"text":"Levitation: Shulker Shell\n","url":"https://my.mcpedl.com/storage/addons/6710/images/potions-plus_5.png"},{"text":"Absorption: Gold Block\n","url":"https://my.mcpedl.com/storage/addons/6710/images/potions-plus_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/potions-plus_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6710/Potions-Plus.mcaddon"}],"uploadedBy":"CMD Studios","uploadedAt":"16 Dec, 2020 (Updated)","supporteds":["1.16.200"],"originUrl":"https://mcpedl.com/potions-plus-addon-1/"},{"title":"Turkey Boss","briefDescription":"Hunt Turkey, gather resources, survive, and finally fight the Turkey Boss!! Basically in this mod, you are a pilgrim and you must get your prey, ...","Description":"","crawledImageUrls":[{"text":"Hunt Turkey, gather resources, survive, and finally fight the Turkey Boss!! Basically in this mod, you are a pilgrim and you must get your prey, Turkey. This Mod adds 3 new turkeys, 3 new food, 3 new weapons, and 2 new items. Use these resources to your advantage and win the war.\nMake sure to check out community links and terms below!\nHave you ever wanted more of a challenge in Minecraft? Well if so you?re in luck, this mod adds a completely new concept to your game. This Mod adds 3 new turkeys, 3 new food, 3 new weapons, and 2 new items that can be crafted or will spawn naturally. I will go over everything in detail below.\nWatch this video for a mod tutorial and a boss fight! Don?t forget to sub!\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_37.png"},{"text":"There are 3 different turkeys and those are Peaceful Turkeys, Hostile Turkeys, and the Turkey Boss. I will explain each turkey in detail personally below.\nThese turkeys will spawn naturally in 3 different places, you can tame these turkeys, but they will automatically try to avoid you.\nYou can find these turkeys in forests, plains, and swamps. You can tame these turkeys with seeds and then they will follow you. They can also be named. These turkeys will try to avoid players and wolves. These turkeys are also immune to fall damage.\nThis Turkey will not spawn naturally, but the Turkey Boss will summon them. These turkeys are very cruel, as they attack almost everything.\nThese Turkey will attack as a team doing tons of damage quickly! When summoned by the boss they will protect the boss with their life. They are also immune to fall damage. In an army, these turkeys are almost unstoppable. Can anybody beat this Boss?!?\nThis Boss won?t spawn naturally but you can craft a spawn egg! This is probably the strongest boss. It can beat the ender dragon and the wither. Can anybody beat this Boss?!?\nThis Boss normally doesn?t attack himself, he normally just spawn Hostile Turkey, but if you get to close it will attack you himself. He can do tons of damage quickly. Sometimes he might attack you with his minions if he does that he can almost kill the player.\nThere are 3 different food and they are all obtainable. The 3 foods are Raw Turkey, Turkey Dinner, and Turkey Power. I will explain each food in detail below.\nRaw turkey can be obtained by killing any turkey, as each turkey drops this. It is not a good food to eat as the effects it gives you are very negative.\nTurkey Dinner is obtainable by smelting Raw Turkey. It?s really good food for trying to heal quickly and say full for a while.\nTurkey Power is really good. With it, you can stand up to the boss. The Crafting is expensive though. It is obtainable by crafting it.\nThis Mod adds 2 obtainable items and those are Turkey Beaks and Turkey Feathers. I will go over each item in detail below.\nThese feathers are obtainable and are a very important item for crafting things that this mod adds. You can gain these feathers by killing any type of turkey but you may get a beak.\nThese Beaks are also obtainable and it is also a very important material. You can gain Turkey Beaks by killing any turkey but is a very rare drop.\nUses\nThis Mod adds 1 melee weapon and 2 ranged weapons and those are the spear, medieval bow, and the boss summon egg.\nThe spear is the strongest melee weapon you can get, doing 9 damage! You can craft this weapon and you can see how below.\nCrafting\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_22.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_23.png"},{"text":"This bow is a lot stronger than a regular bow but doesn?t have too much range. Having a quick cool down you can do good damage quickly. You can craft this weapon and see how below.\nCrafting\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_24.png"},{"text":"With this weapon, you can summon the boss. This can be used as a troll to trick your friend. But its main use is to summon the boss so you can fight the boss. This item can be crafted and see how below.\nCrafting\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_25.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_26.png"},{"text":"Raw Turkey cooking on a campfire\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_27.png"},{"text":"Raw Turkey Smelting in Furnace\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_28.png"},{"text":"After eating Turkey Power\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_29.png"},{"text":"Turkey Power effects\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_30.png"},{"text":"Peaceful turkey in the wild\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_31.png"},{"text":"Hostile Turkey attacking Peaceful Turkey\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_32.png"},{"text":"Turkey Boss rampaging\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_33.png"},{"text":"All Weapons\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_34.png"},{"text":"All Items\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_35.png"},{"text":"All spawn eggs\n","url":"https://my.mcpedl.com/storage/addons/6336/images/turkey-boss_36.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/turkey-boss_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6336/Turkey_Boss_Mod_Published_21.mcaddon"},{"href":"https://www.mediafire.com/download/rp15e53stcyw6lz"}],"uploadedBy":"Primary Gamers (CC)","uploadedAt":"23 Nov, 2020 (Updated)","supporteds":["1.16.200"],"originUrl":"https://mcpedl.com/turkey-boss-addon/"},{"title":"Cyberpunk 2077 Addon","briefDescription":"The most anticipated game of the year is finally here! With this opportunity, I am releasing the Cyberpunk 2077 Addon for Minecraft Bedrock. Cyberpunk 2077 from the ...","Description":"Key features\nKey features\n","crawledImageUrls":[{"text":"The most anticipated game of the year is finally here! With this opportunity, I am releasing the Cyberpunk 2077 Addon for Minecraft Bedrock. Cyberpunk 2077 from the creators of successful Witcher Game Series ? CD Project Red. This add-on implements Cyberpunk 2077 into Minecraft! Drive a car, van, shoot with weapons or talk with Johnny Silverhand, V Male/V Female, Jackie Welles or Judy Alvarez.\nCreator: Nogard (Twitter, YouTube, Reddit, Facebook)\nThe Quadra V-Tech is probably the most iconic and best known car when it comes to the Cyberpunk 2077. When creating this car, I created it with amazing attention to detail. The number of parts in this model eventually stopped at astronomical 816 cubes. In total, I spent over 46 hours creating the model and the texture for this car.\nGame context: V-Tech is an improved version of Quadra Turbo R introduced 8 years after it. Featuring an improved exhaust system and suspension, it quickly earned the status of cult muscle car.\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_4.png"},{"text":"Another vehicle in this addon is the Van. It is intended to represent a Cyberpunk vehicle called the VILLEFORT COLUMBUS V340-F FREIGHT. However, the model of this van will probably be replaced in the future by a completely accurate model.\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_5.png"},{"text":"The addon currently contains 5 entities. All of these NPCs have an accurate skin to the original characters. Some of the skins were created by MatFy with my requests and minor adjustments (Johnny Silverhand, V Male, V Female and Jackie Welles). I personally created the skin for Judy Alvarez. When the entity is spawned, it will write you a message. Otherwise, it will run around your world in an uncoordinated way. However, deeper functionality is still missing. Please note that I am in a time rush. The individual entities are shown in the figures below.\nGame context: This is a character played by the famous fan-loved Keanu Reeves. In the game he is an ex-US military veteran and the lead singer of the band Samurai before the breakup in 2008. He will welcome you with a message: ?Wake the f*** up, Samurai! We have a city to burn.?\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_6.png"},{"text":"Game Context: V, alias for Vincent/Valerie (by gender), is the player-controlled protagonist of the Cyberpunk 2077 video game, that?s why I implemented V Male and V Female.\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_8.png"},{"text":"Game context: He is one of the first V?s contact points as well as the player?s company during several missions. He speaks Spanish and doesn?t like Scavengers. This character will later buy the Quadra V-Tech.\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_9.png"},{"text":"All of these skins are also available for download as a Cyberpunk 2077 Skin Pack (Check Downloads section).\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_10.png"},{"text":"At the moment, Addon contains only 2 melee weapons, namely ARASAKA THERMAL KATANA and ELECTRIC BATON BETA. ARASAKA THERMAL KATANA in Minecraft replaces Netherite Sword and ELECTRIC BATON BETA replaces Stone Sword. There is going to be more in the future, I promise. My goal is to implement them as custom 3D items.\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_11.png"},{"text":"The addon also contains 2 ranged weapons. Specifically, a shotgun called BUDGET ARMS CARNAGE and a M-10AF LEXINGTON pistol. The pistol replaces the bow and the shotgun replaces the crossbow. Again, I have to note that they will be implemented as custom items with 3D models in the future.\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_12.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_13.png"},{"text":"There is always a huge amount of work at the end of the year, so I haven?t been able to devote as much time to this addon as I would like to. Nevertheless, I managed to implement many essential functionalities from Cyberpunk 2077 into this Addon. What I did not have time to implement, I will correct in the future. I will try to turn all the key things from the real game into this MC ?mod?. All the vehicles, custom 3D weapons, more characters and deeper functionality for them are coming! I have already started working on a model for the Porsche 911 Turbo.\nIf you are interested in this complex project, I highly recommend that you follow me on Twitter, YouTube, Reddit, MCPEDL or Facebook, because this is where I will share the latest news. Stay tuned for more!\n","url":"https://my.mcpedl.com/storage/addons/6687/images/cyberpunk-2077-addon_14.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/cyberpunk-2077-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6687/Cyberpunk-2077-Addon_1607877149.mcaddon"},{"href":"https://dl.mcpedl.com/addons/6687/Cyberpunk-2077-Addon_1607877149.zip"},{"href":"https://dl.mcpedl.com/addons/6687/Cyberpunk-2077-Skin-Pack_1607877150.mcpack"}],"uploadedBy":"Nogard","uploadedAt":"14 Dec, 2020 (Updated)","supporteds":["1.14","1.15 (beta)","1.16","1.16.100","1.16.101","1.16.200","1.16.210 (beta)","RTX Beta"],"originUrl":"https://mcpedl.com/cyberpunk-2077-addon/"},{"title":"Skins 4D and Objects 4D Addon (1.16.100+)","briefDescription":"This Addon Implements the possibility of putting 4D skins and 4D objects placed in the addon with the use of simple commands. My purpose is ...","Description":"","crawledImageUrls":[{"text":"This Addon Implements the possibility of putting 4D skins and 4D objects placed in the addon with the use of simple commands. My purpose is to constantly update it so that it has more things. (Translated from Spanish to English by Google Translator).\nThis addon adds for the moment only 3 things but the plan is that it is implementing more over time.\nThe first thing he adds is a military suit.\n","url":"https://my.mcpedl.com/storage/addons/1572/images/skins-4d-and-objects-4d-addon-1143_2.png"},{"text":"To put it on, you only look for it in the helmet section\n","url":"https://my.mcpedl.com/storage/addons/1572/images/skins-4d-and-objects-4d-addon-1143_3.png"},{"text":"Super Goku my best friend was the creator of this, I never adapted the DJ console for the addon.\nTo put it on, you only look for it in the helmet section\n","url":"https://my.mcpedl.com/storage/addons/1572/images/skins-4d-and-objects-4d-addon-1143_4.png"},{"text":"This as the name implies is a test to prove that it worked\nTo put it on, you only look for it in the helmet section and use invisibility\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_2.png"},{"text":"To put it on, you only look for it in the helmet section also apply invisibility\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_3.png"},{"text":"This is mine, really cool isn?t it?\nTo put it on, you only look for it in the helmet section also apply invisibility\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_4.png"},{"text":"To put it on, you only look for it in the helmet section\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_5.png"},{"text":"To put it on, you only look for it in the helmet section\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_6.png"},{"text":"Really good By yaelgamer366\nTo put it on, you only look for it in the helmet section\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_7.png"},{"text":"This is defective but will be fixed in future versions.\nTo put it on, you only look for it in the helmet section\n","url":"https://my.mcpedl.com/storage/addons/1572/images/update-281019-skins-4d-and-objects-4d-addon-1143_8.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/skins-4d-and-objects-4d-addon-1143_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/1572/ObjectsAndSkins4D.mcaddon"},{"href":"https://www.mediafire.com/file/vcirgg20m9udbnm/ObjectsAndSkins4D.mcaddon/file"}],"uploadedBy":"D Flog Flag","uploadedAt":"28 Oct, 2019 (Updated)","supporteds":["1.16.100","1.16.101","1.16.200","1.16.210 (beta)"],"originUrl":"https://mcpedl.com/4d-skins-4d-objects-addon/"},{"title":"In Silence Addon (Horror)","briefDescription":"This is a small Addon that adds Rake and Rat from the game \"In Silence\" to the world. Will fill your world with danger and ...","Description":"","crawledImageUrls":[{"text":"This is a small Addon that adds Rake and Rat from the game ?In Silence? to the world. Will fill your world with danger and a horror element, be a victim or a hunter, you decide.\n!!Welcome to the In Silence addon!!\n","url":"https://my.mcpedl.com/storage/addons/6638/images/in-silence-addon_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6638/images/in-silence-addon_6.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6638/images/in-silence-addon_2.png"},{"text":"The rat is a hostile mob to the player it will try to bite you so be careful. It will spawn all over the upper world.\n","url":"https://my.mcpedl.com/storage/addons/6638/images/in-silence-addon_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6638/images/in-silence-addon_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6638/images/in-silence-addon_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/in-silence-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6638/In_Silence_R.mcaddon"}],"uploadedBy":"MrVolt","uploadedAt":"14 Dec, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/in-silence-addon-horror/"},{"title":"Hallowed Hallow V4.1.1 (Huge Bug Fix Update)","briefDescription":"Its that time of the year where things begin to get spooky! In this simple addon I added a new biome, a few new mobs, ...","Description":"","crawledImageUrls":[{"text":"Its that time of the year where things begin to get spooky! In this simple addon I added a new biome, a few new mobs, new foods, a new weapon, new ore, and new building blocks!\nIf this mod gets very popular I will defintely update this with many more features! Just give me some reccomendations ?\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_2.png"},{"text":"The Hallowed Hallow! Home to spooky mobs!\nThe Hallowed Hallow. Originally this biome was a peaceful Forest biome thriving and full of life! But then one day it changed. Ghosts started to roam the nights and animals got struck with a mysterious disease. Villagers speculate that the Wither was responsible for the transformation of a once peaceful land. Many different theories are being created. Many speculations?Can this biome be returned to a peaceful state like it was long ago? Or will it forever be an area of mystery and death? What was the cause of change? Who is responsible? Will we ever find out?\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_3.png"},{"text":"The first mob is the Ghost.\nDeceased humans from the past with unknown cause of death. They are here to haunt you. They think that you are the person who killed them! When someone dies, their soul gets sucked into the Hallowed Hallow. This biome is a hotspot for many paranormal activities. The Hallowed Hallow is full of many lost and forgotten souls too, they are now roaming this land in search of who killed them seeking revenge?\nStats:\nLet me know if the 30 second wither is annoying I will gladly change it. But then again the Hallowed Hallow is suppose to be a challenging biome.\nDrops:\nI would still like an idea of what the Ghost should drop other than the soul.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_4.png"},{"text":"The second mob, the Hallowed Slime.\nTrapped souls of the victims who were brave enough to venture into the Hallowed Hallow. How they died is unknown. Rumors say that it may have just been the Ghosts killing them thinking thats who killed them in the past. Other say its something else?A much bigger force that may come back to destroy the Overworld in the future?What could it be?\nStats:\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v2-halloween-addon_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_5.png"},{"text":"Third mob is the Hallowed Pig.\nPigs that feel no pain when injured or killed. They have no feelings. They have no emotions and have no care about anything. These pigs were the fauna that thrived in this beautiful land once. That all changed. A disease broke out and infected them changing them into these creatures. They may be peaceful and not attack however some say at night, these pigs stalk nearby villager farms. They keep their eye on the bright pink pigs. Its as if they want to lure and trap that pig in the Hallowed Hallow and make them suffer with them for all eternity?\nStats:\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_6.png"},{"text":"The 4th mob is called the Trick Or Treator.\nA person who was trapped in the Hallowed Hallow. They are immune to the creepy mobs in Hallowed Hallow. In fact they prefer to live here. Why? They don?t answer. Some say that if they tell you why or how they got trapped in Hallowed Hallow that you may be trapped too. Yikes! I guess dont ask! Many trade with fellow wanderers. Just don?t ask them anything personal, just trade. I wonder if they know something?like why do they look like zombies??\nStats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_7.png"},{"text":"Trick Or Treators trade a variety of goods such as diamonds, hallowed ingots, candy!!, and more!\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_17.png"},{"text":"This scary 3 headed creature is known as the Hallowed Monstrosity. It is the 5th mob in Hallowed Hallow added in V2. This mob is a miniboss and has a rare chance to spawn at night in the Hallowed Hallow.\nCreature of unknown origin. How this came about is a question everyone asks. This beast is so strong it can wipe out anything. The Hallowed Monstrosity calls the Hallowed Hallow its home. Just be careful when out and about at night. When night arrives, so does this creature. Its out hunting for food, and you are considered food so it will attack relentlessly until you are no more. When day strikes, they do not go away. They will hide in the shadows of Hallowed Trees stalking you?\nWatch. Your. Back?\nYou may not see the next day?\nStats:\nDrops:\nHallowed Flesh can be cooked for leather or eaten for very bad effects!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_18.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_2.png"},{"text":"This innocent looking girl is known as the Lost Girl. She is the 6th mob added in V3 of Hallowed Hallow.\nA girl that is trapped in the Hallowed Hallow. How she got here? She was kidnapped from her house one day at night. Her parents were murdered. She did not know however because she was sound asleep during all this. When she awoke, she was greeted with Ghosts and other apparitions around her. This girl still does not know who kidnapped her, and neither do we.\nAll we know is that she may not seem what she is?\nSomething is off about her?\nStats:\nTo tame the Lost Girl, you must get any type of candy (Blueberry Sour bombs, candy apples, etc)\nShe will fight with you, after she is tamed, she cannot be commanded, she cannot be healed. She prefers to follow you for the rest of her life. She cant be healed because?\nS- is n- livin-\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_2.png"},{"text":"This strange looking man is the Serial Killer he was added in V4 as the 8th mob.\nInnocent man once, when the Hallow virus came into the overworld, it changed the way his brain works. He now roams the night in search of villagers or players and murder them? Watch out at night!\nStats:\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_3.png"},{"text":"This is the Bloodied Maniac. He did not get his name for his murders, instead he got it because of the Hallow virus. It must?ve changed his skin tone! Added in V4 as the 9th mob.\nA once normal human that loved mining. One day as he was mining he came across a strange ore he?s never seen before, no it wasnt Hallowed ore. It was something else. He quickly began mining it thinking he found rubies, he planned to sell them at a local village. However, when he mined it, a mysterious gas released from it sickening him. He began feeling weak and angry suddenly. He then passed out. When he awoke he felt a sudden urge to kill anyone he sees. He couldnt control himself, his brain has been corrupted. He now roams the night with other killers in search of someone to make their next victim?\nStats:\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_4.png"},{"text":"This mob is called Living Stone. Added as the 10th mob in V4.\nSouls of deceased miners. When the miner died, their soul was sucked in towards some sort of special stone. The stone then comes to life because of the soul. Its as if the miners get a second chance at life. Some say its a blessing others say its a curse?What do you think? These miners roam the caverns, you may think its anywhere, but your wrong its only in the Hallowed Hallow caves.\nStats:\nDrops:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_3.png"},{"text":"This menacing looking monster is the King of The Hallow. He is the 7th mob in Hallowed Hallow added in V3. This is the boss of the Hallowed Hallow.\nA being of extreme power capable of destroying planets and galaxies. He comes to destroy the Overworld next! He must be stopped at once or else?\nHow did the Hallow King become evil?\nIt all started one day on this planet, Minecraft. He was a very kind man and gentle towards others. He lives in a village and always helps as much as he can. One day the Mayor of the village says that theres trouble in the mines. Supposedly creepers roamed inside. (The Hallow King which was not called that, his name was Jack). Jack agreed to search the mines for the creepers and kill them. What he did not know was that the Mayor was planning Jack?s demise? The moment Jack stepped foot into the mines, he activated a pressure plate that blended in with the surrounding stone. Once it activated, the doors to the mines behind him shut and locked. He was trapped. Panicking he began shouting for help and banged on the doors. No one assisted him?\nThen creepers appear out of no where! Jack had no choice but to fight them off.\nHe fought and fought his hardest to kill them off. He successfully killed them off, but he was injured badly. As Jack was trying to whip out a torch for light. He stumbled upon a hidden lever on a wall. He flicked it on, and a stone wall moved and revealed a secret door. He opened the door and found a portal. It was deactivated. He searched around the room and found a book showing how to activate it. He decided to activate the portal. When he did a bright orange glow appeared in between. It was a portal to another dimension! Jack did not want to go in at first, but then he remebered he was trapped. So he went in?\nWhen he arrived, he was in an evil menacing place. Everything around him was dead. Trees showed no life and had no leaves, he saw ghosts everywhere. It was a madhouse he thought! He tried going back, but something grabbed his arm. Jack turned around saw a Ghostly figure dressed as a pumpkin. The figure said you are chosen?\nJack was confused. He had no idea what was going on. Chosen? He thought? The figure then says that they?ve been waiting for him for over 100 years?\nJack thought of it all, suddenly it all made sense to him for some reason. As he finished his thoughts, thinking hard. The figure was gone. He looked around and then at himself. He was the figure?\nPower suddenly surged throughout his body he felt strong and felt like he can do anything.\nRight away Jack thought what he should do first with his newfound power?\nTo destroy the village he once lived in. And thats exactly what he did? Once he went back into the overworld, madness started. Hallowed Hallows begin forming, he shot into the air a beam from his sword. It released a strange disease that infected many creatures. When he returned to the village, he unleashed his wrath. He murdered each and every villager right in front of the Mayor saving him for last?\nAfter Jack completed his revenge, he went back into that dimension that he now decides to call his home?\nJack, who is now known as The King of The Hallow resides in his dimension. In order to fight him, you must craft his totem to summon him.\nStats:\nDrops:\nAll new weapons will be in New Ore and Weapons section\nFighting Tips:\nOkay thats enough tips have fun again!\nTo Summon this boss, you need to gather souls from the following mobs (To gather, you must kill that specific mob)\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_4.png"},{"text":"Once you?ve done that, grab 4 Hallowed Ingots. Then follow this recipe below\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_5.png"},{"text":"Once you crafted his totem, you tap/click ground to summon him. Have fun fighting! Try not to die right away, he shouldn?t Despawn if you do die. Just make sure your spawn is close in case he does.\nHallow King is not all destructive, you can fight him anywhere. Your pets/tames will help you fight too.\nMore info below!\nIn your adventure in the Hallowed Hallow you may get a variety of tasty useful candies!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_8.png"},{"text":"Every candy lasts 2 minutes!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_9.png"},{"text":"The first candy is the Mint Emerald. Not craftable. When eaten you will get Jump Boost 2 for 2 minutes.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_10.png"},{"text":"The second candy is Pumpkin Candy. This is probably the most useful one in my opinion. When eaten you will get haste 3 for 2 minutes! Have fun mining! This candy also now has a recipe!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_19.png"},{"text":"The third candy is called the Cherry Strips. When eaten you will get strength 2 for 2 minutes. There is no recipe for this.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_11.png"},{"text":"The 4th candy added in V2 is called the Candy Apple. When eaten you will get spped 2 for 2 minutes. This candy also has a recipe.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_20.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_21.png"},{"text":"The 5th and final candy added for now in V2 is called the Blueberry Sour Bomb. When eaten you will get speed 4 for 15 seconds and waterbreathing 1 for 60 seconds. This candy cannot be crafted, it drops off the Hallowed Monstrosity.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v2-halloween-addon_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_6.png"},{"text":"This next food is not a candy, but instead is a tasty treat that is very helpful in combat. This is the pumpkin cupcake. When eaten, you get 4 points of hunger, and speed, resistance, and health boost 2 all for 1 minute. This was added in V3.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_7.png"},{"text":"All candies restore half a hunger point!\nEvery weapon can now be enchanted!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_12.png"},{"text":"This is the Hallowed Blade.\nForged from the depths on the Hallowed Hallow. Whoever wields this sword is said to be guarded by fallen adventurous spirits. They are said to guard you because you completed their adventure and they want to honor you. You are granted passive regeneration when wielding this sword. However ghosts and hallowed slimes are not fooled. They believe it is your fault for the way they are and will continue to haunt you forever.\nStats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_13.png"},{"text":"In V2 I added a new weapon called the Pumpkin Carver.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_22.png"},{"text":"Carve the brains of your nightmares out!\nStats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_23.png"},{"text":"The item in the middle grid is called the Pumpkin Carver. This item (shown farther below) allows you to carve new pumpkins or convert into a weapon.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_6.png"},{"text":"This is the Knife.\nMore than just a cooking utensil\nStats:\nThis weapon is the Hallowed Wood Sword.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_8.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_9.png"},{"text":"Crafted from Hallowed Trees. Better than the normal wood sword!\nStats:\nThe Ghost Grenade\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_10.png"},{"text":"Souls encased in glass, the Hallowed scrap changed their behaviors. These Ghosts are now friendly!\nStats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_11.png"},{"text":"The grenade will do some damage to land, so avoid using it indoors!\nNext we have the Molitov Pumptail ( Creative name right? No? Ok ? )\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_12.png"},{"text":"One of Jack?s creations, a rather interesting one too yeah? Apparently when thrown this grenade will deal some damage to land, but leave fire around it.\nHow was this made exactly?\nStats:\nThis sword is called the King?s Revenge.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_13.png"},{"text":"A sword full of evil, crafted from long ago. This sword is said to grant night vision, speed, and more vitality to its owner.\nStats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_8.png"},{"text":"This is the blood sword.\nA said to be cursed sword. This sword reduces your maximum vitality by half. No one knows why. Maybe its because the spirit of hatred lies inside it, and its trying to sabotage you with all its power.\nStats:\nNext up, Pumpkin Power Gun\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_14.png"},{"text":"Oh for f? I MEAN thats sooooo cool wow! A gun. Seriously how did this get created? What kind of technology was used for this?I swear if its ?pumpkins?\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_15.png"},{"text":"I cannot comprehend HOW THIS IS FUNCTIONAL IF CANDY IS ITS BARREL!!!! HOW? WHY? W-w-what??? I am speechless?\nStats:\nDont worry I totally didnt struggle making this texture?\nHahahahahaha\nPls help me ?\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_9.png"},{"text":"This weapon is called the Bloodshot.\nCreated when iron and blood are combined together. The iron poisons the blood causing it poison all shots from this gun.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_10.png"},{"text":"The middle grid item below\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_11.png"},{"text":"Stats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_12.png"},{"text":"This weapon is more of a utility than an actual weapon. This is the tranquilizer.\nToo many threats in this world. Craft this as it may save your life someday.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v4-weapons-mobs-and-fixes_13.png"},{"text":"Stats:\nThis colorful weapon below is the Heart Of The Hallow. It is the ultimate weapon in this addon.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_16.png"},{"text":"It is not easy to obtain, heres how you get it\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_17.png"},{"text":"If you would like to punch a few walls go ahead. Have fun farming!\nThe ultimate weapon of the Hallowed Hallow, the Heart. This weapon is full of pure power. You will be unstoppable with this wielded. This was only crafted 2 times. Once a long time ago, and the second time I assume is you yes? No? Maybe? Okay I?ll be quiet.\nStats:\nThis weapon will always remain the strongest in this addon! I will still add in more, but this one will be the strongest for now.\nAll swords can now be enchanted!!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v41-116100-fix_2.png"},{"text":"New ore!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_14.png"},{"text":"The Hallowed Ore.\nPeople thought Hallowed Ore was a myth. They were wrong. No one exactly knows how or when this ore was formed. Perhaps the souls of deceased miners were trapped in diamond ores. Too many miners get greedy and want all the diamonds. Or maybe ghosts that roam the surface below kidnapped and killed miners and stuffed their souls into a stone, thus forming what we call Hallowed Ore. This ore is still a huge unsolved mystery, just waiting to unfold the truth some day?\nOre Information:\nIf you killed the Hallow King, you should have gotten Hallowed Ingot Scraps. If you dont want to use scrap for anything, you can convert them into ingots.\nIt would not let me upload an image for some reason for this, so here is a makeshift picture.\nS\u003dScrap\nX\u003dBlank\nXSS\nXSS\nXXX\nI added many new blocks in V2. Of course I look forward to adding in more!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_15.png"},{"text":"In the Hallowed Hallow you will see many very large trees. These trees are called the Hallowed Trees.\nTall, ominous, and eerie. These trees show no life what so ever. The souls of dead plants and leaves live in the trunks. These trees are said to occasionally scream. I don?t know if they scream anymore but if you ever heard their blood curdling scream, your ears will bleed forever. Some say the reason these trees scream is because of the fact that the souls of many adventurers are locked for all eternity inside. They only scream for the torment they witness inside. It must be a madhouse in there! Walking near these trees may make you feel woozy and nauseous as if the souls cling to you desperate to escape from all the torment?\nStats:\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_16.png"},{"text":"On the left are Hallowed planks and the right is on the Hallowed Logs.\nPlanks can be turned into sticks. You cannot make tools however. I plan in the future to make Hallowed Wood tools.\nIn V3 I added in Hallowed Bricks! Can?t leave my builders hangin.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_18.png"},{"text":"You can see the new bricks behind the boss. They make nice walls ?\nYou know maybe the Hallowed Hallow ain?t so bad after all. I mean ever since this Hallowed disease started taking over the Overworld slowly day by day, it seems as if it gifted us. Colored pumpkins! A never before seen thing in the Overworld.\nBut we are ultimately still cursed, yes?\nSomething might try to destr- us ver- so-\nPumpkins do NOT spawn naturally, there are 3 new colors that you can dye. Green, White, and Yellow. Each pumpkin can be carved. They can also be turned into Jack O Lanterns.\nLets start off with a useful item. The Pumpkin Carver.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_24.png"},{"text":"The pumpkin carver can either be used for carving pumpkins or be converted into a weapon. (Weapon shown above in New Ore and Weapons section)\nLet?s start with the Green Pumpkins.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_25.png"},{"text":"Just like regular minecraft pumpkins, you can carve them. However these new pumpkins are carved a special way.\n1st heres how to dye a pumpkin\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_26.png"},{"text":"Grab your dye (Lime, Bonemeal, or Yellow)\nThen put them in the crafting grid like this and there you go, you dyed a pumpkin!\nYou can use these as decorations.\nTo carve one of the new colors you basically do the same thing as above but instead its your colored pumpkin and a pumpkin carver.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_27.png"},{"text":"(I know its yellow in the picture but you know what I mean right?) You can carve normal minecraft pumpkins like this too!\nHere?s a carved green pumpkin\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_28.png"},{"text":"Like I said earlier you can turn them into Jack O Lanterns. Its super easy its just like the normal recipe but you know your choice of color.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_29.png"},{"text":"(Again I know its yellow but this recipe works the same for the rest)\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_30.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v2-halloween-addon_4.png"},{"text":"Just like a regular Jack O Lantern, they will emit light. The light level is the exact as the normal lantern. They look cool at night ?\nHere is the yellow pumpkin\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_31.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_32.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_33.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v2-halloween-addon_5.png"},{"text":"And finally, we got the White Pumpkin.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_34.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_35.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_36.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v2-halloween-addon_6.png"},{"text":"Thats all the pumpkins! Tell me which one you like the most in the comments! I love the green one!\nAlso if you wish to see a new color, say it in the comments! I only added the natural colors.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_37.png"},{"text":"I?ve added in 5 brand new craftable scary decorations! You have the pumpkins too for use!\nLets start with the 1st one, the Stone Statue\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_38.png"},{"text":"Inside lies a trapped soul of a victim that was murdered in the Hallowed Hallow. That is why this statue is turns and stares at its surroundings. It does not move around thankfully, it just stands there?Ominously.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_39.png"},{"text":"The next decoration is the bloodied statue\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_40.png"},{"text":"Nightmarish energy flows throughout the body of this statue. It is live just like the stone statue. This statue seems to constantly look around as if its on alert for something. But what?\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_41.png"},{"text":"The third decoration is the zombie heads.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_42.png"},{"text":"Heads of zombies. These heads are trying to form a horde of some sort it seems. They are somehow alive. They just cant move thankfully!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_43.png"},{"text":"(I did not use zombie heads in the recipe because I wanted you to easily be able to get this in survival mode!)\nThe 4th decoration is the Tombstone.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_44.png"},{"text":"A tombstone of a long deceased being of some sort. Their soul is trapped inside of this tombstone. They cannot escape unless the tombstone is broken open. Will you end their torment?\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_45.png"},{"text":"The 5th decoration is the Scarewcrow.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_46.png"},{"text":"A soul of a farmer villager lies inside. They may be dead, but they still do their job. It may not be farming but they?ll be sure to keep souls or other spirits from cursing your crops.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v1-halloween-addon_47.png"},{"text":"The 6th and final decoration for now is the Hallow King?s head! This is actually a trophy for your hard work!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_20.png"},{"text":"Someone?s head! Totally not creepy. Thanks to you killing Jack, you can now put his head in your house? Uh have fun I guess. Also he might occasionaly stare and look around, but uh he shouldnt attack, hopefully.\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v3-huge-update_21.png"},{"text":"This is how you craft it, it can be in any grid. This item drops off of the Hallow King boss. It is called ?Hallow King Trophy Item? You?ll see it, its a guaranteed drop.\nAll furniture can be pushed around. If you want to move it somehwhere else, ?killing? it will drop its crafting materials again to recraft it.\nSome scary furniture can spawn naturally in your world. They are very rare.\nThe list includes\nItems now spawn in creative inventory!\n","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v41-116100-fix_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5853/images/hallowed-hallow-v41-116100-fix_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/hallowed-hallow-v411-huge-bug-fix-update_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5853/Hallowed_Hallow_V4.1.1_BP.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5853/Hallowed_Hallow_V4.1.1_RP.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5853/Hallowed_Hallow_V4.1.1.zip"}],"uploadedBy":"BladedAxe77","uploadedAt":"27 Oct, 2020 (Updated)","supporteds":["1.16.101","1.16.200"],"originUrl":"https://mcpedl.com/hallowed-hallow-addon/"},{"title":"Craft Chainmail Armor","briefDescription":"I was always embarrassed that chainmail has no crafting. But my addon will fix this, as well as provide an opportunity to partially return the ...","Description":"","crawledImageUrls":[{"text":"I was always embarrassed that chainmail has no crafting. But my addon will fix this, as well as provide an opportunity to partially return the materials spent. Hope you enjoy my first addon. Let?s go!\nWith this add-on you can create ?hainmail armor from iron nuggets! But why not chains? Because crafting chains has 1 iron ingot and 2 iron nuggets, and if we use chains to craft chain mail, then chain mail should have higher characteristics than iron armor.\n","url":"https://my.mcpedl.com/storage/addons/6673/images/craft-chainmail-armor_2.png"},{"text":"I also added chainmail armor smelting to get one iron nugget, just like gold and iron armor.\n","url":"https://my.mcpedl.com/storage/addons/6673/images/craft-chainmail-armor_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/craft-chainmail-armor_1-1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6673/Craft_chainmain_armor.mcpack"}],"uploadedBy":"LowlandUnarm","uploadedAt":"13 Dec, 2020","supporteds":["1.16.200"],"originUrl":"https://mcpedl.com/craft-chainmail-armor-addon/"},{"title":"Fruity Fun Add-On","briefDescription":"The Fruity Fun Add-On aims to improve food and cooking by adding 6 fruits to Minecraft, being Cherries; Bananas; Grapes; Oranges. Pears and Peaches, each with ...","Description":"","crawledImageUrls":[{"text":"The Fruity Fun Add-On aims to improve food and cooking by adding 6 fruits to Minecraft, being Cherries; Bananas; Grapes; Oranges. Pears and Peaches, each with new recipes and fun foods to cook! Make Scones, Cakes, and a bunch of other things!\nFruits\nOranges, Peaches, Grapes, Cherries, Bananas, and Pears are all the fruits you will be collecting and cooking with in this addon.\nHow do I get fruit?\nThe new fruits can be collected by slaying the new ?Fruit Pigs.? Though, it isn?t a great idea to kill them as soon as you find them. I recommend farming them in a pen. How do you farm them? Well you can?t use carrots. You must use apples! Yes! The only fruit in Vanilla is what Fruit Pigs like!\nWhat can I make with the new fruits?\nBaking? What?\nYes! Before you can make either Banana Bread, Cherry Cake, Scones, or Peach Cobbler, you must craft the dough and bake it in a furnace. Trust me, though. These foods are worth the trouble!\nI don?t use the crafting book. How do I craft these?\nHere is the guide:\n","url":"https://my.mcpedl.com/storage/addons/6613/images/fruity-fun-addon_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/fruity-fun-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6613/FruityFun-.mcaddon-ver-1.1.mcaddon.zip"},{"href":"https://dl.mcpedl.com/addons/6613/FruityFun-.zip-ver-1.1.zip"}],"uploadedBy":"KatKoin","uploadedAt":"12 Dec, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/fruity-fun-add-on/"},{"title":"[2.0] MarkMake ? Recording Tool","briefDescription":"This is a simple and intuitive recording tool, it does not require you to enter any commands when in use, you can smoothly record the ...","Description":"","crawledImageUrls":[{"text":"This is a simple and intuitive recording tool, it does not require you to enter any commands when in use, you can smoothly record the shots you want.\nFeatures:\n1. Smooth movement\n2. Up to 500 anchor points\n3. No need to enter commands when using\nPreparation before use:\n1. Use the command block to set ?Block? to ?Repeat?; ?Redstone? to ?Always Active? and other settings remain unchanged\n2. Enter /function must/Fast in the repeat command Block\n","url":"https://my.mcpedl.com/storage/addons/6462/images/20-markmakerecording-tool_4.png"},{"text":"3. You can enter /gamerule commandBlockOutput False to hide the prompt\n4. Enter the command /function C (set yourself as a camera)\n","url":"https://my.mcpedl.com/storage/addons/6462/images/20-markmakerecording-tool_5.png"},{"text":"1. At the bottom you will see 4 control buttons, you can throw them out to use them.\n?+? and ?-? are buttons to control the anchor point\nThe dark red ?+? and dark blue ?-? are buttons for speed control\n?\u003e? is the button to switch to start playing and stop playing\n?C? is to clear all anchor points\n2. In the game, attack the center of the screen to save the anchor point\n3. There is a prompt box on the right, you can view your current location\nNote ??: Save the anchor points in order. There can be no empty anchor points between point a and point b, and point a can only start from 0, that is to say, start saving from ?0?.\n","url":"https://my.mcpedl.com/storage/addons/6462/images/20-markmake--recording-tool_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/20-markmakerecording-tool_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6462/MarkMake_behavior_pack_2.1_EN_1607578623.mcpack"},{"href":"https://dl.mcpedl.com/addons/6462/MarkMake_resource_pack_2.1_EN_1607578623.mcpack"},{"href":"https://dl.mcpedl.com/addons/6462/MarkMake_behavior_pack_1606747774.mcpack"},{"href":"https://dl.mcpedl.com/addons/6462/MarkMake_resource_pack_1606747774.mcpack"}],"uploadedBy":"w111010","uploadedAt":"1 Dec, 2020 (Updated)","supporteds":["1.16","1.16.200","1.16.210 (beta)"],"originUrl":"https://mcpedl.com/markmake-recording-tool-addon/"},{"title":"Lulu?s Addon","briefDescription":"This addon makes grinding much easier but some mobs got buffed (i buffed the phantom so much that u cant survive with full protect 4 neterite ...","Description":"","crawledImageUrls":[{"text":"This addon makes grinding much easier but some mobs got buffed (i buffed the phantom so much that u cant survive with full protect 4 neterite armor+ godapple the only way u survive is a totem)\nI just made this pack for fun and dont rlly care about balance\nNetherite is much easier to get.\nGod apples are easier and are now craftable.\nU can make the ingot with 4 nuggets instead of 9.\nMobs drops much more stuff.\nShulkerbox recipe is now shapeless.\nPiglins have a change to give u netherite scrap.\n","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_2.png"},{"text":"Boat recipe is now the same on java.\n","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_6.png"},{"text":"Drops are more common.\nCraftable chainmail (and changed chain recipe)\n","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_8.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6486/images/lulus-addon_9.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/lulus-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6486/lulugrindless.mcpack"},{"href":"https://dl.mcpedl.com/addons/6486/lulugrindless.zip"}],"uploadedBy":"TheluckyguyNL","uploadedAt":"11 Dec, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/lulus-addon/"},{"title":"Mini Blocks! Beta Version","briefDescription":"Need some little cutie blocks to decorate? But most of them faking it with entities? Try Mini Blocks! This Addon adds 20+ blocks for now and ...","Description":"","crawledImageUrls":[{"text":"Need some little cutie blocks to decorate? But most of them faking it with entities? Try Mini Blocks! This Addon adds 20+ blocks for now and more are coming in the future! All of them are obtainable on survival with cheap materials!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_2.png"},{"text":"This is the basic among other blocks. Craftable just using stonecutter and grass block!\nYou can get the grass blocks from Endermans or Silk touch Tools.\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_3.png"},{"text":"This is the cheapest block to obtain because it just need a single dirt.\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_8.png"},{"text":"This block is best for detailing small spaces such as bedrooms or storage rooms! Just throw a chest to the stonecutter and voila\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_9.png"},{"text":"Added all types of logs! Just craft them using stonecutter!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_12.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_13.png"},{"text":"Basic for all Mini Ore Blocks down below!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_20.gif"},{"text":"Crafting Recipes are above!\nThere are Netherrack, Soul Sand, and Ancient Debris! And also a little Nether Portal!\nCraft them using stonecutter! And for the ancient debris, you just need to combine the scrap with mini netherrack!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_21.png"},{"text":"Mini Nether Portal are crafted by putting obsidian on a stonecutter. Use flint and steel to ignite and reignite them!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_26.png"},{"text":"The recipe is also simple! Just put the endstone on a stonecutter again!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_29.png"},{"text":"There is some blocks that are not in the photos yet! These are the list of alll of them!\nv.1.0\n-Mini Grass\n-Mini Dirt\n-Mini Chest\n-Mini Cobblestone\nv.1.1\n-Mini Oak Log\n-Mini Spruce Log\n-Mini Birch Log\n-Mini Jungle Log\n-Mini Acacia Log\n-Mini Dark Oak log\n-Mini Coal Ore\n-Mini Iron Ore\n-Mini Gold Ore\n-Mini Lapis Ore\n-Mini Redstone Ore\n-Mini Emerald Ore\n-Mini Diamond Ore\n-Mini Stone\n-Mini Mossy Cobblestone\n-Mini Nether Portal (On)\n-Mini Nether Portal (Off)\n-Mini Netherrack\n-Mini Soul Sand\n-Mini Ancient Debris\n-Mini End Stone\n-Mini Furnace\n-Mini Crafting Table\n? Mini Mossy Cobblestones are not craftable. It?s a bug I cant fix. Its always like that since I made it. However you can still get it using commands!\n? Highly Decorative\nPerfect to decorating small spaces such as rooms and even caves!\n","url":"https://my.mcpedl.com/storage/addons/6589/images/mini-blocks-beta-version_11.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/mini-blocks-beta-version_1-3-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6589/MiniBlocks-v.1.1.mcaddon"}],"uploadedBy":"Derp Craft","uploadedAt":"8 Dec, 2020 (Updated)","supporteds":["1.16.100","1.16.101"],"originUrl":"https://mcpedl.com/mini-blocks-addon/"},{"title":"CHRISTMAS NIGHT(mare) Addon!","briefDescription":"Christmas time!! And you\u0027re definitely on Santa\u0027s naughty list.Santa and his merry band of Elves are hard at work, preparing for your visit. And ...","Description":"A big THANK YOU to Kevin MacLeod (incompetech.com) for the *perfect* version of Jingle Bells. Licensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/\n","crawledImageUrls":[{"text":"Christmas time!! And you?re definitely on Santa?s naughty list.\nSanta and his merry band of Elves are hard at work, preparing for your visit. And waiting. Waiting. Just. For. You.\nBring a touch of the festive season to your Minecraft survival world! This pack will spawn in your very own Santa?s Workshop, full of elves, and with Santa (of course). But Santa?s having a very bad day, and? you?ll see.\nTo get a workshop you need a big, black present and they will only appear in the Snowy Tundra/Ice Plains biome. You might need to wander around for a bit, and there?s green and red presents that contain a random gift (or maybe even nothing). The green ones typically have better (and more) drops.\nOnce you find a black present, chop it open and? stand back.\nThere?s a wide variety of mobs to play with. Let?s see!\nNote! The black presents will transform into green or red presents after some time.\n","url":"https://my.mcpedl.com/storage/addons/1753/images/christmas-nightmare-addon_2.jpg"},{"text":"","url":"https://my.mcpedl.com/storage/addons/1753/images/christmas-nightmare-addon_3.jpg"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/christmas-nightmare-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/1753/christmas.v5_1607506660.mcaddon"},{"href":"http://www.mediafire.com/file/hnkgthgcs23gmuv/christmas.v5.mcaddon/file"}],"uploadedBy":"mno","uploadedAt":"9 Dec, 2019 (Updated)","supporteds":["1.16","1.16.100","1.16.101","1.16.200","1.16.210 (beta)"],"originUrl":"https://mcpedl.com/christmas-nightmare-addon/"},{"title":"Project Walker","briefDescription":"PROJECT WALKERProject Walker intends to change the way we play minecraft, now the game is set in a post-apocalyptic world you must look for supplies ...","Description":"","crawledImageUrls":[{"text":"Project Walker intends to change the way we play minecraft, now the game is set in a post-apocalyptic world you must look for supplies to stay alive, the undead alone are not so dangerous, but a package can be lethal, be careful with other survivors because not all of them are friendly and also be more careful with other players (in case of multiplayer) as they may want to steal it.\nContributions:\nGabriel Aplok\nAmor Duro\nDistante??\nVoxet\nM?quina de Constru??o\n","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_19.png"},{"text":"Players should take care of the fall damage as they can break their legs, but if their legs are broken just use the morphine and the player will no longer feel his leg hurt.\nThe infected were human beings before dying, after death by infection they are transformed into zombies, the zombies have no logical reasoning so they do not hold items or open doors or climb stairs and are also very aggressive towards animals and those who are not infected.\n","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_5.png"},{"text":"Players must be careful when being attacked by zombies as they can get the virus that only comes out if the player dies or uses the cure, if you choose to use the cure the player will no longer be infected\nin a post-apocalyptic world the remaining foods are canned or dry foods\n","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_22.png"},{"text":"melee weapons are the best way to enter places without being noticed\n","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_23.png"},{"text":"some weapons last longer than others and have more useful life than others and some have more damage than others.\n","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_9.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_10.png"},{"text":"The builds of the addon were made with the Feature Rule Generator PRO. And the buildings have loots in trunks\n","url":"https://my.mcpedl.com/storage/addons/609/images/project-walker_24.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/project-walker_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/609/ProjectWalker-_1607202727.mcaddon"},{"href":"https://dl.mcpedl.com/addons/609/ProjectWalker-_1607202728.zip"}],"uploadedBy":"Mano Galo","uploadedAt":"10 Jul, 2020 (Updated)","supporteds":["1.16","1.16.100","1.16.101","1.16.200"],"originUrl":"https://mcpedl.com/project-walker-addon/"},{"title":"Realistic Vending Machine (Japan)","briefDescription":"It is an addon that reproduces a realistic Japanese vending machine. It\u0027s not very conspicuous, but it will definitely raise the quality of your town! ...","Description":"","crawledImageUrls":[{"text":"It is an addon that reproduces a realistic Japanese vending machine.\nIt?s not very conspicuous, but it will definitely raise the quality of your town!\nLet?s make it a real city!\n","url":"https://my.mcpedl.com/storage/addons/6620/images/realistic-vending-machine-japan_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/realistic-vending-machine-japan_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6620/_1607515512.mcaddon"}],"uploadedBy":"shiraishi.aoi","uploadedAt":"9 Dec, 2020","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/realistic-vending-machine-japan/"},{"title":"Socketed Weapons","briefDescription":"Socketed Weapons adds 16 new swords, 1 new melee/throwable weapon, 2 new gemstones, 2 new blocks, 2 new ores and a custom crafting table. Enhance your Minecraft game with ...","Description":"","crawledImageUrls":[{"text":"Socketed Weapons adds 16 new swords, 1 new melee/throwable weapon, 2 new gemstones, 2 new blocks, 2 new ores and a custom crafting table. Enhance your Minecraft game with these powerful new weapons!\nEnhance your Minecraft game with these powerful new weapons! No player.json used!\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_9.png"},{"text":"Introducing Daggers, the stackable, throwable melee weapon! The daggers are ok for hand to hand combat, but where they really shine is when you throw them. With lightning speed the dagger flies from your hand to your target. If it hits, it?s destroyed, like an arrow. If you miss you better go pick it up before someone else does. Able to craft anywhere, all you need is a stick and an iron ingot to net you 4 of these guys. You can even hold them in your offhand!\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_3.png"},{"text":"After you?ve wasted too much time throwing daggers everywhere you will want to try the new socketed swords. First, however, you will need a workspace to socket your gem. That?s where the Jeweler?s Table comes in. Some slabs, sticks and a gold ingot will let you make one of these special crafting tables. You can use any overworld wooden slab.\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_4.png"},{"text":"Now that you have your Jeweler?s Table you are ready to get some powerful weapons. Two more things you will need to get firs is a fresh sword, Iron, Gold, Diamond or Netherite and one of the four gems, Diamond, Emerald, Ruby, Sapphire. You can get the new gems by mining for them around the same area as diamonds. Each gem provides different effects, each sword changes the strength and duration of the effects.\nIf you socket a Ruby, your sword will get a 50% damage boost and if you use it you will get the Strength effect.\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_5.gif"},{"text":"If you socket an Emerald, your sword will give you Regeneration for a short time as well as Absorption when used. This sword comes with a cooldown so it can?t be abused.\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_6.gif"},{"text":"If you socket a Diamond, your sword will have double the durability and gives you Resistance effect when used.\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_7.gif"},{"text":"If you socket a Sapphire, your sword will give you both the Jump Boost and Speed effects when used.\n","url":"https://my.mcpedl.com/storage/addons/6487/images/socketed-weapons_8.gif"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/socketed-weapons_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6487/Socketed-Weapons-Pack_1607447676.mcaddon"},{"href":"https://dl.mcpedl.com/addons/6487/Socketed-Weapons-Pack_1607447676.zip"},{"href":"https://cdn.discordapp.com/attachments/783656734043406336/785909585336467467/Socketed_Weapons_Pack.mcaddon"}],"uploadedBy":"SCrEamIngXaLIEn","uploadedAt":"1 Dec, 2020 (Updated)","supporteds":["1.16.100","1.16.101"],"originUrl":"https://mcpedl.com/socketed-weapons-addon/"},{"title":"Colored Ingots and Swords!","briefDescription":"Looking for new swords? new ingots?? All colored??? So you\u0027re crazy. Just kidding, you\u0027re in the right place!This Add-on adds 2 types of Ingots and ...","Description":"","crawledImageUrls":[{"text":"Looking for new swords? new ingots?? All colored??? So you?re crazy. Just kidding, you?re in the right place!\nThis Add-on adds 2 types of Ingots and Swords, 12 new ingots, 12 new swords. All craftable!!\n","url":"https://my.mcpedl.com/storage/addons/6539/images/colored-ingots-and-swords_2.png"},{"text":"Hi! this is my first add-on sent to MCPEDL, I hope you like it!\n1. Craft of the Ingots:\nThe 1st and 2nd types of ingots have the same craft method. In the Stonecutter.\nThe 1st type of ingot is made with an iron ingot. Simply place the iron ingot on the Stonecutter and all new colored ingots will appear.\nThe 2nd type uses, instead of an iron ingot, it uses a Netherite ingot.\n","url":"https://my.mcpedl.com/storage/addons/6539/images/colored-ingots-and-swords_3.png"},{"text":"Crafiting?\n","url":"https://my.mcpedl.com/storage/addons/6539/images/colored-ingots-and-swords_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6539/images/colored-ingots-and-swords_5.png"},{"text":"swords made with the 1st type of sword have the conventional craft.\nbut the 2nd of swords have a custom craft. View in the image\n","url":"https://my.mcpedl.com/storage/addons/6539/images/colored-ingots-and-swords_6.png"},{"text":"(I didn?t print photos from the Crafting Table UI ? I forgot about it)\nthe 1st type of Sword deals 6 damage, just like an iron sword.\nthe 2nd type of Sword deals 8 damage, just like an Netherite sword.\nboth are indestructible.\nYou can get all the items writing:\n","url":"https://my.mcpedl.com/storage/addons/6539/images/colored-ingots-and-swords_7.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/colored-ingots-and-swords_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6539/ColoredCraft__1607477185203_1607480506.mcaddon"},{"href":"https://www.mediafire.com/download/v90oor3zfdepguu"}],"uploadedBy":"RezendErick","uploadedAt":"4 Dec, 2020 (Updated)","supporteds":["1.16.100","1.16.101"],"originUrl":"https://mcpedl.com/colored-ingots-and-swords/"},{"title":"Bedrock inSanity ? Big Bug Fix and Update","briefDescription":"A Stand-Alone Add-On for your Survival World! We have everything! And more!!We brought new changes to vanilla gameplay, as well as harder night time ...","Description":"","crawledImageUrls":[{"text":"A Stand-Alone Add-On for your Survival World! We have everything! And more!!\nWe brought new changes to vanilla gameplay, as well as harder night time experiences. We have new mobs, ores, weapons, everything!\nThis Add-On was created by SKVietnam (Soul Knight Vietnam), with the help of HaxTheCharizard, maker of the Tinkers? Legacy Add-On; Zahf22, maker of Dragon Add-On. And the cool people on Discord server. All updates since version 1.0.5 by MedicalJewel.\nPermission from creator:\n","url":"https://my.mcpedl.com/storage/addons/1497/images/bedrock-insanity--big-bug-fix-and-update_2.png"},{"text":"Join discord here.\nJoin it for past updates features, they won?t be written here.\nCool Features Added:\n? Potion storing system and loot tables added!\nMore Foods Added:\n? This update broughts new food: Berry Pie, Bottle with Jam and Prawn Soup. Also you can cook Prawns on soul campfire now!\n( Join the Discord for surprise and I will listen to your ideas and improvement! Link is above )\nNew Storage System:\n? Added 3 new compressed blocks: Compressed Soul Soil, Compressed Blackstone and Compressed End Stone.\n? Added Potion Storing system!\nMore Recipes?!\nAdded some recipes and re-crafting recipes for some vanilla items.\n? We have plenty of recipes! Do join the Discord to know how to craft them, or try to use /function help.\nThere are the old stuffs and more?. discover them yourself in Survival or by Creative!\nUse /give @s bs:(item_name) to find out ?\nAnd dc:(item_name) too!\nNew Mobs?!\n? Added TNT Creeper\n? Added Jungle Zombie\n? Added Beeper\nNew Weapons?!\n? Added Electric Whip (Dead Cells)\nNew Tools \u0026 Armor!?\n? Added silver armor\n? Added copper armor\n? Added copper tools\n? Added silver tools (not yet, joind Discord server to get new version before it is posted on mcpedl\nChanged textures:\n? Better icon for fishing rod\n? Added outlined texture for gilded blackstone\n? Fixed connected glass textures\n? Added texture for compass\nAnd more!\nNew ingame UI?\nI?ve tweeked the ingame UI a bit, there?re 2 different options for now, please refer to the picture below to activate it:\n","url":"https://my.mcpedl.com/storage/addons/1497/images/bedrock-insanity--compatibility-update-to-116_2.png"},{"text":"Screenshot of me and everything new:\n","url":"https://my.mcpedl.com/storage/addons/1497/images/bedrock-insanity--big-bug-fix-and-update_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/1497/images/bedrock-insanity--big-bug-fix-and-update_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/1497/images/bedrock-insanity--big-bug-fix-and-update_5.png"},{"text":"New UI: Nope, same as the old versions.\n","url":"https://my.mcpedl.com/storage/addons/1497/images/bedrock-insanity--performance-update_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/bedrock-insanity-big-bug-fix-and-update_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/1497/Recipes.zip"},{"href":"https://direct-link.net/159475/437439"},{"href":"https://direct-link.net/159475/53748"}],"uploadedBy":"MedicalJewel","uploadedAt":"15 Oct, 2019 (Updated)","supporteds":["1.16","1.16.100","1.16.101"],"originUrl":"https://mcpedl.com/bedrock-insanity/"},{"title":"Global Java Parity Patch","briefDescription":"This is global Minecraft Bedrock res \u0026 beh pack to make your gameplay experience the same Java Edition. All bedrock platforms are supported. No replaced files, ...","Description":"","crawledImageUrls":[{"text":"This is global Minecraft Bedrock res \u0026 beh pack to make your gameplay experience the same Java Edition. All bedrock platforms are supported. No replaced files, just corrections, fixes and improvements!\nThis patch contains resource and behavior pack\nBehavior Changes:\nEntities:\n? Changed mobs health to match Java Edition\n* besides mobs which can be armored, wither, ender dragon\n? Corrected cow panic, tempt speed to match Java Edition\n? Corrected sheep random stroll, panic, tempt speed to match Java Edition\n? Corrected pig panic speed to match Java Edition\n? Corrected chicken panic speed to match Java Edition\n? Corrected ocelot and cat sprint, panic priority and speed to match Java Edition\n? Corrected llama stroll, panic speed to match Java Edition\n? Corrected fox panic speed to match Java Edition\n? Corrected villager panic and sprint speed to match Java Edition\n? Corrected pillager stroll speed to match Java Edition\n? Corrected baby drowned walk speed to match Java Edition\n? Corrected mooshroom panic, tempt speed to match Java Edition\n? Corrected baby zombie pigman walk speed and adult zombie pigman melee attack walk speed to match Java Edition\n? Corrected witch attack walk speed to match Java Edition\n? Corrected wither_skeleton melee attack walk speed to match Java Edition\nFeatures (structures):\n? Mega jungle tree height range now changed to 8-16 blocks\nFeature rules (generation rules):\n? Improved mega jungle tree and jungle tree generation chances to match Java Edition\n? Improved tall grass generation chance to match Java Edition on:\n* plains, savanna, jungle, mountains, swamp\nAnimation Changes:\n? Corrected pig animation to match Java Edition\n? Corrected cow animation to match Java Edition\n? Corrected sheep animation to match Java Edition\n? Corrected chicken animation to match Java Edition\n? Corrected mooshroom animation to match Java Edition\n? Corrected zombie animation to match Java Edition\n? Corrected zombie villager animation to match Java Edition\n? Corrected zombie pigman animation to match Java Edition\n? Corrected piglin animation to match Java Edition\n? Corrected skeleton animation to match Java Edition\n? Corrected stray animation to match Java Edition\n? Corrected creeper animation to match Java Edition\n? Corrected villager animation to match Java Edition\n? Corrected pillager animation to match Java Edition\n? Corrected evokation_illager animation to match Java Edition\n? Corrected vindicator animation to match Java Edition\n? Corrected witch animation to match Java Edition\n? Corrected wither_skeleton animation to match Java Edition\nModel Changes:\n? Corrected baby cow head position to match Java Edition\n? Corrected baby villager head size to match Java Edition\n? Corrected baby wolf head size to match Java Edition\nTexture Changes:\n? Some colormap parity improvements\n? Particles texture was redrawn using Java vanilla resources\nSound Changes:\n? Corrected explosion sound pitch range to match Java Edition\n? Corrected lightning bolt explosion (ambient.weather.lightning.impact) sound volume to match Java Edition\n? Corrected all blocks place and brake sound pitch to match Java Edition\n? Corrected pitch range for item pick up (random.pop) sound to match Java Edition\nCorrected jungles:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_5.png"},{"text":"Corrected plains:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_6.png"},{"text":"Corrected savanna:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_4.png"},{"text":"Java creeper flashing:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_7.png"},{"text":"Java particles:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_8.png"},{"text":"Java hurt color:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_9.png"},{"text":"Java on_fire color:\n","url":"https://my.mcpedl.com/storage/addons/6064/images/global-java-parity-patch_10.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/global-java-parity-patch_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6064/Global-Java-Parity-Patch-v1.1.mcaddon"}],"uploadedBy":"FaradayOUS","uploadedAt":"7 Nov, 2020 (Updated)","supporteds":["1.16.100","1.16.101"],"originUrl":"https://mcpedl.com/global-java-parity-patch-addon/"},{"title":"Chainmail Add-on","briefDescription":"A very basic add-on that adds chainmail as an item to the game and makes chainmail armor craftable just like other armors. This can make ...","Description":"","crawledImageUrls":[{"text":"A very basic add-on that adds chainmail as an item to the game and makes chainmail armor craftable just like other armors. This can make for a little addition to your survival worlds.\nThis addon is a pretty small and basic add-on.\n","url":"https://my.mcpedl.com/storage/addons/6588/images/chainmail-addon_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/6588/images/chainmail-addon_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/chainmail-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/6588/Chainmail.zip"},{"href":"https://dl.mcpedl.com/addons/6588/Chainmail_1607345577.mcaddon"}],"uploadedBy":"NuclearVolcano","uploadedAt":"8 Dec, 2020","supporteds":["1.16.101"],"originUrl":"https://mcpedl.com/chainmail-add-on/"},{"title":"Freddy Craft","briefDescription":"Do you like fnaf? If so then we have something in common, but I also like minecraft so I decided to make my own addon ...","Description":"","crawledImageUrls":[{"text":"Do you like fnaf? If so then we have something in common, but I also like minecraft so I decided to make my own addon based around it but I decided to do something I have yet to see, make the animatronics craftable\nThis addon adds in characters from the iconic game franchise Five Nights at Freddy?s, it?s been done before but I added a twist, it allows you to craft the animatronics\nCrafting recipes:\nEndoskeleton\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_2.png"},{"text":"Iron rod\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_3.png"},{"text":"Microphone\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_4.png"},{"text":"Bow tie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_5.png"},{"text":"Freddy Fazbear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_6.png"},{"text":"Guitar\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_7.png"},{"text":"Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_8.png"},{"text":"Cupcake\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_9.png"},{"text":"Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_10.png"},{"text":"Hook\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_11.png"},{"text":"Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_12.png"},{"text":"Get steel by trading with William and Henry\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_13.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_14.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_15.png"},{"text":"Use steel to make faz-coins and gen 2 endoskeletons\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_16.png"},{"text":"Use Gen 2 endo for toy animatronic\nToy Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_18.png"},{"text":"Toy Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_19.png"},{"text":"Toy Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_20.png"},{"text":"Toy Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_21.png"},{"text":"Puppet Mask\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_27.png"},{"text":"The Puppet\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_28.png"},{"text":"Balloon Boy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_24.png"},{"text":"Dark Remnant\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_29.png"},{"text":"Springtrap\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_30.png"},{"text":"Walkie Talkie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_31.png"},{"text":"Scrap, this will also drop from the withered animatronics\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_32.png"},{"text":"Withered Crate\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_33.png"},{"text":"Destroy it to get 1 of 4 inactive withered animatronics\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_34.png"},{"text":"Withered Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_35.png"},{"text":"Withered Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_36.png"},{"text":"Withered Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_37.png"},{"text":"Withered Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_38.png"},{"text":"Mediocre Melody Crate, crafted like the withered Crate but with steel instead of scrap and will drop 1 of 5 Mediocre Melodies\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_39.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_40.png"},{"text":"Happy Frog\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_41.png"},{"text":"Mr. Hippo\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_42.png"},{"text":"Pigpatch\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_43.png"},{"text":"Nedd Bear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_44.png"},{"text":"Golden Star\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_45.png"},{"text":"Rockstar Crate, use this to get inactive versions of the rockstar animatronics\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_46.png"},{"text":"Rockstar Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_47.png"},{"text":"Rockstar Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_48.png"},{"text":"Rockstar Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_49.png"},{"text":"Rockstar Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_50.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_51.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_52.png"},{"text":"Book Crate, use this to get inactive versions of the book animatronics\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_53.png"},{"text":"Twisted Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_54.png"},{"text":"Twisted Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_55.png"},{"text":"Twisted Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_56.png"},{"text":"Twisted Wolf\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_57.png"},{"text":"Lonely Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_58.png"},{"text":"Fetch\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_59.png"},{"text":"Get phantom slime and inactive plushtrap from Dave Miller\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_60.png"},{"text":"Illusion Disc, made with steel, black dye, and redstone\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_61.png"},{"text":"Nightmare Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_62.png"},{"text":"Nightmare Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_63.png"},{"text":"Nightmare Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_64.png"},{"text":"Nightmare Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_65.png"},{"text":"Phantom Crate made with phantom slime\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_66.png"},{"text":"Phantom Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_67.png"},{"text":"Phantom Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_68.png"},{"text":"Phantom Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_69.png"},{"text":"Phantom Mangle\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_70.png"},{"text":"Phantom Balloon Boy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_71.png"},{"text":"Phantom Puppet\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_72.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_73.png"},{"text":"Jack-O-Bonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_74.png"},{"text":"Jack-O-Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_75.png"},{"text":"Nightmare Mangle\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_76.png"},{"text":"Nightmare Balloon Boy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_77.png"},{"text":"Nightmarionne\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_78.png"},{"text":"Funtime Crate\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_79.png"},{"text":"Circus Baby\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_80.png"},{"text":"Funtime Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_81.png"},{"text":"Funtime Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_82.png"},{"text":"Ballora\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_83.png"},{"text":"Get Fredbear and Springbonnie suits by trading with William and Henry\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_84.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_85.png"},{"text":"Fredbear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_86.png"},{"text":"Springbonnie\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_87.png"},{"text":"Get Pure Remnant and Pure Dark Remnant by smelting down their iron forms, this will only work in the blast furnace not the normal furnace\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_88.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_89.png"},{"text":"Fredbear?s Hat\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_90.png"},{"text":"Nightmare Fredbear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_91.png"},{"text":"Nightmare\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_92.png"},{"text":"Shadow Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_93.png"},{"text":"RXQ\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_94.png"},{"text":"Kill Springtrap for a item called the Corrupted Circuit Board, use it to make glitchtrap\nGlitchtrap\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_95.png"},{"text":"Golden Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_96.png"},{"text":"Micheal Afton and Helpy, they spawn in Fazbear hills with William, Henry, and Dave\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_97.png"},{"text":"Micheal Afton trades inactive Lefty\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_98.png"},{"text":"Helpy Trades the Posh Pizzeria animatronics from Fnaf 6\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_99.png"},{"text":"Lefty\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_100.png"},{"text":"Music Man\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_101.png"},{"text":"El Chip\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_102.png"},{"text":"Funtime Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_103.png"},{"text":"Bidybab, get the inactive version from the funtime crate\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_104.png"},{"text":"Electobab\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_105.png"},{"text":"Minireena, get the inactive version from the funtime crate\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_106.png"},{"text":"Ennard\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_107.png"},{"text":"Lolbit\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_108.png"},{"text":"Kill Funtime Freddy for the bon bon item\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_109.png"},{"text":"Bonnet\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_110.png"},{"text":"Vanny, trade with her for Vanny?s Knife and the Moon Mask\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_111.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_112.png"},{"text":"Use Vanny?s Knife to make the Glamrock Crate and break it to get 1 of 4 inactive Glamrock animatronics\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_113.png"},{"text":"Glamrock Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_114.png"},{"text":"Glamrock Chica\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_115.png"},{"text":"Monty\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_116.png"},{"text":"Roxanne\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_117.png"},{"text":"Use the Moon mask to make the moon animatronic\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_118.png"},{"text":"Phone Guy, trade with him to get both Frostbear?s Icicle and Inactive 8-Bit Baby\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_119.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_120.png"},{"text":"Freddy Frostbear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_121.png"},{"text":"8-Bit Baby\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_122.png"},{"text":"JJ\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_123.png"},{"text":"DeeDee\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_124.png"},{"text":"XOR\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_125.png"},{"text":"New trade items for Micheal and Phone guy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_126.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_127.png"},{"text":"Scrap Baby\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_128.png"},{"text":"Scraptrap\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_129.png"},{"text":"Molten Freddy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_130.png"},{"text":"Trade with the Stitchwraith for new book animatronics\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_131.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_132.png"},{"text":"Ralpho\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_133.png"},{"text":"Theodore\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_134.png"},{"text":"Blackbird, Blackbird is a hostile mob that blinds you when it hits you, it only spawns in forests and upon death drops pure dark remnant\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_135.png"},{"text":"Halloween Crate drops Grim Foxy and Dreadbear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_136.png"},{"text":"Dreadbear\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_137.png"},{"text":"Grim Foxy\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_138.png"},{"text":"Old Man Consequences\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_139.png"},{"text":"","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_140.png"},{"text":"Chipper\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_141.png"},{"text":"Coffee\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_142.png"},{"text":"Animdude\n","url":"https://my.mcpedl.com/storage/addons/5557/images/freddy-craft_143.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/freddy-craft_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/addons/5557/Freddycraft12.0.mcaddon"},{"href":"https://dl.mcpedl.com/addons/5557/FreddyCraft11.0.mcaddon"}],"uploadedBy":"Cookiesnug","uploadedAt":"8 Oct, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/freddy-craft-addon/"}]