[{"title":"Space Survival","briefDescription":"So hey everyone, I\u0027ve been working on this space survival map.100% clearable and end dimension is accessible.And I\u0027ve also added some fun touches to ...","Description":"","crawledImageUrls":[{"text":"So hey everyone, I?ve been working on this space survival map.\n100% clearable and end dimension is accessible.\nAnd I?ve also added some fun touches to make the gameplay interesting.\nHope you like the map : )\n","url":"https://my.mcpedl.com/storage/worlds/6358/images/space-survival_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/space-survival_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/6358/SPACE-SURVIVAL.mcworld"},{"href":"https://dl.mcpedl.com/worlds/6358/SPACE-SURVIVAL.zip"}],"uploadedBy":"Espio347","uploadedAt":"31 May, 2020","supporteds":["1.14","1.15 (beta)","1.16","1.6"],"originUrl":"https://mcpedl.com/space-survival-map-1/"},{"title":"Frostbourne Plains Castle: Kingdom Update","briefDescription":"An old medieval castle made for the early versions of Pocket Edition, rebuilt, remodeled, and redecorated to be practical in a new Bedrock Edition 1.16 world. ...","Description":"","crawledImageUrls":[{"text":"An old medieval castle made for the early versions of Pocket Edition, rebuilt, remodeled, and redecorated to be practical in a new Bedrock Edition 1.16 world.\nAs I continued to expand this world, I decided to officially declare this a kingdom, starting by colonizing the nearby villages\nSo it?s a small castle originally built by an unknown player from a Minecraft builder app, but I redecorated it with the new Minecraft features to make it functional even without the use of redstone for the current versions of Minecraft. I also decorated it with the Frostbourne banner from Rainimator?s Fractures series to honor him and to make this world a human settlement.\n","url":"https://my.mcpedl.com/storage/worlds/6288/images/frostbourne-plains-castle-kingdom-update_2.png"},{"text":"It?s actually a practical fortress capable of fending off mobs, but isn?t good against enemy players. Since it?s populated by many villagers, a raid can occur, although the castle gives you a massive advantage as raiders are only used to raiding small villages, and they lack proper siege equipment against castles. I also placed a sugar cane farm and a nether portal just outside the castle.\nThere?s a nearby colonized village just in front of the castle, so the villagers in there will serve as good peasants as long as they?re treated properly.\n","url":"https://my.mcpedl.com/storage/worlds/6288/images/frostbourne-plains-castle-kingdom-update_3.png"},{"text":"Inside the Nether, there is a Crimson Forest and a hole with ladders that will take you to the bedrock level where you can mine ancient debris.\n","url":"https://my.mcpedl.com/storage/worlds/6288/images/frostbourne-plains-castle_7.png"},{"text":"Kingdom update: I decided to rename this world to Frostbourne Kingdom, and I made it a kingdom starting by colonizing the neighbouring Savannah village inorder to expand the size of the kingdom, a similar tactic used by the Villager Kingdom from Mr.FudgeMonkeyz?s Annoying Villagers. I?ll also colonize other unexplored villages if possible, or you can just do it yourself.\nYou must first cross an acacia bridge to visit the place.\n","url":"https://my.mcpedl.com/storage/worlds/6288/images/frostbourne-plains-castle-kingdom-update_4.png"},{"text":"The village is relatively small village populated mostly by animals.\n","url":"https://my.mcpedl.com/storage/worlds/6288/images/frostbourne-plains-castle-kingdom-update_5.png"},{"text":"In the original village, I added a Golem Totem, a magical totem with the power to summon an Iron Golem, greatly upgrading the village?s defense system against mobs. Although the golems summoned by this are neutral towards players, and shouldn?t be messed with.\n","url":"https://my.mcpedl.com/storage/worlds/6288/images/frostbourne-plains-castle-kingdom-update_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/frostbourne-plains-castle-kingdom-update_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/6288/HMjLXl1RBgA_1590858049.mcworld"},{"href":"https://dl.mcpedl.com/worlds/6288/Frostbourne-Kingdom.zip"},{"href":"https://dl.mcpedl.com/worlds/6288/Frostbourne-Plains-Castle-V2.zip"}],"uploadedBy":"Tyranitar Series","uploadedAt":"26 May, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/frostbourne-plains-castle/"},{"title":"Cactus Block","briefDescription":"Is Minecraft a little bit too cold? Do you need a warm desert island with prickly cactuses, that you have to survive off of? If ...","Description":"","crawledImageUrls":[{"text":"Is Minecraft a little bit too cold? Do you need a warm desert island with prickly cactuses, that you have to survive off of? If so, this map is for you.\nIn this skyblock map, you must try to survive off of cactuses. This map includes a behavior pack that adds cactus planks, which can be used in place of wood planks. Sandstone can also be used in place of cobblestone in most recipes.\n","url":"https://my.mcpedl.com/storage/worlds/6245/images/cactus-block_2.png"},{"text":"There are also ways to turn cacti into other essential materials in minecraft, such as cobblestone, crops, and string. Every 15 minutes, there will be a sandstorm, which provides renewable sand, but can also destroy your cactus farm if you don?t have a roof.\n","url":"https://my.mcpedl.com/storage/worlds/6245/images/cactus-block_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/cactus-block_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/6245/cactus-block_1590411700.mcworld"},{"href":"https://dl.mcpedl.com/worlds/6245/cactus-block.mcworld"}],"uploadedBy":"Llama Studios","uploadedAt":"25 May, 2020 (Updated)","supporteds":["1.14"],"originUrl":"https://mcpedl.com/cactus-block-map/"},{"title":"Az3?s Survival Disaster","briefDescription":"Welcome to a new minigame which the only goal to this game is to survive from the 20 fatal challenges someone has set. Whoever is the ...","Description":"","crawledImageUrls":[{"text":"Welcome to a new minigame which the only goal to this game is to survive from the 20 fatal challenges someone has set. Whoever is the last one alive wins the game!\nMAP DESCRIPTION:\nSurvival Disaster is a minigame that features an arena and 20 challenges for challengers like you. Challengers will survive these challenges and whoever is the last one standing will win the competition. Or else if everyone dies, a person with the highest accuracy will be chosen as a winner.\nMAP MANUAL:\nYou will spawn in a spawn area which includes 5 rooms: Game Initializer, Information, Credits, Developer?s Access and a Secret Room.\nMAP IMAGES:\n","url":"https://my.mcpedl.com/storage/worlds/5935/images/az3s-survival-disaster_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5935/images/az3s-survival-disaster_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5935/images/az3s-survival-disaster_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/az3s-survival-disaster_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5935/Az3s-Survival-Disaster-1.1.zip"},{"href":"https://dl.mcpedl.com/worlds/5935/Az3s-Survival-Disaster-1.1_1590233863.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5935/az3_1589305736.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5935/Az3s-Survival-Disaster_1589213879.zip"}],"uploadedBy":"OfficialAz3","uploadedAt":"12 May, 2020 (Updated)","supporteds":["1.14","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/az3s-survival-disaster/"},{"title":"SUBMEREGE","briefDescription":"This world is sumerged under water making it a very difficult survival map. Your mission is to collect all the heads and finally the ender ...","Description":"","crawledImageUrls":[{"text":"This world is sumerged under water making it a very difficult survival map.\nYour mission is to collect all the heads and finally the ender dragon egg.\nMap creator: Apeslix\nThis map is an underwater, foggy map which consists of surviving underwater gathering resources to get all the heads back and finally defeat the ender dragon.\n","url":"https://my.mcpedl.com/storage/worlds/6161/images/submerege-for-pewin-10_2.png"},{"text":"To get the heads you will need to explore the underwater and find the diferent temples were there are different monsters and prices.\n","url":"https://my.mcpedl.com/storage/worlds/6161/images/submerege-for-pewin-10_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/submerege-for-pewin-10_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/6161/a-SubmergecPE.mcworld"}],"uploadedBy":"Apeslix","uploadedAt":"21 May, 2020","supporteds":["1.14"],"originUrl":"https://mcpedl.com/submerege-map/"},{"title":"Enhanced Biomes Survival","briefDescription":"You want to play Minecraft Bedrock in Survival Mode, but with a more realistic environment? On this map you will find lots of little improvements ...","Description":"","crawledImageUrls":[{"text":"You want to play Minecraft Bedrock in Survival Mode, but with a more realistic environment? On this map you will find lots of little improvements to the landscape, from the top of the mountains, to the sandy dunes in front of a lighthouse. But even beyond the edited area, you will find a diverse variety of auto-generated Minecraft biomes, which make this seed ideal for playing survival mode.\nEnhanced biomes: Village, Beach, Mountains, Swamp and Plains, which have been redesigned with birch and oak forests.\nBut that?s not all, there are some secret places to discover and maybe some hidden treasures? Even if this is true, they cannot be reached without putting yourself in danger!\n","url":"https://my.mcpedl.com/storage/worlds/6144/images/enhanced-biomes-survival_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/enhanced-biomes-survival_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/6144/Enhanced-Biomes-MCPE.mcworld"}],"uploadedBy":"Wilhelmine","uploadedAt":"20 May, 2020","supporteds":["1.14"],"originUrl":"https://mcpedl.com/enhanced-biomes-survival/"},{"title":"Swamp Light Village","briefDescription":"So this is one of my worlds that I play in. It is the oldest surviving world I have, it has been around since the ...","Description":"","crawledImageUrls":[{"text":"So this is one of my worlds that I play in. It is the oldest surviving world I have, it has been around since the very early days of the beta versions of 1.14. It is a swamp village built close to my spawn. It used to be a single witch hut until I killed the owner and built my own village.\nSo it is a medium sized village with a relatively large population of villagers with a thriving economy. The village is full of fences and light sources, protecting them from outside threats. Zombies and Raiders have a difficult time trying to get in.\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_2.png"},{"text":"The structures consist of farm houses, a council hall, some farmlands, a butcher shop, a big house, several small huts, a small garden, a desert hut, a medieval bath tub, and an outhouse.\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_4.png"},{"text":"Theres also a small fortress of blackstone located on the land near the swamp that serves as your house, you don?t want to live in the village as the villagers would steal your bed.\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_5.png"},{"text":"As I continued my adventures, I went back to the Nether. Sadly, since I entered this world pre-1.16, the Nether consists mostly of nether wastes and no ancient debris can be found close to the portal, I had to build a fake warped forest to trick myself of hope. But luckily for me, there?s a large nether fortress nearby, and as you explore the fortress, you?ll eventually reach a crimson forest, with a camp located nearby that protects against both hoglins and zoglins. There?s also a long bridge that connects it to a real warped forest and a piglin bastion further away.\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_6.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_8.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_12.png"},{"text":"New features:\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_13.png"},{"text":"Barracks ? For storing weapons, armor, potions, and any other items useful for warfare\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_14.png"},{"text":"Nether Hut ? Found in the Crimson forest, it?s a small safehouse with countermeasures for Piglins and Hoglins.\nNote:\n1. Achievements cannot be earned in this world, as I used structure blocks and MCPE master to build this world in the past.\n2. This world has the colorful mutant wolves addon but without the resource pack. The two wolves sisters, Jaiden and Elizabeth are sitting in the council hall. Sneak to stand them up, they are mighty beasts capable of bringing down most mobs on their own. Please handle them with care.\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_10.png"},{"text":"3. The weapons, armor, and other items used to be diamond tools edited by MCPE Master months ago. They are currently upgraded into netherite tools.\n4. The designs might look weird and unusual to some.\n5. The village is decorated with banners, mostly the Frostbourne banner from Rainimator?s Fracture series, a modified Mojang banner, and Pewdiepie?s Swedish flag.\n","url":"https://my.mcpedl.com/storage/worlds/5907/images/swamp-light-village_11.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/swamp-light-village_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5907/Swamp-Light-Village-V2.zip"},{"href":"https://dl.mcpedl.com/worlds/5907/swamp_village.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5907/Swamp-Light-Village.zip"}],"uploadedBy":"Tyranitar Series","uploadedAt":"11 May, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/swamp-light-village/"},{"title":"IronAgate?s Skyblock Lite","briefDescription":"There are so many complicated modded skyblock maps these days? Skyblock Lite is bringing it back to the basics! Spawn in an infinite void with ...","Description":"","crawledImageUrls":[{"text":"There are so many complicated modded skyblock maps these days? Skyblock Lite is bringing it back to the basics! Spawn in an infinite void with limited resources and see how long you can survive!\nSkyblock Lite is going back to the basics! You spawn on a grassy island with a tree and a chest. Nearby is a tiny desert island with obsidian to travel to the nether. Through the portal you will find a soul sand island in a giant 2k by 2k nether void! Be careful though, there are floating nether fortresses and lava clusters. Good luck and have fun!\n","url":"http://my.mcpedl.com/storage/worlds/2100/images/ironagates-skyblock-lite_2.png"},{"text":"","url":"http://my.mcpedl.com/storage/worlds/2100/images/ironagates-skyblock-lite_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/ironagates-skyblock-lite_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/2100/IAs-Skyblock-Lite_1589233532.mcworld"},{"href":"https://dl.mcpedl.com/worlds/2100/SkyblockLite.mcworld"}],"uploadedBy":"IronAgate","uploadedAt":"26 Jul, 2019 (Updated)","supporteds":["1.14"],"originUrl":"https://mcpedl.com/ironagates-skyblock-lite/"},{"title":"ThrivingBadLands","briefDescription":"Early one morning many years ago in the scorched badlands the ground began to tremble and shake furiously before anyone could blink mesa pillars started ...","Description":"","crawledImageUrls":[{"text":"Early one morning many years ago in the scorched badlands the ground began to tremble and shake furiously before anyone could blink mesa pillars started to shoot up and out from below the barren surface chunks with unbelievible force soaring through the clouds reaching the untouched blue skys bringing water and life from below back to the dying surface.\n","url":"https://my.mcpedl.com/storage/worlds/5799/images/thrivingbadlands_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/05/thrivingbadlands_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5799/ThrivingBadLands.mcworld"}],"uploadedBy":"Subthology","uploadedAt":"6 May, 2020","supporteds":["1.14"],"originUrl":"https://mcpedl.com/thrivingbadlands/"},{"title":"The Realm S1 ? Multiplayer Survival Series World Download","briefDescription":"In this Survival World You will have access to a beacon, the end, DIAMONDS, And all kinds of cool stuff. BTW You can earn achievements ...","Description":"","crawledImageUrls":[{"text":"In this Survival World You will have access to a beacon, the end, DIAMONDS, And all kinds of cool stuff. BTW You can earn achievements on this world. This is Season 1, which means S2 will be coming out soon!\nThe Realm is a multiplayer world in the design of a realm. Its main online players were ItsAlphoenixYT and BBPlayz0512. Other players came on, but the most active were those two.\nIn this Survival World You will have access to a beacon, the end, DIAMONDS,\nAnd all kinds of cool stuff.\nBye the Way, this is Season 1, which means S2 will be coming out soon!\nSpoiler Alert! S2 will have a ravine base and villager trading post.\nIf you liked this world please Subscribe at: https://www.youtube.com/channel/UCggwTmT9bukOoJeMrmhk28Q?view_as\u003dsubscriber\nAlso I?m Pretty sure there are some end crystals or the materials to make end crystals in one of my chest.\nThis is the Beacon, Its Coordinates are 267, 66, 118!\n","url":"https://my.mcpedl.com/storage/worlds/5614/images/the-realm-s1-multiplayer-survival-series-world-download_2.png"},{"text":"This is the end portal, Its fully activated, its coordinates are -870, 22, -206!\n","url":"https://my.mcpedl.com/storage/worlds/5614/images/the-realm-s1-multiplayer-survival-series-world-download_3.png"},{"text":"This is where to dig down into the portal room, its coordinates are -868, 71, -207!\n","url":"https://my.mcpedl.com/storage/worlds/5614/images/the-realm-s1-multiplayer-survival-series-world-download_4.png"},{"text":"If you need gravel, make sure to come to this mountain of gravel. Its at -269, 64, -102.\n","url":"https://my.mcpedl.com/storage/worlds/5614/images/the-realm-s1-multiplayer-survival-series-world-download_5.png"},{"text":"Home village at 160, 63, 40.\n","url":"https://my.mcpedl.com/storage/worlds/5614/images/the-realm-s1-multiplayer-survival-series-world-download_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/the-realm-s1-multiplayer-survival-series-world-download_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5614/The-RealmV2.mcworld"}],"uploadedBy":"ItsAlphoenixYT","uploadedAt":"30 Apr, 2020","supporteds":["1.13","1.14"],"originUrl":"https://mcpedl.com/the-realm-s1-multiplayer-survival-series-world-download/"},{"title":"Escape The Bloody Apartment (Horror)","briefDescription":"This Escape the Bloody Apartment is a hard game because many mobs or monsters are spawning everywhere and this game has a large building. This ...","Description":"","crawledImageUrls":[{"text":"This Escape the Bloody Apartment is a hard game because many mobs or monsters are spawning everywhere and this game has a large building. This game is for those who like a thrill , because this game is more challenging and more exciting but its a little bit scary. The game is on Hard level.\nHow to play? It?s easy, just finish the game without dying and be alert because this is a hard game. This game is a Multiplayer playable, The game mode is set to Adventure mode, weather Thunder and Time set to midnight.\nRules: Do not cheat, there is no thrill if you cheat\nThis game Escape The bloody hospital is a Alert game which strategy is the number 1 key to finish the game.\nCredits the building to the owner thanks.\n","url":"https://my.mcpedl.com/storage/worlds/5549/images/escapr-the-bloody-apartment_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/escapr-the-bloody-apartment_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5549/EscapeTheApartment.mcworld"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fraboninco.com%2FP0iu\u0026post_id\u003d143967"}],"uploadedBy":"Mr Seanyy PH","uploadedAt":"27 Apr, 2020","supporteds":["1.12","1.13","1.14","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/escape-the-bloody-apartment-horror/"},{"title":"Simple Survival Cabins","briefDescription":"Don\u0027t want to start a survival world with nothing? Don\u0027t like building bases? Well, do I have a world for you! Simple Survival Cabins includes ...","Description":"","crawledImageUrls":[{"text":"Don?t want to start a survival world with nothing? Don?t like building bases? Well, do I have a world for you! Simple Survival Cabins includes a main base with all the basic necessities and more!\nSimple Survival Includes:\n-A main house with multiple furnaces, all tools, a full set of leather armour, a bed, a double chest, a single chest on the second floor, and some other special resources.\n-A storage house that has four double chests.\n-A dock connected to a nearby river with a boat.\n-A nearby village.\nHere are some photos of the world:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_2.png"},{"text":"The first floor of the main house:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_3.png"},{"text":"The second floor of the main house:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_4.png"},{"text":"The storage house:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_5.png"},{"text":"The inside of the stroage house:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_6.png"},{"text":"The docks connected to the river:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_7.png"},{"text":"There is a village not to far just across the river:\n","url":"https://my.mcpedl.com/storage/worlds/5465/images/simple-survival-cabins_8.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/simple-survival-cabins_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5465/Simple-Survival-Cabins.mcworld"}],"uploadedBy":"noblais","uploadedAt":"25 Apr, 2020","supporteds":["1.14"],"originUrl":"https://mcpedl.com/simple-survival-cabins/"},{"title":"Lumber Simulator (Sneak Peek)","briefDescription":"Do you want to play a simulation game in minecraft? You are now in right place download it play lumber simulator. This game is need 4 ...","Description":"","crawledImageUrls":[{"text":"Do you want to play a simulation game in minecraft? You are now in right place download it play lumber simulator.\nThis game is need 4 players, invite friends and have fun. You need to take a log in trees and go to shop to sell it to earn money. Buy some axe and upgrade it for easily working. In early you this is hard but if you are rich. Buy plots to build your creation like houses,and buy some blocks\nThis game is not finish just a sneak peek.\nDon?t worry i will finish it. I you find some bug or not working command just comment below. Thank you download it right now i hope you like it\nCREATOR: TREBLEMAKER127\n","url":"https://my.mcpedl.com/storage/worlds/5210/images/lumber-simulator-sneak-peek_6.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5210/images/lumber-simulator-sneak-peek_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5210/images/lumber-simulator-sneak-peek_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5210/images/lumber-simulator-sneak-peek_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/lumber-simulator-sneak-peek_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5210/LUMBER-SIMULATOR.mcworld"},{"href":"https://www.mediafire.com/download/czhp1v738sdqiwm"}],"uploadedBy":"Treblemaker127","uploadedAt":"21 Apr, 2020 (Updated)","supporteds":["1.14","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/lumber-simulator-map/"},{"title":"Escape The Bloody Hospital: Hard Edition (Horror)","briefDescription":"This Escape the bloody hospital is a hard game, which you will encounter Zombie , Skeleton , Spider inside the Hospital. You need to escape before your ...","Description":"","crawledImageUrls":[{"text":"This Escape the bloody hospital is a hard game, which you will encounter Zombie , Skeleton , Spider inside the Hospital. You need to escape before your life ends.This game is a single player playable which only one player is allowed.Monsters is could be around the hospital.This game is really dark,the weather of the game is thunder.\nHow To Play? It?s easy , you just need to escape the hospital and survive, you need to do a strategic mind to finish the game or else you?ll die. Gamemode is in Adventure Mode.Survive the game or your going back at the starting point. Rules: Do not commit cheat. Cheating is not allowed in this game. Why This Game is bloody? because this game is hard , second this game can kill your character and restart again.\nI hope you like it guys? GoodLuck!!\n","url":"https://my.mcpedl.com/storage/worlds/5208/images/escape-the-bloody-hospitalhard-edition_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/escape-the-bloody-hospitalhard-edition_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5208/EscapeTheBloodyHospital.mcworld"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fraboninco.com%2FGc02\u0026post_id\u003d143008"}],"uploadedBy":"Mr Seanyy PH","uploadedAt":"16 Apr, 2020 (Updated)","supporteds":["1.12","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/escape-the-bloody-hospital-hard-edition-horror/"},{"title":"Large Village In The Mountain","briefDescription":"Searching a new home? With beautiful Minecraft world view? In a nice luxury villa in a mountain? In the valley of a lovely river? With 3 ...","Description":"","crawledImageUrls":[{"text":"Searching a new home? With beautiful Minecraft world view? In a nice luxury villa in a mountain? In the valley of a lovely river? With 3 swimming pool, 9 rooms and 3 bathrooms? Check this stuff..!\n","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_6.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_8.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_9.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_10.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_11.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_12.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_13.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_14.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_15.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_16.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_17.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5223/images/large-villa-in-the-mountain_18.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/large-villa-in-the-mountain_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5223/Mountainvilla_1587059611.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5223/Mountainvilla.zip"}],"uploadedBy":"Nolwen361","uploadedAt":"16 Apr, 2020","supporteds":["1.10","1.11","1.12","1.13","1.14","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/large-village-in-the-mountain/"},{"title":"The Floor Is Lava: Hard Edition","briefDescription":"This Game is Hard, there is no spawnpoint if you die, this game is continuos/you need to finish the game without getting killed or ...","Description":"","crawledImageUrls":[{"text":"This Game is Hard, there is no spawnpoint if you die, this game is continuos/you need to finish the game without getting killed or falling in the lava\nHow To Play? It?s easy , jump all the objects, do not die and finish the game\nRules: Do not commit to cheat, cheats are not allowed\nGameplay: Multiplayer is playable, The game is in Adventure Mode, use the button to move or jump.\nThe Game is really hard, it has fences,glasses,quarts and cobblestone wall on it.\nThis game is more familiar in obby, but this game has no spawnpoint\nI hope you like it?\n","url":"https://my.mcpedl.com/storage/worlds/5143/images/thefloorislavahardedition_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/thefloorislavahardedition_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5143/floorislava_1586894592.mcworld"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Fraboninco.com%2FF7Da\u0026post_id\u003d142713"}],"uploadedBy":"Mr Seanyy PH","uploadedAt":"14 Apr, 2020 (Updated)","supporteds":["1.10","1.14","1.15 (beta)","1.16","1.7","1.9"],"originUrl":"https://mcpedl.com/the-floor-is-lava-hard-edition/"},{"title":"ChunkGame (v1)","briefDescription":"Have you ever thought about adventure in one chunk? If so, you\u0027ve come to the right place! Download my map and start your adventure! This ...","Description":"","crawledImageUrls":[{"text":"Have you ever thought about adventure in one chunk? If so, you?ve come to the right place! Download my map and start your adventure!\nThis is the first part of the map. Another one will be created soon?\nThe map was built for 25 hours! Write me how you played it! The map was created by a veteran Minecraft\nDo you like flying in the clouds? If so, that?s good. Spawn is the flying island * WoW\n","url":"https://my.mcpedl.com/storage/worlds/5009/images/chunkgamev1_2.png"},{"text":"Be careful not to fall!\nClick the button to magically move to an island the size of one Chunk. *WoW*\nOn the tip you will find custon trees, river diamonds, iron and much more.\n","url":"https://my.mcpedl.com/storage/worlds/5009/images/chunkgamev1_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5009/images/chunkgamev1_4.png"},{"text":"Remember to follow the rules.\n","url":"https://my.mcpedl.com/storage/worlds/5009/images/chunkgamev1_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/chunkgamev1_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5009/ChunkGame_1586456133.mcworld"}],"uploadedBy":"SquarePixelsStudio","uploadedAt":"9 Apr, 2020 (Updated)","supporteds":["1.13"],"originUrl":"https://mcpedl.com/chunkgame-map/"},{"title":"Acrait Acres","briefDescription":"This map focuses on the simpler pleasures of Minecraft: farming, fishing, and trading with friendly villagers. You spawn before a small cabin where you\u0027ll start ...","Description":"","crawledImageUrls":[{"text":"This map focuses on the simpler pleasures of Minecraft: farming, fishing, and trading with friendly villagers.\nYou spawn before a small cabin where you?ll start your farming journey.\nInspired by Stardew Valley!\nSince the map focuses on farming, you will be given a few tools and seeds in the beginning to expand your farm. Visit the villagers and trade with them in a upgraded village!\nThe world offers you a home, a mine, a lake, a village, and a few hidden secrets.\n","url":"https://my.mcpedl.com/storage/worlds/4931/images/acrait-acres_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4931/images/acrait-acres_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4931/images/acrait-acres_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4931/images/acrait-acres_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4931/images/acrait-acres_6.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4931/images/acrait-acres_7.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/acrait-acres_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/4931/Acrait-Acres_1586023517.mcworld"}],"uploadedBy":"righturns","uploadedAt":"5 Apr, 2020","supporteds":["1.14"],"originUrl":"https://mcpedl.com/acrait-acres/"},{"title":"Tall Mobs Skyblock","briefDescription":"A selection of mobs have grown REALLY TALL! Wait... SO HAS THE SKYBLOCK! In Tall Mobs Skyblock, reach for the sky in this really tall ...","Description":"","crawledImageUrls":[{"text":"A selection of mobs have grown REALLY TALL! Wait? SO HAS THE SKYBLOCK! In Tall Mobs Skyblock, reach for the sky in this really tall world. Featuring all the goods a typical skyblock needs including end portal, you?re all set to survive the night away.\nFeatures:\n","url":"https://my.mcpedl.com/storage/worlds/4860/images/tall-mobs-skyblock_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4860/images/tall-mobs-skyblock_3.png"},{"text":"If you?re interested to see more serious/less jokey content by me, visit www.jigarbov.net for more cool Minecraft stuff? Want to support me? Head over to the Minecraft Marketplace where I do much more than small maps like this including huge adventures and more! Just search for ?Jigarbov?\n","url":"https://my.mcpedl.com/storage/worlds/4860/images/tall-mobs-skyblock_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/tall-mobs-skyblock_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/4860/Tall-Mobs-Skyblock_1585717239.mcworld"}],"uploadedBy":"jigarbov","uploadedAt":"1 Apr, 2020","supporteds":["1.14"],"originUrl":"https://mcpedl.com/tall-mobs-skyblock/"},{"title":"Mushroomland Adventure","briefDescription":"Spawning on a small island in the middle of the ocean, your mission will be to find a house with the basics and survive in ...","Description":"","crawledImageUrls":[{"text":"Spawning on a small island in the middle of the ocean, your mission will be to find a house with the basics and survive in this place.\nYou are welcome, small and noble adventurer, to this small but huge world, where the laws of physics and biology do not apply.\nFor some strange but disturbing reason you are the only ?human? inhabitant of this place.\nThis wonderful and magical world is tormented by the forces of darkness, which threaten to consume and torment everything that comes in their way.\nYour mission is simply to survive and explore this wonderful world, while defeating the dangerous creatures of the night.\nDo you think you can handle that?\nDo you think you can survive in the face of these dangerous creatures?\nLet?s hope so? Don?t worry, we wish you good luck.\nYou will appear in a small island in the middle of the ocean, where you will find insufficient resources to start (XP), so you will have to swim around the ocean looking for its surroundings until you find a ?small? mushroom-cow island.\n","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure-by-blockhunter66620_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure-by-blockhunter66620_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure-by-blockhunter66620_4.png"},{"text":"When you reach the island you will have to look for a small house that contains two chests, these contain basic items to start exploring.\n","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure-by-blockhunter66620_5.png"},{"text":"The two chests contain:\n? Wooden tools as well as a wooden sword to protect you.\n? A being of full leather armor to protect you.\n? Charcoal and other items that will serve you in your adventure.\nYou will have a bed, oven and table of creation.\nSearching through the caves you will find many caves, in one cave you will find near the entrance a spawner of normal spiders, which will serve you to obtain thread and spider eyes for potions.\n","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure_2.png"},{"text":"For more fun, two villages were added, on the edge of the island.\n","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure_3.png"},{"text":"In a nearby forest, a tower has been added to serve as a boss, in which you will find chests with rewards to continue your adventure.\n","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/4441/images/mushroomland-adventure_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/04/mushroomland-adventure-by-blockhunter66620_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/4441/mushroomland_by_block_hunter666_2.0_v1.0.zip"},{"href":"https://dl.mcpedl.com/worlds/4441/mushroomland_by_block_hunter666_2.0.mcworld"},{"href":"https://dl.mcpedl.com/worlds/4441/mushroomland_adv_by_block_hunter666_2.0_v0.2.zip"},{"href":"https://drive.google.com/folderview?id\u003d1-aLYI6aCrO26tvhv6beSfpy47MonbzhM"}],"uploadedBy":"block_hunter666_2.0","uploadedAt":"9 Mar, 2020 (Updated)","supporteds":["1.14","1.6"],"originUrl":"https://mcpedl.com/mushroomland-adventure/"}]