[{"title":"Swoogo?s Kit PvP World","briefDescription":"This is a Medium size kit pvp map that was used on the popular Swoogo\u0027s Kit PvP Realm. This is the fourth map used on ...","Description":"","crawledImageUrls":[{"text":"This is a Medium size kit pvp map that was used on the popular Swoogo?s Kit PvP Realm. This is the fourth map used on his realm and it is now free to use by anyone else.\nFeel free to play with your friends and use on your own realm only if you credit Swoogo!\n","url":"https://my.mcpedl.com/storage/worlds/10525/images/swoogos-kit-pvp-world_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/10525/images/swoogos-kit-pvp-world_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/swoogos-kit-pvp-world_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10525/3Swoogos-clKit-PvP_1608050400.mcworld"}],"uploadedBy":"Swoogo","uploadedAt":"16 Dec, 2020","supporteds":["1.10","1.11","1.12","1.13","1.14","1.15 (beta)","1.16","1.16.100","1.16.101","1.16.200","1.16.210 (beta)","1.6","1.7","1.8","1.9"],"originUrl":"https://mcpedl.com/swoogos-kit-pvp-world/"},{"title":"30x30x30 Redstone Computer!","briefDescription":"This is a 30x30x30 computer challenge that i have created in Minecraft Bedrock Edition. This computer can run simple programs like the Fibonacci sequence ...","Description":"","crawledImageUrls":[{"text":"This is a 30x30x30 computer challenge that i have created in Minecraft Bedrock Edition. This computer can run simple programs like the Fibonacci sequence as well as send data out the included I/O to I/O devices such asa display or Hard drive. This computer is already linked up to a display so you can see the output.\n","url":"https://my.mcpedl.com/storage/worlds/10125/images/30x30x30-redstone-computer_2.png"},{"text":"This is a challenge that I undertook in honour of N00b_asaurus 40x40x40 computer that he built on Minecraft Java Edition. I have built it all on Bedrock Edition lol.\nThis computer is 30x30x30 and entirely built by me with my own custom parts.\nThis includes a 7 segment display connected up to the computer through the I/O\n","url":"https://my.mcpedl.com/storage/worlds/10125/images/30x30x30-redstone-computer_3.png"},{"text":"There is a version on this world without the case so you can see inside clearly.\n","url":"https://my.mcpedl.com/storage/worlds/10125/images/30x30x30-redstone-computer_4.png"},{"text":"Some of the commands and ALU functions\n","url":"https://my.mcpedl.com/storage/worlds/10125/images/30x30x30-redstone-computer_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/30x30x30-redstone-computer_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10125/The-C-U-B-E_1606073554.mcworld"},{"href":"http://www.mediafire.com/file/wnn3e8658zke26n/The_C_U_B_E.mcworld/file"}],"uploadedBy":"TheDarkness344","uploadedAt":"24 Nov, 2020 (Updated)","supporteds":["1.10","1.11","1.12","1.13","1.14","1.15 (beta)","1.16","1.16.100","1.6","1.7","1.8","1.9"],"originUrl":"https://mcpedl.com/30x30x30-redstone-computer/"},{"title":"Ftere?s Non Geometry Map","briefDescription":"Old:This is my first map please don\u0027t judge me. I play on mcpe 1.16.0.58 and it works. I have used the warped buttons and signs....","Description":"","crawledImageUrls":[{"text":"Old:\nThis is my first map please don?t judge me. I play on mcpe 1.16.0.58 and it works. I have used the warped buttons and signs.\nIt is created with command blocks, ask me if you want a tutorial.\nI created a little room full of strange things. Will you discover them all?\nNew\nIt works fine for me in 1.16.100, but it should work on older versions too?\nWrite in comments what I should add.\nIn my version addons that adds blocks doesn?t work and the map Is totally functional without any resource pack.\nIn the map you will try to escape from a strange laboratory where you are imprisoned, good luck!\n","url":"https://my.mcpedl.com/storage/worlds/5342/images/fteres-non-geometry-map_3.png"},{"text":"this is the start, the map for now is very small but I will update it often.\nPlease leave credits, and, if you wont, you can make a video and post it on YouTube.\nIn this map were used much command blocks for create: an infinite loop, a teleporting door, an unlimited succession of rooms, a flat staircase, another teleporting door (compressed)? I will add more in future. If you like it support me. In the 0.0.3 update I added the red version: everything will have a red theme. In the 0.0.4 I added a big part of the map and a little bit lore! For now, there isn?t an ending! ? But I will add it soon! In this map you will find a building of quartz, that I will expand in every update. ?Actually you start in an area where there are three rooms, if you go left you will see the ending but not how to reach it, of you go into the second room you will be teleported in the first. You will enter in a room with a glass floor and go down. There are a lot of features that you can discover. I excuse me, but for add a lore i created a troll. There is only one jump and it?s impossible! I hope you like it, enjoy. I added a Little part of the map, where you should click a lever ti open the path.\n","url":"https://my.mcpedl.com/storage/worlds/5342/images/fteres-non-geometry-map_9.png"},{"text":"Hello, it?s me again. I played with Dragekk a lot and made a complete remake of the map, using the clone command and not the tp one I hope you will enjoy the new map.\n","url":"https://my.mcpedl.com/storage/worlds/5342/images/fteres-non-geometry-map_10.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/fteres-non-geometry-map_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5342/Fteres_non_geometry_map_1605948435.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5342/Fteres_non_geometry_map_1605948435.zip"},{"href":"https://dl.mcpedl.com/worlds/5342/Fteres-non-geometry-map_1587919445.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5342/Fteres-non-geometry-map_1587919445.zip"}],"uploadedBy":"Ftere","uploadedAt":"28 Apr, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/fteres-non-geometry-map/"},{"title":"Bedrock Multi Use Ultimate Super Smelter!","briefDescription":"I present to you my ultimate super smelter! You can smelt any item you wish in mass production or mass produce a selection of different ...","Description":"","crawledImageUrls":[{"text":"I present to you my ultimate super smelter! You can smelt any item you wish in mass production or mass produce a selection of different items. All of these outputs (smelted items) will be categorised and sorted beneath the machine itself. Every item that you can possibly smelt has two huge storage units for itself. A few more units for items such as gold, diamond, redstone, iron etc so the storage unit wont overflow with your most smelted items! All of the storage units are directly accessible from the outside of the machine, for instant access. There is a platform that has the top furnaces input loaders.\nThese are the barrels, which all you have to do is fill it up, pull the lever and watch the items fly up the tube and into the machine! The bottom furnaces all have the same sort of system, its just built inside the machine itself, almost factory like. Also on the platform is one single button, to add a TON of fuel to the machine and keep it powering on! This can be done manually via the button is mentioned, or can be activated with a lever to make the sweeper go back and fourth at timed intervals! It has 45 loaders for the fuel system, which all have their own light to indicate whether it is unloading fuel into the machine or not. There is also two levers. One for the top furnaces to power them on, and one for the bottom furnaces to power them on. Each floor has 10 furnace systems, altogether 20!\nI hope you enjoy this build, and any recommendations/suggestions would be appreciated.\nAculos.\n","url":"https://my.mcpedl.com/storage/worlds/9513/images/bedrock-multi-use-ultimate-super-smelter_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-multi-use-ultimate-super-smelter_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9513/Bedrock-Ultimate-Super-Smelter_1603278487.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"22 Oct, 2020","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-multi-use-ultimate-super-smelter/"},{"title":"Bedrock Multi Use Production Centre/Infinite Super Smelter","briefDescription":"Hi all, this is my infinite fuel super smelter. With just a few pulls on a lever and a few pushes of a button, this ...","Description":"","crawledImageUrls":[{"text":"Hi all, this is my infinite fuel super smelter. With just a few pulls on a lever and a few pushes of a button, this factory/production centre will produce anything you wish to cook up! To add fuel, just simply press the button at the top for both sweepers and it will collect a ton of fuel for you!\nIt will even filter it through the system and keep topping up the chests for the auto furnace and smelter.. well theres 2 actually and 2 mni melon and pumpkin farms also being filtered through the system to be stored underneath. This build looks chaotic but i assure you, its noob proof ?\nRecommend tick speed to be on 10 for better production rates! Both storage systems are linked together, so if there is no space or even item in the first one, the second one will be there for you! To fill up the furnaces, simply just drop your item of choice into the 2 dispensers, pull the lever and watch your ores (or whatever your smelting) fly up the tube and into the machine! Hope you enjoy this creation and please let me know of any suggestions. Aculos out!\n","url":"https://my.mcpedl.com/storage/worlds/9434/images/bedrock-multi-use-production-centreinfinite-super-smelter_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-multi-use-production-centreinfinite-super-smelter_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9434/Bedrock-Factory-Farm_1602928149.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"17 Oct, 2020","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-multi-use-production-centre-infinite-super-smelter-map/"},{"title":"Bedrock Auto Sweeping Bamboo Farm","briefDescription":"This is my bamboo farm I have been working on. When i get a bit tired of doing terrains, i put bits of time together ...","Description":"","crawledImageUrls":[{"text":"This is my bamboo farm I have been working on. When i get a bit tired of doing terrains, i put bits of time together to create this! Apologies it took so long, but here it is! This bamboo farm massively produces bamboo (Very great for using as fuel inside a furnace.. Maybe inside my Auto Furnace and Smelter!) It has a huge storage system for the bamboo underneath of the farm, it is very much needed! I filled up a whole double chest in one run of the sweeper, so i am very happy with this creation. Signs on to advise how to use it, its pretty simple. I also put lamps on it so you know when the loaders have stopped loading ?\nHope you enjoy it and please give me suggestions! Aculos out!\n","url":"https://my.mcpedl.com/storage/worlds/9383/images/bedrock-auto-sweeping-bamboo-farm_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-auto-sweeping-bamboo-farm_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9383/Bedrock-Auto-Sweeping-Bamboo-Farm_1602675116.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"15 Oct, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/bedrock-auto-sweeping-bamboo-farm-map/"},{"title":"Linear Graph Plotting Computer!","briefDescription":"This is a computer that i have created to plot linear line graphs. It works by using the equation y\u003dmx+c where y is ...","Description":"","crawledImageUrls":[{"text":"This is a computer that i have created to plot linear line graphs. It works by using the equation y\u003dmx+c where y is the y axis, x is the x-axis, m is the line gradinent (how much it increments x by) and c is the y-intercept or offset value.\nThis means if you input an equation for a line and start the computer, it calculates points on the graph and displays them on a 16 by 16 redstone lamp display.\nThis computer has 13 lines of code, 1.5 bytes or 3 cells of ram and a 4 bit adder and 3 bit multiplier ALU to power it.\n","url":"https://my.mcpedl.com/storage/worlds/9283/images/linear-graph-plotting-computer_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/linear-graph-plotting-computer_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9283/AX344-Graphing-Computer_1602181272.mcworld"},{"href":"http://www.mediafire.com/file/gs3n2ukvblab06x/AX344+Graphing+Computer.mcworld/file"}],"uploadedBy":"TheDarkness344","uploadedAt":"9 Oct, 2020","supporteds":["1.10","1.11","1.12","1.13","1.14","1.15 (beta)","1.16","1.16.100","1.6","1.7","1.8","1.9"],"originUrl":"https://mcpedl.com/linear-graph-plotting-computer/"},{"title":"Bedrock Auto Furnace and Smelter","briefDescription":"This is my last upload today as im in progress of some custom terrains! But here it is, the automatic furnace and smelter! it is ...","Description":"","crawledImageUrls":[{"text":"This is my last upload today as im in progress of some custom terrains! But here it is, the automatic furnace and smelter! it is crazily fast and has tons of storage underneath. I put gold ores in it and was producing 2 gold every second! so yh, you do the math ? Just fill this up with coal and your block of choice for smelting and sit back and relax while this does the hard work for you! Enjoy!\n","url":"https://my.mcpedl.com/storage/worlds/9274/images/bedrock-auto-furnace-and-smelter_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-auto-furnace-and-smelter_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9274/Bedrock-Auto-Furnace-and-Smelter_1602141319.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"9 Oct, 2020","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-auto-furnace-and-smelter-map/"},{"title":"Bedrock Multi Floor Elevator","briefDescription":"I thought one upload wasnt enough today.. might even upload another after this. But anyway, here it is, the multi floor elevator with a built ...","Description":"","crawledImageUrls":[{"text":"I thought one upload wasnt enough today.. might even upload another after this. But anyway, here it is, the multi floor elevator with a built in button to call the elevator up to your floor! Had to make out of iron due to redstone issues, so my usual crying obsidian isnt there as much :\u0027( but im happy with the result never the less! Enjoy ?\n","url":"https://my.mcpedl.com/storage/worlds/9273/images/bedrock-multi-floor-elevator_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-multi-floor-elevator_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9273/Bedrock-Multi-Floor-Elevator_1602140913.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"8 Oct, 2020","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-multi-floor-elevator-map/"},{"title":"Bedrock Auto Chicken Farm","briefDescription":"This chicken farm produces quite a lot of cooked chicken and feathers that will be sorted into their own chests according to what it is.. ...","Description":"","crawledImageUrls":[{"text":"This chicken farm produces quite a lot of cooked chicken and feathers that will be sorted into their own chests according to what it is.. thought id save you the trouble! You dont even have to turn this bad boy on, just download, import and your off! Would be bigger and more output but due to lag issues, i wouldnt recommend it. Enjoy anyway!\n","url":"https://my.mcpedl.com/storage/worlds/9272/images/bedrock-auto-chicken-farm_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-auto-chicken-farm_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9272/Bedrock-Chicken-Farm_1602140540.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"8 Oct, 2020 (Updated)","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-auto-chicken-farm-map/"},{"title":"Bedrock Iron Farm","briefDescription":"I made this iron farm because every single one i found had trouble spawning iron golems.. not with this bad boy! I have used commands ...","Description":"","crawledImageUrls":[{"text":"I made this iron farm because every single one i found had trouble spawning iron golems.. not with this bad boy! I have used commands blocks to spawn them, was fed up with villagers and beds and blah blah blah. Very fast rate of production and no iron golem overflow!\n","url":"https://my.mcpedl.com/storage/worlds/9228/images/bedrock-iron-farm_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-iron-farm_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9228/Bedrock-Iron-Farm_1601916215.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"6 Oct, 2020","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-iron-farm/"},{"title":"Bedrock Infinite XP Farm","briefDescription":"This is my creation of an infinite XP farm, to earn the most XP i could push out of it! All you have to do ...","Description":"","crawledImageUrls":[{"text":"This is my creation of an infinite XP farm, to earn the most XP i could push out of it! All you have to do is turn it on, then flick both levers next to furnace. when you collect green dye from chests, lots of XP will be given, and it just keeps spitting XP out!\n","url":"https://my.mcpedl.com/storage/worlds/9229/images/bedrock-infinite-xp-farm_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-infinite-xp-farm_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9229/Bedrock-Infinite-XP-Farm_1601917207.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"6 Oct, 2020","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-infinite-xp-farm-map/"},{"title":"My Redstone Smart House? V2 [Redstone]","briefDescription":"An improvement to the fan favourite My Redstone Smart House I introduce to you... My Redstone Smart House V2!! Achievements edition, bigger, better, improved, and ...","Description":"","crawledImageUrls":[{"text":"An improvement to the fan favourite My Redstone Smart House I introduce to you? My Redstone Smart House V2!! Achievements edition, bigger, better, improved, and now in survival! Filled with many new contraptions, and a new nether, this Smart Mansion is ready and waiting for you and all the adventures you will go on!\nThis map features a big mansion which is suitable for all kinds of adventures where you need somewhere safe to stay. There is one master bedroom (with 8 beds combined) and lots of different redstone mechanisms which will greatly improve your standards of living. Outside you will also find multiple different types of automatic farms. You could literally stay within the boundaries of your property and still survive for a long time. Creator: DireWolf314159\n","url":"https://my.mcpedl.com/storage/worlds/176/images/my-redstone-smart-house-v2-redstone_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/my-redstone-smart-house-v2-redstone_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/176/My-Redstone-Smart-House-V2.zip"},{"href":"http://www.mediafire.com/file/cdmp8a7tzvl3r2k/My_Redstone_Smart_House_V2.zip/file"},{"href":"http://www.mediafire.com/file/02ka9b61vs3g9ut/My_Redstone_Smart_House_V2.mcworld/file"}],"uploadedBy":"DireWolf314159","uploadedAt":"28 Mar, 2017 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/my-redstone-smart-house-map/"},{"title":"Bedrock Pumpkin and Melon Farm (Auto AFK)","briefDescription":"Hi again, as i previously made an item sorting system for this awesome platform, i had a suggestion to make a few farms etc. So ...","Description":"","crawledImageUrls":[{"text":"Hi again, as i previously made an item sorting system for this awesome platform, i had a suggestion to make a few farms etc. So i had a play around and was happy with the result of a pretty fast auto afk pumpkin and melon farm. I also added an option i rather liked, a double hopper system for double the loading speed! One is just boring! Well its more than that, it actually has eight modules and a built in storage system for top layers and instant access to bottom layers! Enjoy and please let me know of any more suggestions. Iron farm coming soon.\n","url":"https://my.mcpedl.com/storage/worlds/9146/images/bedrock-pumpkin-and-melon-farm-auto-afk_8.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-pumpkin-and-melon-farm-auto-afk_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9146/Bedrock-Pumpkin-and-Melon-Farm_1601633197.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"3 Oct, 2020 (Updated)","supporteds":["1.11","1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/bedrock-pumpkin-and-melon-farm-auto-afk/"},{"title":"Bedrock Item Sorting System","briefDescription":"This is a sorting system i designed for bedrock edition of Minecraft as all others i found either didnt work properly, too small or not ...","Description":"","crawledImageUrls":[{"text":"This is a sorting system i designed for bedrock edition of Minecraft as all others i found either didnt work properly, too small or not to my satisfaction. It worked that well, and looks rather appealing, that i had to share for people who have had similar obstacles i ran into.\n","url":"https://my.mcpedl.com/storage/worlds/9126/images/bedrock-item-sorting-system_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/10/bedrock-item-sorting-system_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9126/Bedrock-Item-Sorting-System_1601474829.mcworld"}],"uploadedBy":"Aculos","uploadedAt":"1 Oct, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/bedrock-item-sorting-system/"},{"title":"Minecraft Testing For Commands","briefDescription":"This is a world for people who like to build command contraptions. it has a save area and build area!!! The build area has a 14 ...","Description":"","crawledImageUrls":[{"text":"This is a world for people who like to build command contraptions. it has a save area and build area!!! The build area has a 14 x 14 build space and 20 save slots. go ahead and download it for yourself.\n","url":"https://my.mcpedl.com/storage/worlds/8916/images/minecraft-testing-for-commands_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/minecraft-testing-for-commands_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/8916/bCommand-eTesting-cWorld_1600374596.mcworld"}],"uploadedBy":"TAGCB","uploadedAt":"18 Sep, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/minecraft-testing-for-commands/"},{"title":"Basalt Tunnel Bore","briefDescription":"This is my first submission to mcpedl. This is the recreation of Mumbo Jumbo\u0027s Basalt Tunnel Bore.If you\u0027ve seen the video you should know ...","Description":"","crawledImageUrls":[{"text":"This is my first submission to mcpedl. This is the recreation of Mumbo Jumbo?s Basalt Tunnel Bore.\nIf you?ve seen the video you should know what this does, but to avoid some headaches of creating a flying machine half under lava lake, I used something that Mumbo is very jealous of?\nI?m an amateur redstoner and also a part time builder. But when there?s nothing to do, I tried to build one of these. Took about 2 weeks to get used to and this is not the first one, this is like the fifth but by far this is the most painful to design.\n","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_3.png"},{"text":"Here it is in all of its glory:\n","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_5.png"},{"text":"Tunnel design system (I made that up):\n","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_6.png"},{"text":"Here you can see that I used 2 basalt generators for the top and bottom half.\n","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_7.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/8892/images/basalt-tunnel-bore_8.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/basalt-tunnel-bore_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/8892/Basalt-Tunnel-Bore.mcworld"},{"href":"https://dl.mcpedl.com/worlds/8892/Basalt-Tunnel-Bore.zip"}],"uploadedBy":"Mark24","uploadedAt":"17 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/basalt-tunnel-bore/"},{"title":"Black Lake Camp (Hide \u0026 Seek)","briefDescription":"Black Lake Camp is a new hide \u0026 seek map. The goal of the hider is to hide in the Black Lake Camp away from the ...","Description":"","crawledImageUrls":[{"text":"Black Lake Camp is a new hide \u0026 seek map. The goal of the hider is to hide in the Black Lake Camp away from the seeker. The seeker is released is 1 minute after the game starts. The seeker?s mission is to kill all the hiders, if you really want you can set your own timer and when that timer ends the players that are left over have won.\nScreenshots:\n","url":"https://my.mcpedl.com/storage/worlds/8861/images/black-lake-camp--hide--seek-_2.png"},{"text":"There Are 7 Different Places To Hide:\n1. Cave\n2. Camp Site\n3. Camp Fire\n4. Toilet\n5. Forest\n6. House\n7. Lake\nThis Is Where The Hiders Run Out Of:\n","url":"https://my.mcpedl.com/storage/worlds/8861/images/black-lake-camp--hide--seek-_3.png"},{"text":"In Between The Lake And Cave:\n","url":"https://my.mcpedl.com/storage/worlds/8861/images/black-lake-camp--hide--seek-_4.png"},{"text":"Camp Site:\n","url":"https://my.mcpedl.com/storage/worlds/8861/images/black-lake-camp--hide--seek-_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/black-lake-camp-hide-seek_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/8861/Black-Lake-Camp-Hide--Seek_1600045254.mcworld"}],"uploadedBy":"Kayy","uploadedAt":"14 Sep, 2020 (Updated)","supporteds":["1.12","1.13","1.14","1.16"],"originUrl":"https://mcpedl.com/black-lake-camp-hide-seek/"},{"title":"7 Overpowered Swords (No Mods, No Add-On)","briefDescription":"Welcome to 7 Overpowered Swords, basically this is working with 100% Command BlocksThis is having Web Sword, Lightning Sword, Spin Sword, Ice Sword, Fire Sword, TNT Sword ...","Description":"","crawledImageUrls":[{"text":"Welcome to 7 Overpowered Swords, basically this is working with 100% Command Blocks\nThis is having Web Sword, Lightning Sword, Spin Sword, Ice Sword, Fire Sword, TNT Sword and the WITHER Sword\n#7 OP Swords\nFirst is the ?Web Sword? ? That can trap/slow the enemy in the cobweb a useful sword right?\nBut it is not working in to the players : (\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_2.png"},{"text":"Second is the ?Lightning Sword? ? That can summon/struck a mob by lightning bolt what a super op sword, but becareful don?t use this in to the Pigs, Villager, Or Creeper or otherwise they?ll will transform into a Zombified Piglin, Witch, And Charged Creeper so becareful\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_3.png"},{"text":"Third is the ?Spin Sword? ? That can teleport the mobs near to you but, they?ll is spinning so you can easily kill them all little bit useful right?, but NOT the all mobs in the world is will teleporting near to you, only that in radius 10 that will teleport near to you\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_4.png"},{"text":"Fourth is the ?Ice Sword? ? That can trap/freeze the all mobs in the ice in radius 10 only but it is not working in players, this is useful when you at a bad situation (theres a horde of creepers) just use this and then boom they all gonna trap in the ice lol\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_5.png"},{"text":"Fifth is the ?Fire Sword? ? That can trap a any mobs (execept for flying mobs) in a pit of a fire, however when you use this in a big slime he will not trap because he is so big\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_6.png"},{"text":"Sixth is the ?TNT Sword? ? That can summon tnt and blow up the mobs near you but becareful if that sword is start to summon just run far away or else the tnt is gonna hurt you so becareful\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_7.png"},{"text":"And the last one is the ?WITHER Sword? ? That can give any mobs near to you an wither effect 5 with 60 seconds, the mobs will no escape in this sword they?ll DIE, however this is not working in the players only for mobs, the boss like a ender dragon and wither is immune in this effect so they will not affect with this effect\n","url":"https://my.mcpedl.com/storage/worlds/8110/images/7-overpowered-swords-no-mods-no-addon_8.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/7-overpowered-swords-no-mods-no-addon_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/8110/sword_.mcworld"},{"href":"https://www.mediafire.com/download/awzg1qa5513cxa3"}],"uploadedBy":"ItzJrPlayzYT","uploadedAt":"12 Aug, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/7-overpowered-swords-map/"},{"title":"Ultimate Minecraft Masters","briefDescription":"Complete these 7 levels and kill the ender dragon to win. In this world, you have to pass 7 different levels and you can do it with ...","Description":"","crawledImageUrls":[{"text":"Complete these 7 levels and kill the ender dragon to win. In this world, you have to pass 7 different levels and you can do it with endless friends. It doesn?t need any mod.Good luck!!!!\nIn this world, you have to pass different levels to complete it!\nWe recommend to play with 5 players, but if you want you can do it with more!\nYou don?t need any mod!\nIn this find level, you have to find a button, but to find it you have some parkour\nAt this level, you have to pass all the lava because there are invisible blocks in there.\nSee the roof!\n","url":"https://my.mcpedl.com/storage/worlds/8671/images/ultimate-minecraft-masters_3.png"},{"text":"This labyrinth has a mob that chases you to the end. Run!!!\nThis level is a choose the right door. There aren?t any questions, just your luck\n","url":"https://my.mcpedl.com/storage/worlds/8671/images/ultimate-minecraft-masters_5.png"},{"text":"A complex Redstone mechanism is going to push you to the lava. But if you are fast you can pass and complete it\nThis is the last and more difficult level. First, you have to collect all the resources while you fight with monsters. When you are ready, in the corner of the level there is a button to transport you to the Ender Dragon, so collect all and prepare yourself\n","url":"https://my.mcpedl.com/storage/worlds/8671/images/ultimate-minecraft-masters_7.png"},{"text":"The Ender Dragon is waiting for you, so beware, he is very powerful\n","url":"https://my.mcpedl.com/storage/worlds/8671/images/ultimate-minecraft-masters_8.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/09/ultimate-minecraft-masters_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/8671/Ultimate-Minecraft-Masters_1599349541.mcworld"}],"uploadedBy":"Dantepicachu","uploadedAt":"6 Sep, 2020","supporteds":["1.16","1.6","1.7","1.8","1.9"],"originUrl":"https://mcpedl.com/ultimate-minecraft-masters/"}]