[{"title":"Othelloid Ver 1.0","briefDescription":"There are many Othello worlds but this map has special elements such as big stones and motions etc...Players can watch the Othello game from ...","Description":"","crawledImageUrls":[{"text":"There are many Othello worlds but this map has special elements such as big stones and motions etc?\nPlayers can watch the Othello game from just above the board or high place!\nLet?s play this world and enjoy!\n\u003e\nbattle players : 2 (Other players can watch the game)\nPush the button in the lobby ,and players stand on the black concrete or white one. Then Othello starts (first black player turn)\nIn the game ,You always have two items that is up arrow (red) and down one (blue). Use the up arrow ,you watch the game from high place and Use the down arrow , from just above the board.\nthe button on the diamond block made stone set motion on or off.\nthe button on the emerald block reset the game.\nHave fun!\n","url":"https://my.mcpedl.com/storage/worlds/10415/images/othelloidver10_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/10415/images/othelloidver10_3.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/othelloidver10_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10415/.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10415/.zip"},{"href":"https://dl.mcpedl.com/worlds/10415/osero.mcpack"}],"uploadedBy":"NYANKUN","uploadedAt":"9 Dec, 2020","supporteds":["1.16.100","1.16.101","1.16.200"],"originUrl":"https://mcpedl.com/othelloid-ver-1-0/"},{"title":"A Very Hard Rage Map!","briefDescription":"This is a map that wasn\u0027t too hard to build but is EXTREMLY hard to beat. There are 7 levels and NO check points. There are ...","Description":"","crawledImageUrls":[{"text":"This is a map that wasn?t too hard to build but is EXTREMLY hard to beat. There are 7 levels and NO check points. There are riddles, puzzle?s, parkour, tricks, and honestly I don?t think you can beat it. Now it is possible after like 1 million tries I beat it but it is very hard.\nHere is a look at some of the levels:\n","url":"https://my.mcpedl.com/storage/worlds/10407/images/a-very-hard-rage-map_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/a-very-hard-rage-map_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10407/a-rage-game_1608416220.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10407/a-rage-game_1607549686.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10407/a-rage-game_1607466137.mcworld"}],"uploadedBy":"Anuibus","uploadedAt":"9 Dec, 2020 (Updated)","supporteds":["1.16.101","1.16.201"],"originUrl":"https://mcpedl.com/a-very-hard-rage-map/"},{"title":"Void Parkour!","briefDescription":"In this parkour world you have to travel through 4 different levels. Each level gets harder as you go on. This is my first published world. ...","Description":"","crawledImageUrls":[{"text":"In this parkour world you have to travel through 4 different levels. Each level gets harder as you go on. This is my first published world. i also plan to regularly update this soo keep a look out!\n","url":"https://my.mcpedl.com/storage/worlds/10376/images/void-parkour_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/void-parkour_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10376/Void-Parkour-MCPE.DL.mcworld"}],"uploadedBy":"Binky_slinky","uploadedAt":"7 Dec, 2020","supporteds":["1.16.100"],"originUrl":"https://mcpedl.com/void-parkour/"},{"title":"Hi-Tech Build Battle Arena","briefDescription":"This hi-tech build battle arena comes with a simple ground converter, a theme picker with 20 themes, a flood option, and a clear button for easy ...","Description":"","crawledImageUrls":[{"text":"This hi-tech build battle arena comes with a simple ground converter, a theme picker with 20 themes, a flood option, and a clear button for easy clean up. If this world gets downloaded I will add more tools like an in-game timer or a cloning machine to easily save your works! I do not currently have any videos, however I plan to upload soon at Bread ? Rock, every subscriber will help grow my channel. Regardless if you subscribe, I hope you have fun building with these simple tools.\n","url":"https://my.mcpedl.com/storage/worlds/10307/images/hitech-build-battle-arena_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/hitech-build-battle-arena_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10307/aBuild-Battle.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10307/qzrEX93lOwA.zip"}],"uploadedBy":"Ex0ticLettuce","uploadedAt":"3 Dec, 2020","supporteds":["1.16.100","1.16.101","1.16.200","1.6"],"originUrl":"https://mcpedl.com/hi-tech-build-battle-arena/"},{"title":"Among Us Bedrock Edition V2","briefDescription":"This is mine and my friend\u0027s Skeld map on Minecraft Bedrock Edition, but it is a sequel to my original one! The map design is ...","Description":"","crawledImageUrls":[{"text":"This is mine and my friend?s Skeld map on Minecraft Bedrock Edition, but it is a sequel to my original one! The map design is better, and the tasks are better, the sabotages are better, and your friendships will be worse! Thank me later.\n","url":"https://my.mcpedl.com/storage/worlds/10312/images/among-us-bedrock-edition-v2_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/among-us-bedrock-edition-v2_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10312/Skeld-V2_1606958622.mcworld"}],"uploadedBy":"ThatOneDragon","uploadedAt":"3 Dec, 2020","supporteds":["1.15 (beta)","1.16","1.16.100","1.16.101","1.16.200","RTX Beta"],"originUrl":"https://mcpedl.com/among-us-bedrock-edition-v2/"},{"title":"Find The Button: The Journey","briefDescription":"A Classic Find the button map. There is a series of 9 Levels, which all has a unique style of completing, but ultimately, you just have ...","Description":"","crawledImageUrls":[{"text":"A Classic Find the button map. There is a series of 9 Levels, which all has a unique style of completing, but ultimately, you just have to find The Button. As the levels progress, it gets harder, and more frustrating to do, as you soon realize it wasn?t as simple as finding and pressing a button.\nHere are a few screenshots of the levels.\nA Nether themed level:\n","url":"https://my.mcpedl.com/storage/worlds/10256/images/find-the-button-the-journey_2.png"},{"text":"Cave themed level:\n","url":"https://my.mcpedl.com/storage/worlds/10256/images/find-the-button-the-journey_3.png"},{"text":"A normal themed level:\n","url":"https://my.mcpedl.com/storage/worlds/10256/images/find-the-button-the-journey_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/12/find-the-button-the-journey_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10256/2Find-The-Button_-The-Journey.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10256/2Find-The-Button_-The-Journey.zip"}],"uploadedBy":"AutoShade","uploadedAt":"2 Dec, 2020 (Updated)","supporteds":["1.16.101"],"originUrl":"https://mcpedl.com/find-the-button-the-journey/"},{"title":"SkyWars","briefDescription":"Fight to death in an offline skywars custom map! You can select kits and get tools , weapons and armor from chests to survive on islands ...","Description":"","crawledImageUrls":[{"text":"Fight to death in an offline skywars custom map! You can select kits and get tools , weapons and armor from chests to survive on islands in the void such as servers! and the map will reset after every fight.\n","url":"https://my.mcpedl.com/storage/worlds/10235/images/skywars-for-minecraft-pe_2.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/10235/images/skywars-for-minecraft-pe_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/10235/images/skywars-for-minecraft-pe_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/skywars-for-minecraft-pe_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10235/SkyWars-by-EnderKnight159_1606671891.mcworld"}],"uploadedBy":"EnderKnight159","uploadedAt":"30 Nov, 2020","supporteds":["1.13","1.14","1.15 (beta)","1.16"],"originUrl":"https://mcpedl.com/skywars-map-1/"},{"title":"Ice Covered Speed Way","briefDescription":"This is the second map I have made. It features a ice boat race coarse in a mountain biome with an abundance of spruce trees ...","Description":"","crawledImageUrls":[{"text":"This is the second map I have made. It features a ice boat race coarse in a mountain biome with an abundance of spruce trees surrounding it. There are also many obstacles.\n","url":"https://my.mcpedl.com/storage/worlds/10222/images/ice-covered--speed-way_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/ice-covered-speed-way_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10222/speed_way.mcworld"}],"uploadedBy":"IBLESKIM","uploadedAt":"29 Nov, 2020","supporteds":["1.16","1.16.100","RTX Beta"],"originUrl":"https://mcpedl.com/ice-covered-speed-way/"},{"title":"ESCAPE ROUND","briefDescription":"ESCAPE ROUND In this map you will test your knowledge of minecraft, both technical, history and ability to solve gamer Parkur-Questions-Aim-Flight-FollowI will only leave some ...","Description":"","crawledImageUrls":[{"text":"ESCAPE ROUND\nIn this map you will test your knowledge of minecraft, both technical, history and ability to solve gamer\nParkur-Questions-Aim-Flight-Follow\nI will only leave some photos it is not the whole map to see it complete download it\nPD-pay attention to the details you see.and also the map is set in Spanish\nmarksmanship tests\n","url":"https://my.mcpedl.com/storage/worlds/10162/images/escape-round_6.png"},{"text":"The map consists of 5 stages, each one more difficult than the previous one, they all have different tests\n","url":"https://my.mcpedl.com/storage/worlds/10162/images/escape-round_2.png"},{"text":"These are some small parts of the stages I will not complete so you can see for yourself\n","url":"https://my.mcpedl.com/storage/worlds/10162/images/escape-round_3.png"},{"text":"if you like the map tell me in the comments\n","url":"https://my.mcpedl.com/storage/worlds/10162/images/escape-round_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/escape-round_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10162/2ESCAPE-3ROUND-6VICO1233127.mcworld"},{"href":"https://mcpedl.com/leaving?url\u003dhttp%3A%2F%2Ftoolusts.com%2F1Fp2\u0026post_id\u003d166580"}],"uploadedBy":"vico124","uploadedAt":"28 Nov, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/escape-round-map/"},{"title":"NightWatch EPS","briefDescription":"Welcome to Everyone\u0027s Pizza Slice, an abandoned pizzeria whereby you watch over the place at night. Instead of the regular animatronics you expect at a ...","Description":"","crawledImageUrls":[{"text":"Welcome to Everyone?s Pizza Slice, an abandoned pizzeria whereby you watch over the place at night. Instead of the regular animatronics you expect at a FNaF Pizzeria ripoff, you see your friends? This time they are less predictable, since they are living breathing humans sprinting across the twisted halls.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_2.png"},{"text":"Grab a friend or more and come on down to Everyone?s Pizza Slice? except you aren?t here for the pizza nor the fun arcade games. One or two of you will have to work the night shift, and the rest are out for their blood?\nNight Guards will have to survive from 12am to 6am [6minutes real-life time] by protecting themselves from the Animatronics while the Animatronics relentlessly try to get into the Night Guard?s office and ambush them.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_3.png"},{"text":"The night guards have to make use of doors, vent seals and trapdoors to block any unwanted creatures. But do beware. These eat up your limited power supply, so managing them will be neccessary.\nThe Power Usage are as follow:\nApart from power, the Night Guard also has to watch out for their Oxygen levels, which decreases by 1 unit per second. If they runout of oxygen during their shift, they will be dazed and lose consciousness, hence, they will sufferfrom blindness, which hinders them from performing their jobs effectively.\nBefore you run out of oxygen, you can use the old oxygen pump in the office which pumps 5 units of oxygen per pump with a 2 second delay.\nHowever, once you run out of oxygen, the hydraulics of the oxygen pump will lack oxygen to function properly, and thus, it will be rendered unusable\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_4.png"},{"text":"Along with those, the night guards also have a vent tracker which monitors the estimated locations of the Animatronics. It may be unreliable but it can be really handy, especially when it is the only device which gives you an idea of where the Animatronics may be.\nThese trackers highlight the position of your friends when they?re hiding in the vents allowing you to trap them and send them back to the stage, before they get into your office and ambush you.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_5.png"},{"text":"If you happen to be on the stage, in the place of the haunted animatronics, you roam around the recently abandoned Pizzeria with an unknown motive, but you know one thing is certain, the Night Guard has to die.\nThe corridors, vents and air ducts are your weapons. Seize the opportunity when the night guard has their head turned to the opposite door, or when they are too focused on the vent tracker or trying their best to keep the oxygen supply running.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_6.png"},{"text":"This maze of pipes allow for the exchange of air, but it is big enough to fit a person, well big enough to house a gang of intruders looking to kill the night guard. There is however a way to rid the vents of the pests. There are swithces on the roof of the office, with labels corresponding the the vent seals in the vents, which are marked on the vent tracker.\nThese block off the vent from the office, denying access to those looking to use it as a passage way to the security office. Should someone be within the entrance to a closed seal, they will be stun locked before being sent back to the stage.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_7.png"},{"text":"There are two hallways on either side of the office, each can be accessed near the restrooms and down the corridor of the party rooms. These hallways are bent to increase travel distance should anything want to walk down the small walkway.\nThere are doors that can block animatronics present in the hallway from the office. Anything that attempts to run into the office only to find a closed door would be stun locked and sent back to the stage\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_8.png"},{"text":"This also allows for exchange of air, but this time across a shorter distance. This also means a shorter distance for animatronics. However this one is smaller than an air vent, which means they will have to crawl through it, it takes them exactly 7.5 seconds (150 in-game) to crawl through.\nThis journey can be interrupted however using a button activated trapdoor. If there is an animatronic that just-so-happens to be crawling there, it will be stun locked and sent back to the stage.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_9.png"},{"text":"Should you fail to reach the office, you will be stun locked on an enclosed stage for a period of time before you are allowed to move around again. But no camping, that is overpowered and can ruin the game for your friends. Just wait till it?s your turn to sit in the office and see how much you like it.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_10.png"},{"text":"Hope you enjoy it and have fun!\n???????????-\nRules\n???????????-\n[Detailed Guide] for More Details (Skip this part if you don?t want to spoil the experience for yourself)\nThis is a multiplayer minigame whereby 1 or 2 players will be the night guard while the rest will take the role of Animatronics. You can select whether there will be 1 or 2 night guards in the lobby.\nThe game will choose the closest person to the start button to be the night guard\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_11.png"},{"text":"The recommended pax is:\nWhen the game starts, the night guard will be sent to the office where they can collect their vent tracker from the box on the desk. Before the night guard officially start the game, he/she will be able to prepare and get familiar with the office.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_12.png"},{"text":"On the other hand, the Animatronics will be sent to the stage with closed curtains to wait for the night guard to officially start the shift\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_13.png"},{"text":"When the night guard is done inspecting the office, they can officially start the shift by pressing the button behind them, which will cause the vent tracker to reset and enable the night guard to control the doors, vents, air duct and oxygen pump.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_14.png"},{"text":"When the shift starts, the Animatronics will be released to the main stage where they can plot their attacks on the night guard.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_15.png"},{"text":"As soon as the game starts, the time will start ticking, the power and oxygen will start decreasing.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_16.png"},{"text":"The night guard will then have to survive from 12am to 6am (360s/6min) and conserve the limited power they have and keep their oxygen levels up.\nThe Oxygen will decrease by 1 unit every second, if the night guard runs out of oxygen, they will be blinded due to their gradually decreasing consciousness. This would hinder their ability to defend from door attacks and air duct attacks as it would be harder to see the Animatronic\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_17.png"},{"text":"Before oxygen runs out, oxygen can be pumped with the old oxygen pump in the office which pumps 5 units of oxygen per pump (button click) with a 2 second delay.\nHowever, once you run out of oxygen, the hydraulics of the oxygen pump will lack oxygen to function properly, and thus, it will be rendered unusable\nThe Power Usage are as follow:\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_18.png"},{"text":"One way in which the Animatronics can attack the night guard are the vents, but, the Animatronics can be tracked by the guards in there via the vent tracker and the Animatronics are slower in the vents but they can sprint jump\nThe locations of the vent exits and entrances are as follows:\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_19.png"},{"text":"The night guard can defend themselves using the vent tracker and shutting the appropriate vent seal.\nOn the vent tracker, the Animatronics are displayed as orange squares and red on a vent seal indicates that the vent seal is inactive/open while green indicates that the vent seal is active/closed.\nIn the example above, the Animatronic (indicated by the Orange square) is at Vent Seal 3, almost going to the office. And therefore, I activated Vent Seal 3 to shut the seal and send the Animatronic back to the Stage for a cooldown (15s if there is 2 guards, 20s if there is 1 guard).\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_20.png"},{"text":"When the vent seal is active, if the Animatronic is within a 2 block range behind the seal, they will get sent back to the stage for a cooldown. Because of the limited range, the night guard has to time the closing of the seal and the players playing as an Animatronic is discouraged to camp 3 blocks before the seal as it is unfair for the guard.\nHowever, there is an exception in Vent Seal 1, the diagram of Vent Seal 1 is as shown below.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_21.png"},{"text":"In Vent Seal 1, instead of the Animatronic being sent back if they are 2 blocks behind the Vent Seal, they will also be sent back if they are 4 blocks in front of the seal. This is done to ensure fairness. The Safe Area will be indicated by a sign as shown in the diagram. This change was made in order to discourage Animatronics camping on the ladder and make it more fair to the guard by creating a broader window of time for them to react.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_22.png"},{"text":"The 2nd way at which the Animatronics can attack the guard is through the 2 doors which are connected by hallways which are located at the following areas:\nThe hallways may be long and tedious for the Animatronics but the guards won?t be able to track Animatronics in the hallway and they have to actually check the door hallways to check for any Animatronics.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_23.png"},{"text":"Once the Animatronics have made it through the long hallways, they will see the doors of the office and they will need to make the final sprint into the guard?s office to win.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_24.png"},{"text":"For the night guards to defend against door attacks, they will have to occassionally check for Animatronics in the doorway. If there is an Animatronic there, they will have to flick the lever to close the door.\nOnce the door is closed, any Animatronics that can be seen in the doorway will be sent back to the stage for a cooldown. For a better game experience, the players playing as Animatronics shouldn?t camp at the side of the doorway to prevent getting caught.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_25.png"},{"text":"The last way in which the Animatronic can attack the guard is through the Air Duct which is in the Parts \u0026 Services room which is accessible backstage. Though the Air Duct is the quickest way to attack the guard, Animatronics can be easily spotted there and sent back as the Air Duct requires no power to be shut and it is right at the desk of the guard office.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_26.png"},{"text":"To crawl through the Air Duct and attack the night guard, the Animatronic will have to click the button at the Air Duct. The Animatronics will then crawl 1 block in the air duct per 1.5 seconds and it will take them a total of 7.5 seconds to crawl into the guard office and win.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_27.png"},{"text":"The guard will have to periodically check the Air Duct for any Animatronics and click the button on top to shut the Air Duct which will send back any Animatronics that is crawling in the Air Duct back to the stage for a cooldown.\n","url":"https://my.mcpedl.com/storage/worlds/10136/images/nightwatch-eps_28.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/nightwatch-eps_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10136/Nightwatch-EPS_1606145369.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10136/Nightwatch-EPS_1606145369.zip"}],"uploadedBy":"FYRE","uploadedAt":"26 Nov, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/nightwatch-eps/"},{"title":"Fire and Ice Alpha","briefDescription":"A world that has a couple of heat or cold themed minigames on it, like spleef (snow) and SKOG. (Snow and Lava) The proper game ...","Description":"","crawledImageUrls":[{"text":"A world that has a couple of heat or cold themed minigames on it, like spleef (snow) and SKOG. (Snow and Lava) The proper game details are in the description. The lobby/games are located in a plains/forest area, near a deep drop cave. There is no way for me to give people VIP (You get a diamond shovel and access to the VIP caves, which just gives you the diamond shovel but I can make benefits of VIP better) so if you are a host, get yourself a button, and anyone else you want to a button. (A thing to note, after you vote for the minigame, you may want to actually select the game with the most votes. Go to the other side of the wall and press which button had the most votes. However, anybody could cross the wall, so it is advised you play with friends that won?t muck around and grief things.\nI am planning on making updated versions of this, but I need game ideas. If it?s possible (and simple enough that I don?t give up) I will create special abilities for some games. I will also make some more of the games. Maybe even a deaths/scoring system! VIP is just another thing I have to work on.\n","url":"https://my.mcpedl.com/storage/worlds/10145/images/fire-and-ice-alpha_3.png"},{"text":"Spleef is the classic ?Drop you down? game where you mine snow under your opponents? feet. This time there are multiple twists.\n1. You can build. (Snow blocks only ? other players and you can mine these. Automatically refreshes the playing field (removes all structures) every 1 minute until A certain point. The game will notify you when the field will stop refreshing.\n2. You can throw Ender Pearls and Snowballs., You can throw Ender Pearls everywhere except out of bounds, which is throwing them down towards the ground. Snowballs can be thrown anywhere.\n3. There are 2 floors of snow. You start on the top floor, and you get up to the top one again by building or throwing an Ender Pearl (Be warned, if you throw it into the roof, you teleport to the top of the roof. I will solve this in a future update.\n4. If you fall, it?s NOT over yet! When you fall to your death, there are multiple holes in the ground. Falling in them means you fall into water. In that underground ?lake?, you will find a button. Press that to get Ender Pearls and Snowballs.\nEnder Pearls and Snowballs are used in other games.\nSKOG (Snowball KO Game) is a team game where you throw snowballs at the enemy (on a platform) to knock them into lava. You select a spawn place. Take note of which team you side with, because it?s against the rules to change teams. Try to keep teams even and equal. You can also use Ender Pearls to teleport to the enemies? platform, where you can use your fist or snowballs (In a future update you will get a knockback sword) to take enemies by surprise.\nBlazes! (WIP. It?s accessible, (Maybe, I think) but you are advised not do do it, because there is no way back. The signs with a red X in brackets (X) under the name is not to be used, unless you want to ruin the gaming experience until you try and sort it out. The description of this game is what I am planning. It is subject to change.) is the most recent game I?m working on. You will be given a background story in the chat, and then after 30 seconds, waves of blazes will start spawning. There is a set amount of time between waves, that may vary from 15 seconds to 45 seconds. If you die, you cannot get back in, but you can spectate from a bird?s eye view. (Beware that it WILL summon the next wave on time regardless if you finished the previous wave or not. Also be aware that I may have some problems, because I don?t know how to finish the game when all players or monsters are dead. I may put a timer on the game, where you lose if you don?t kill the monsters in a certain amount of time. Regardless, I will figure things out.)\n!Warning: This is not grief proof. You can also farm for resources. Please don?t do that. Your best asset will be kicking or banning. There are multiple flaws which will only get solved until I get the ability to use commands to make blocks in a certain area breakable, and allow NPCs to be tapped so they can scan inventories. I need info like that.\n","url":"https://my.mcpedl.com/storage/worlds/10145/images/fire-and-ice-alpha_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/fire-and-ice-alpha_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10145/Fire-and-Ice-Alpha_1606274910.mcworld"},{"href":"https://dl.mcpedl.com/worlds/10145/Fire-and-Ice-Alpha.mcworld"}],"uploadedBy":"SupaNova2006","uploadedAt":"25 Nov, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/fire-and-ice-alpha-map/"},{"title":"The Heist ? Guards vs. Thieves","briefDescription":"The Heist - Guards vs. Thieves is a multi player combat map made by me where a team of thieves and guards battle for the ...","Description":"","crawledImageUrls":[{"text":"The Heist ? Guards vs. Thieves is a multi player combat map made by me where a team of thieves and guards battle for the sake of the bank?s balance!\nWelcome to The Heist ? Guards vs. Thieves! This is a multiplayer map for 2-6 players in which there are two teams: guards and thieves. The thieves attempt to steal the bank?s balance by using the items from a nearby loot chest, while the guards try to stop them from doing so.\nThis map contains multiple secret areas and chests within them. I have made this in 1.16.100, however I think it would work in 1.16.0 as well, but why would anyone stay in 1.16.0? Either way, this is all I have to say, literally. Have fun, and see you next time!\n","url":"https://my.mcpedl.com/storage/worlds/10141/images/the-heist--guards-vs-thieves_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/the-heist-guards-vs-thieves_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10141/The-Heist---Guards-vs.-Thieves.mcworld"}],"uploadedBy":"DireCubey67","uploadedAt":"24 Nov, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/the-heist-guards-vs-thieves/"},{"title":"Coloured Deathrun","briefDescription":"Disclaimer : This will probably be the last bug update as I want to work on other maps and also so that this map will not ...","Description":"","crawledImageUrls":[{"text":"Disclaimer : This will probably be the last bug update as I want to work on other maps and also so that this map will not keep going to the top of .mcworld maps as the default filter is ?latest?\nA runner vs the Trap maker. Who will you be? Beat the course within the time while the Trap maker is making your journey to the end more challenging. Here is a preview on the map traps!\nThis game is meant for at least 2 players\nIn colored Deathrun, there will be 1 Death(Trap maker) and the other players will be runners. Runners have to run through 4 different colored theme courses.\nThe runners win when 1 runner makes it to the end. The Death wins when no runner makes it to the end within 5 minutes\n","url":"https://my.mcpedl.com/storage/worlds/5867/images/coloured-deathrun_2.gif"},{"text":"Runners have to avoid traps which will be set by the Death. Here are some examples of the Runner being trapped by the Death :\n","url":"https://my.mcpedl.com/storage/worlds/5867/images/coloured-deathrun_3.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5867/images/coloured-deathrun_4.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5867/images/coloured-deathrun_5.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/5867/images/coloured-deathrun_6.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/coloured-deathrun_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/5867/DeathRun_1606223430.mcworld"},{"href":"https://dl.mcpedl.com/worlds/5867/DeathRun_1600266092.mcworld"}],"uploadedBy":"JJJ_","uploadedAt":"8 May, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/coloured-deathrun/"},{"title":"Battle Box","briefDescription":"A remake of Battle Box from MCC (Minecraft Championship) into a Bedrock Version you and your friends can play on! If you don\u0027t know whats ...","Description":"","crawledImageUrls":[{"text":"A remake of Battle Box from MCC (Minecraft Championship) into a Bedrock Version you and your friends can play on! If you don?t know whats Battle Box, it?s a 4 vs 4 minigame where which team have to fill in the middle with 9 wool of their color. They can also kill each other, be aware of that.\nI have added tons of commands to prevent cheating in any possible way, so you don?t have to worry about a lot of arguments of intentional game design when a team unfairly wins.\n","url":"https://my.mcpedl.com/storage/worlds/9090/images/battle-box_15.png"},{"text":"How to Play: You will be put into a lobby where you can choose which team to join, it can be 4v4, 1v1, 1v4, etc.\n","url":"https://my.mcpedl.com/storage/worlds/9090/images/battle-box_16.png"},{"text":"You should be put into another room once you have chosen a team. Once you and everybody have chosen a team, click ?Start Game.?\n","url":"https://my.mcpedl.com/storage/worlds/9090/images/battle-box_17.png"},{"text":"After you have clicked ?Start Game,? you should be in the map selector room where you choose a map to play on. For now there is one, I am trying my best to make the most unique maps apart from all, hope you understand.\n","url":"https://my.mcpedl.com/storage/worlds/9090/images/battle-box_12.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/9090/images/battle-box_14.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/9090/images/battle-box_9.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/battle-box_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9090/Battle-Box-1.0.6_1606152592.mcworld"},{"href":"https://dl.mcpedl.com/worlds/9090/Battle-Box-1.0.6_1606105179.zip"}],"uploadedBy":"Superkitty87","uploadedAt":"29 Sep, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/battle-box-map/"},{"title":"Push The Button! [Minigame] [Multiplayer]","briefDescription":"Welcome to Push The Button!This fun and addictive game are compatible with up to 5 players! So far there are 2 AWESOME game modes!1. Push The ...","Description":"","crawledImageUrls":[{"text":"This fun and addictive game are compatible with up to 5 players! So far there are 2 AWESOME game modes!\n1. Push The Button: 3 Players. 2. Shoot the button: 3-5 Players.\n","url":"https://my.mcpedl.com/storage/worlds/10128/images/push-the-button-minigame-multiplayer_2.png"},{"text":"Push The Button is a duel-like game mode where two players face up against each other to be the first person to push their shiny button in front of them!\n","url":"https://my.mcpedl.com/storage/worlds/10128/images/push-the-button-minigame-multiplayer_3.png"},{"text":"Shoot The Button is a CRAZY party game where up to 4 players battle it out to be the first person to shoot the button in front of them.\n","url":"https://my.mcpedl.com/storage/worlds/10128/images/push-the-button-minigame-multiplayer_4.png"},{"text":"Both game modes include one host. the host controls the games and when the games start! its fun for all and your bound to have a great time!\n","url":"https://my.mcpedl.com/storage/worlds/10128/images/push-the-button-minigame-multiplayer_5.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/push-the-button-minigame-multiplayer_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10128/PushTheButton1.1.mcworld"}],"uploadedBy":"MessiMassi","uploadedAt":"23 Nov, 2020 (Updated)","supporteds":["1.14"],"originUrl":"https://mcpedl.com/push-the-button-minigame-multiplayer/"},{"title":"Cp Microbattles","briefDescription":"Microbattles is a popular game which there is 4 team and you have to kill all the team you can play with up to 30 players. Me ...","Description":"","crawledImageUrls":[{"text":"Microbattles is a popular game which there is 4 team and you have to kill all the team you can play with up to 30 players. Me and my crew worked really hard on this so please enjoy.\n","url":"https://my.mcpedl.com/storage/worlds/8910/images/cp-microbattles_7.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/cp-microbattles_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/8910/cp-micro.mcworld"}],"uploadedBy":"Heartedupper13","uploadedAt":"19 Sep, 2020 (Updated)","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/cp-microbattles-map/"},{"title":"World or Rarity","briefDescription":"It is a skywars map and more multiplayer with 4 islands, you can also play with two players.However, this map is still in beta testing, ...","Description":"","crawledImageUrls":[{"text":"It is a skywars map and more multiplayer with 4 islands, you can also play with two players.\nHowever, this map is still in beta testing, there could be some bugs.\n","url":"https://my.mcpedl.com/storage/worlds/10029/images/world-or-rarity_2.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/world-or-rarity_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10029/World-or-Rarity.mcworld"}],"uploadedBy":"Kirito-06","uploadedAt":"18 Nov, 2020","supporteds":["1.16","1.16.100"],"originUrl":"https://mcpedl.com/world-or-rarity-map/"},{"title":"The Snake Game","briefDescription":"Remember that classic snake game form back in the Nokia glory days. Well now you can play that game inside of Minecraft!! It was done ...","Description":"","crawledImageUrls":[{"text":"Remember that classic snake game form back in the Nokia glory days. Well now you can play that game inside of Minecraft!! It was done with just a few simple commands and a bit of time.\n","url":"https://my.mcpedl.com/storage/worlds/10004/images/the-snake-game_2.png"},{"text":"The Snake Game, a true classic. I have a lot fond memories about this simple yet challenging game and so I made it in Minecraft!\nFor anyone who is unaware of exactly what this game is, well it?s quite simple. You control a snake. You move around and have to eat food, but for each bite your body gets longer. When you crash head first into a wall, or your tail, it?s game over.\n","url":"https://my.mcpedl.com/storage/worlds/10004/images/the-snake-game_3.png"},{"text":"The controls are pretty snappy and responsive. You can control the direction of the snake by moving you player in the direction that you want the snake?s head to go (forwards, backwards, left and right)\n","url":"https://my.mcpedl.com/storage/worlds/10004/images/the-snake-game_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/the-snake-game_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/10004/The-Snake-Game_1605545762.mcaddon"}],"uploadedBy":"GoggledGecko","uploadedAt":"17 Nov, 2020","supporteds":["1.16"],"originUrl":"https://mcpedl.com/the-snake-game-map/"},{"title":"Roblox Noob Defense [PvE/Minigame] (Gamemode Update!)","briefDescription":"A strange force of mobs calling themselves \u0027noobs\u0027 have come to minecraft! No one quite knows what the noobs are doing in minecraft or why ...","Description":"","crawledImageUrls":[{"text":"A strange force of mobs calling themselves ?noobs? have come to minecraft! No one quite knows what the noobs are doing in minecraft or why they came to begin with, all we know is that they aren?t friendly. Perhaps they came here by mistake?? Anyways, it?s up to you to defend fort Minecraft from the noob invasion!\nThe latest version updates the gameplay with a new perk system, a new crossbowman class, new noobs, and more!\nThis map was inspired by similar games on the platform ?roblox? such as Guest Defense.\n","url":"https://my.mcpedl.com/storage/worlds/3804/images/roblox-noob-defense-pveminigame_2.png"},{"text":"Armies of noobs will spawn overtime, depending on which gamemode is chosen.\n","url":"https://my.mcpedl.com/storage/worlds/3804/images/roblox-noob-defense-pveminigame_3.png"},{"text":"Last long enough, and a Boss Noob will spawn! Each gamemode has its own unique boss!\n","url":"https://my.mcpedl.com/storage/worlds/3804/images/roblox-noob-defense-pveminigame_4.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/roblox-noob-defense-pveminigame_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/3804/noob-defense-update.mcworld"},{"href":"https://dl.mcpedl.com/worlds/3804/updated_behaviors_1605486884.mcpack"},{"href":"https://dl.mcpedl.com/worlds/3804/updated_resources_1605486884.mcpack"}],"uploadedBy":"Jaser314","uploadedAt":"5 Jan, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/roblox-noob-defense-map/"},{"title":"Starlight Games","briefDescription":"?Starlight Games?This is a Minigames World I created for Minecraft Bedrock Edition (Playable on Windows 10, Android, IOS, XBOX One, PS4, Nintendo Switch).Subscribe to ...","Description":"","crawledImageUrls":[{"text":"?Starlight Games?\nSubscribe to Final Starly on Youtube for Frequent Updates \u0026 Tutorial/Testing/Gameplay Footage: https://www.youtube.com/channel/UCFbhvGzNi3LJRK7Ka1VC4dw\nJoin Our Discord to get Frequent Updates \u0026 New Versions Earlier than Released Here: https://discord.gg/ac4JchH\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_13.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_15.png"},{"text":"Please don?t change Game Modes (Creative, Survival, etc.) in this Map or change any Command Blocks if you?re not sure what you?re doing or risk reinstalling Map!\nAll Shops and Prices are Listed Here [Syntax; ItemName Quantity Material/Currency Quantity]:\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_3.png"},{"text":"Wooden Sword \u003d Feather x1\nStone Sword \u003d Feather x1, Rabbit?s Foot x1\nIron Sword \u003d Blaze Rod x2\nBow \u003d Ink Sac x3\nArrow x5 \u003d Feather x2\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_4.png"},{"text":"Armour:\nLeather \u003d Feather x1, Rabbit?s Foot x1, Ink Sac x1\nChain \u003d Blaze Rod x2\nIron \u003d Nether Star x6\nDiamond \u003d Nether Star x20\nNetherite \u003d Nether Star x 40\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_5.png"},{"text":"Food:\nCarrot ?5 \u003d Feather x1\nSteak ?5 \u003d Feather x1, Rabbit?s Foot x1\nGolden Apple ?1 \u003d Blaze Rod x3\nEnchanted Golden Apple x1 \u003d Nether Star x30\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_6.png"},{"text":"Effects \u0026 Special:\nJump 2 \u003d Nether Star x1\nSpeed 3 \u003d Nether Star x2\nSaturation 255 \u003d Nether Star x5\nArrow-Rain Snowball x1 \u003d Nether Star x3\nArrow-Rain Snowball-Rain Egg x1 \u003d Nether Star x 9\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_7.png"},{"text":"Currency:\nBlaze Rod \u003d Feather x1, Rabbit?s Foot x1, Gunpowder x1, Ink Sac x1\nNether Star \u003d Blaze Rod x4\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_8.png"},{"text":"","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_9.png"},{"text":"?????????????????????????????????\nTo play the game, you must:\nWalk forward from spawn, following the arrow marked on the ground.\nYou should then talk to the Dandy Lil? Robot and tell them that you have Subscribed to Final Starly on Youtube claim your GameTicket(s) (Cookies) as these act as passes which you require in order to play minigames in this world. You should also take his advice and Join Our Discord too!\nAfter this, find the Yellow Man and inform him that you wish to play MobWars(Solo)!\nYou will now be teleported to a small room where you can inform another Yellow Man that you would like to Start the Game!\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_10.png"},{"text":"To End the game, press End Game.\n","url":"https://my.mcpedl.com/storage/worlds/9898/images/starlight-games_12.png"}],"imageUrl":"https://mcpedl.com/wp-content/uploads/2020/11/starlight-games_1-520x245.png","downloadUrls":[{"href":"https://dl.mcpedl.com/worlds/9898/StarlightGames_1605036216.mcworld"},{"href":"https://discord.gg/ac4JchH"}],"uploadedBy":"FinalStarly","uploadedAt":"13 Nov, 2020 (Updated)","supporteds":["1.16"],"originUrl":"https://mcpedl.com/starlight-games-map/"}]